
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = "_ВозвратОтПокупателя";
	Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	// © Primus1C  25.12.2023  НАЧАЛО ►
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда
	//	гоСтандартныйОтбор(Список, 1, Истина, Мас)
	//КонецЕсли;
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	гоСтандартныйОтборПоПолю("Склады", Список, "Склад");
    глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	//УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

