#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда Сообщить(НСтр("ru = 'Копирование расходных накладных запрещено!'; en = 'Copying sales invoices is prohibited!'")); Отказ = Истина; Возврат; КонецЕсли; 
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	//2016.09.12
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если гоПользователь().НеВидетьЧужиеНакладные Тогда
			Если гоПользователь() <> Объект.КемСоздан Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли; КонецЕсли; 
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	ЧислоЗнаковКоличество = Объект.Фирма.ЧислоЗнаковКоличество;
	//ЧислоЗнаковЦена = Объект.Фирма.ЧислоЗнаковЦена;
	ЧислоЗнаковЦена = 4;
	
	Элементы.ТоварыКоличество.Формат 					= "ЧДЦ=" + ЧислоЗнаковКоличество;
	Элементы.ТоварыЦенаПродажи.Формат 					= "ЧДЦ=" + ЧислоЗнаковЦена;
	Элементы.ТоварыНоменклатураРодитель.Видимость 		= Объект.Фирма.ВыводитьГруппа;
	Элементы.ТоварыНоменклатураПроизводитель.Видимость 	= Объект.Фирма.ВыводитьПроизводитель;
	Элементы.ТоварыСерия.Видимость 						= Объект.Фирма.ВыводитьСерия;
	Элементы.ТоварыПартияСрокГодности.Видимость 		= Объект.Фирма.ВыводитьСрокГодности;
	
	//Элементы.ТоварыУдалитьВсе.Видимость = Истина;
	
	//Попытка
	//	Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	//Исключение
	//КонецПопытки; 
	
	//2015.12.08
	//Элементы.ТоварыстрПроцент.Видимость 				= ВКД_ПроверитьДоступностьРоли();
	
	//2016.03.25
	Элементы.РучнойШК.Видимость 						= гоПользователь().КлавиатурныйСканерШК;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда
	Если Мас.Найти(Объект.Склад) = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли; 

	// © Primus1C  29.07.2023  НАЧАЛО ►  
	
	Режим = ОбщегоНазначенияПовтИсп.ВидимостьНаценки();
	Элементы.ТоварыЦенаЗакупки.Видимость	= Режим;
	Элементы.ТоварыстрПроцент.Видимость		= Режим;
	Элементы.ТоварыПроцент.Видимость		= НЕ Режим;

	ЗаполнитьКэшДанных();
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка._Инвойс") Тогда
			Если Объект.ДокументОснование.Проформа = Перечисления.ВидыИнвойса.Инвойс Тогда
				ТолькоПросмотр = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.Валюта 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");
		Объект.Склад 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	КонецЕсли;    
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Процент = ПредставлениеНаценки(СтрокаТЧ.стрПроцент);
	КонецЦикла;

	СтруктураПечатныхФорм = Документы.РасходнаяНакладная.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	ЕстьОплата = Ложь;
	//2016.08.26
	//этоЧужой = Ложь;
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		ЕстьОплата = омСервер.ЕстьОплатаДокумента(Объект.Ссылка); 
		//2016.08.26
		//этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный ИЛИ ЕстьОплата ИЛИ (Объект.СуммаПривязано <> 0) 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	УстановитьВидимостьДоступность();
	МоиИтоги();
	
	РаботаСоСканеромШК.СканерШКПодключить(); 

	// © Primus1C  27.12.2023  НАЧАЛО ►  
	ОтобразитьЦветВалюты();
	ОтобразитьДолгИРазрешения();	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги();  

	// © Primus1C  06.07.2023  НАЧАЛО ►
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПеречитатьДанныеФормыДокумента" Тогда
		Модифицированность = Истина;
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура МоиИтоги()
	
	// © Primus1C  02.12.2023  НАЧАЛО ►
	//стрИтого = "";
	//стрОплата = "";
	//омСервер.МоиИтоги(Объект, стрИтого, стрОплата); 
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект);
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	стрОплата = СтруктураИтогов.Оплата;
	// © Primus1C  ОКОНЧАНИЕ ◄ 
	
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "?";
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	стрОстатки = омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, Стр.Партия);
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	Записать(РежимЗаписиПроведение);
	МоиОстатки();
	МоиИтоги();   
		
	// © Primus1C  19.01.2025  НАЧАЛО ►
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Процент = ПредставлениеНаценки(СтрокаТЧ.стрПроцент);
	КонецЦикла;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	ЕстьСтроки = Объект.Товары.Количество() > 0;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	//2015.12.08 попробуем только по закрыто
	Элементы.Дата.ТолькоПросмотр = Закрыто;		//Объект.Проведен ИЛИ
	Элементы.Склад.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;
	
	//2015.12.12
	Элементы.Контрагент.ТолькоПросмотр = Закрыто;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	МоиОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	МоеДобавление();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	МоеРедактирование(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Товары", ""));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	МоеУдаление();
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавление()  
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Отказ = "";
	Если гоПЗ(Объект.Склад) Тогда Отказ = НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'"); КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда Отказ = Отказ + Символы.ПС + НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'"); КонецЕсли; 
	Если Отказ <> "" Тогда
		клОшибка(Отказ);
		Возврат;
	КонецЕсли;
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли;  // если док-т вообще не записан
	
	Попытка
		НовНом = Элементы.Товары.ТекущиеДанные.Номенклатура;
		НовПар = Элементы.Товары.ТекущиеДанные.Партия;
	Исключение 
		НовНом = гоПустой("Номенклатура");
		НовПар = гоПустой("Партии");
	КонецПопытки;
	
	МоеДобавлениеШаг(НовНом);
	
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеШаг(НовНом)
	//гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораНоменклатуры", ЭтотОбъект), НовНом, НСтр("ru = 'Выберите номенклатуру'; en = 'Select good'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораНоменклатуры(НовНом, ДопПараметры) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	
	//2016.12.14
	Если гоРеквизит(НовНом, "ЗапретОтгрузки") Тогда 
		клОшибка(НСтр("ru = 'Включен запрет отгрузки, выберите другую номенклатуру!'; en = 'Shipment prohibition is enabled, select another good!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	//УчетПоСериям = гоРеквизит(НовНом, "УчетПоСериям");
	//та пусть добавляют что хотят, мы будем партию проверять
	//Если НЕ УчетПоСериям Тогда
	//	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
	//	Если НЕ (Нашли.Количество() = 0) Тогда клВнимание(гоИмя(НовНом) + ": уже есть в документе!" + гоРС() + "Возможно, нужно просто отредактировать количество!!!") КонецЕсли;
	//КонецЕсли; 
	
	//2015.11.18
	//ну а что тут делать в ручном? просто выбирать партии, наверное, не списывать же их по ФИФО?
	//у нас такого вообще то и нет, хотя когда-то делали
	
	//2016.05.24
	//Усл = гоРеквизит(НовНом, "Услуги");
	//Если Усл Тогда 
	Если гоРеквизит(НовНом, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда 
		Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Нашли.Количество() > 0 Тогда 
			клОшибка(СтрШаблон("%1: %2!%3%4!!!", 
								гоИмя(НовНом),
								НСтр("ru = 'уже есть в документе'; en = 'is already in the document'"),
								Символы.ПС,
								НСтр("ru = 'Используйте редактирование количества'; en = 'Use quantity editing'"))); 
			МоеДобавлениеШаг(НовНом); 
			Возврат; 
		КонецЕсли;
		НовЦен = 0;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеДобавлениеПослеВводаСуммыУслуги", ЭтотОбъект, НовНом), НовЦен, НСтр("ru = 'Сумма услуги (количество будет 1)'; en = 'Amount of service (quantity will be 1)'"), 19, ЧислоЗнаковЦена);
	Иначе 
		гоУстановитьПараметрСеанса("Склад", Объект.Склад);
		гоУстановитьПараметрСеанса("Номенклатура", НовНом);
		ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораПартии", ЭтотОбъект, НовНом), НовПар, НСтр("ru = 'Выберите партию'; en = 'Select batch'"));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВводаСуммыУслуги(НовЦен, НовНом) Экспорт
	Если НовЦен = Неопределено Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	Если НовЦен = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введена сумма услуги!'; en = 'Sum is not inputed!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	клСохранитьИзменения(Новый ОписаниеОповещения("МоеДобавлениеПослеПодтвержденияУслуги", ЭтотОбъект, 
		Новый Структура("НовНом,НовПар,НовКол,НовЦен", НовНом, 0, 1, НовЦен)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеПодтвержденияУслуги(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда 
		МоеДобавлениеШаг(Параметры.НовНом); 
		Возврат; 
	КонецЕсли; 
	
	МоеДобавлениеЗавершить(Параметры.НовНом, Параметры.НовПар, Параметры.НовКол, Параметры.НовЦен);
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораПартии(НовПар, НовНом) Экспорт
	Если НовПар = Неопределено Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	//тут работает выбор нормально, получим остаток партии, вдруг выбрали без остатка
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если ОстПар <= 0 Тогда 
		клОшибка(НСтр("ru = 'Нет остатка у выбранной партии!'; en = 'The selected batch has no balance!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Партия", НовПар));
	Если Нашли.Количество() > 0 Тогда 
		клОшибка(СтрШаблон(НСтр("ru = '%1: уже есть в документе!%2Используйте редактирование количества!!!'; en = '%1: already in the document!%2Use quantity editing!!!'"), гоИмя(НовПар), гоРС()));
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	 //ВКД++
	//НовЦен = омСервер.ПересчетЗн(гоРеквизит(НовПар, "ЦенаЗакупки"), гоРеквизит(НовПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);
	ЦенаСоСкидкой = гоРеквизит(НовПар, 	"ВКД_ЦенаСоСкидкой");
	ЦенаЗакупки = гоРеквизит(НовПар, 	"ЦенаЗакупки");
	
	Сумма = ?(ЦенаСоСкидкой = 0, ЦенаЗакупки, ЦенаСоСкидкой ) + ЗатратыПартии(НовПар);
	
	// © Primus1C  27.04.2026  НАЧАЛО ►
	//НовЦен = омСервер.ПересчетЗн(Сумма, гоРеквизит(НовПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);			
	ЦенаСЗатратами = РаботаСВалютой.Пересчитать2025(Сумма, гоРеквизит(НовПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата);			
	// © Primus1C  ОКОНЧАНИЕ ◄
	//ВКД--
		 
	Пар = Новый Структура;
	Пар.Вставить("Фирма", Объект.Фирма);
	Пар.Вставить("Номенклатура", НовНом);
	Пар.Вставить("Валюта", Объект.Валюта);
	Пар.Вставить("Количество", ОстПар);
	Пар.Вставить("Цена", ЦенаСЗатратами);
	Пар.Вставить("ЦенаЗакупки", ЦенаСЗатратами);
	Пар.Вставить("Склад", Объект.Склад);
	Пар.Вставить("Партия", НовПар);
	
	ОткрытьФорму("ОбщаяФорма.ВводСтрокиРН", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоеДобавлениеПослеВводаСтроки", ЭтотОбъект, Новый Структура("НовНом,НовПар", НовНом, НовПар)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВводаСтроки(Пар, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	
	Если гоПЗ(Пар) Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	НовЦен = Пар.Цена;
	Если НовЦен = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введена цена продажи!'; en = 'Selling price not entered!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	НовКол = Пар.Количество;
	Если НовКол = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity not entered!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	клСохранитьИзменения(Новый ОписаниеОповещения("МоеДобавлениеПослеПодтвержденияПартии", ЭтотОбъект, 
		Новый Структура("НовНом,НовПар,НовКол,НовЦен", НовНом, НовПар, НовКол, НовЦен)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеПодтвержденияПартии(Результат, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	НовКол = Параметры.НовКол;
	НовЦен = Параметры.НовЦен;
	
	Если НЕ Результат Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если НовКол > ОстПар Тогда 
		клОшибка(СтрШаблон(НСтр("ru = 'Не хватило остатка %1 для %2, исправлено на %3!'; en = 'There was not enough balance %1 for %2, corrected for %3!'"), Строка(НовКол - ОстПар), гоИмя(НовПар), ОстПар));
		НовКол = ОстПар;
	КонецЕсли;
	
	МоеДобавлениеЗавершить(НовНом, НовПар, НовКол, НовЦен);
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеЗавершить(НовНом, НовПар, НовКол, НовЦен)
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = НовПар;
	НовСтр.Количество = НовКол;
	НовСтр.ЦенаПродажи = НовЦен;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	МоеДобавлениеШаг(НовНом);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗатратыПартии(Партия)

	ВсеЗатраты = Документы.РасходнаяНакладная.ЗатратыПартий(Партия);	
	Результат = 0;  
	сум = ВсеЗатраты.ЗатратыПартии.Получить(Партия); 
	Если сум <> Неопределено Тогда
		Результат = Результат + сум;
	КонецЕсли;
	сум = ВсеЗатраты.ЗатратыПартииИнвойсов.Получить(Партия); 
	Если сум <> Неопределено Тогда
		Результат = Результат + сум;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ЛюбаяСерия(НовСер, СтатьНаРучной = Ложь, ЦенаУжеТут = -1)
//2016.03.25 + СтатьНаРучной = Ложь
//2016.04.07 + ЦенаУжеТут = -1

	ШК = СокрЛП(НовСер);
	Если ШК = "" Тогда Возврат КонецЕсли; 

	//2016.04.07
	Если НЕ (ЦенаУжеТут = -1) Тогда  
		//придется все продублировать
		Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
		Если Объект.Окончательно Тогда Возврат КонецЕсли; 
		
		МоиИтоги();
		Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
		
		Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
		Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
		
		Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	КонецЕсли; 
	
	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	Ско = СпиПар.Количество();
	Если Ско = 0 Тогда
		Сигнал();
		клОшибка(СтрШаблон("%1: %2 %3", 
							омСервер.Фрмт(НСтр("ru = 'Нет остатков по серии'; en = 'There are no remaining goods for the series!'"), "НАДПИСЬ_ЦВ1"), 
							омСервер.Фрмт(ШК, "НАДПИСЬ_ЦВ2"),
							омСервер.Фрмт("!", "НАДПИСЬ_ЦВ1")));
		Возврат;
	ИначеЕсли Ско > 1 Тогда
		Сигнал();
		СпиПар.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЛюбаяСерияПослеВыбораПартии", ЭтотОбъект, Новый Структура("ШК,СтатьНаРучной,ЦенаУжеТут", ШК, СтатьНаРучной, ЦенаУжеТут)),
			НСтр("ru = 'Найдено несколько партий с такой серией, выберите:'; en = 'Several batches with this series have been found, please select:'"));
		Возврат;
	КонецЕсли; 
	
	ЛюбаяСерияПродолжение(СпиПар[0].Значение, ШК, СтатьНаРучной, ЦенаУжеТут);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияПослеВыбораПартии(Эле, Параметры) Экспорт
	Если Эле = Неопределено Тогда Возврат КонецЕсли;
	ЛюбаяСерияПродолжение(Эле.Значение, Параметры.ШК, Параметры.СтатьНаРучной, Параметры.ЦенаУжеТут);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияПродолжение(ТекПар, ШК, СтатьНаРучной, ЦенаУжеТут)
	Если ТекПар = 0 Тогда Возврат КонецЕсли; 
	
	НовКол = 1;
	//НовЦен = омСервер.ПересчетЗн(гоРеквизит(ТекПар, "ЦенаЗакупки"), гоРеквизит(ТекПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);	//вот вопрос!!!
	НовЦен = РаботаСВалютой.Пересчитать2025(гоРеквизит(ТекПар, "ЦенаЗакупки"), гоРеквизит(ТекПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата);
	НовНом = гоРеквизит(ТекПар, "Владелец");
	
	//2016.12.14
	Если гоРеквизит(НовНом, "ЗапретОтгрузки") Тогда клОшибка(НСтр("ru = 'Включен запрет отгрузки, выберите другую номенклатуру!'; en = 'Shipment prohibition is enabled, select another good!'")); Возврат; КонецЕсли;
	
	//2016.04.23
	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() > 0 Тогда
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Мас.Количество() > 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 

	//2016.04.23
	Если ЕстЦен <> 0 Тогда 
		НовЦен = ЕстЦен;
	Иначе 
		//2016.04.07
		Если НЕ (ЦенаУжеТут = -1) Тогда  
			Если НЕ (ЦенаУжеТут = 0) Тогда  
				НовЦен = ЦенаУжеТут;
			КонецЕсли; 
		Иначе
			ПоказатьВводЧисла(Новый ОписаниеОповещения("ЛюбаяСерияПослеВводаЦены", ЭтотОбъект, Новый Структура("ТекПар,ШК,НовНом,НовКол,СтатьНаРучной", ТекПар, ШК, НовНом, НовКол, СтатьНаРучной)),
				НовЦен, НСтр("ru = 'Цена (подставлена закупка по курсу)'; en = 'Price (purchase is set at the exchange rate)'"), 19, ЧислоЗнаковЦена);
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	ЛюбаяСерияЗавершить(ТекПар, ШК, НовНом, НовКол, НовЦен, СтатьНаРучной);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияПослеВводаЦены(НовЦен, Параметры) Экспорт
	Если НовЦен = Неопределено Тогда Возврат КонецЕсли;
	ЛюбаяСерияЗавершить(Параметры.ТекПар, Параметры.ШК, Параметры.НовНом, Параметры.НовКол, НовЦен, Параметры.СтатьНаРучной);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияЗавершить(ТекПар, ШК, НовНом, НовКол, НовЦен, СтатьНаРучной) 
	
	НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Серия", НовНом, ""));
	Если НайдСтроки.Количество() > 0 Тогда
		НовСтр = НайдСтроки[0];
		НовСтр.Серия = ШК;	
	Иначе
		НовСтр = Объект.Товары.Добавить();
		НовСтр.Номенклатура = НовНом;
	КонецЕсли;
	
	НовСтр.Партия 		= ТекПар;
	НовСтр.Количество 	= НовКол;
	НовСтр.ЦенаПродажи 	= НовЦен;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	//2016.03.25
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтрокиИзБуфера(БуфДок, БуфСтр) Экспорт
//2016.02.02

	//придется все продублировать
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	НовЦен = 0;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВставитьСтрокиИзБуфераПослеВводаЦены", ЭтотОбъект, Новый Структура("БуфДок,БуфСтр", БуфДок, БуфСтр)),
		НовЦен, НСтр("ru = 'Цена (0 - взять цены прихода)'; en = 'Price (0 - set incoming price)'"), 19, ЧислоЗнаковЦена);
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтрокиИзБуфераПослеВводаЦены(НовЦен, Параметры) Экспорт
	Если НовЦен = Неопределено Тогда Возврат КонецЕсли;
	
	БуфДок = Параметры.БуфДок;
	БуфСтр = Параметры.БуфСтр;
	БуфКол = БуфСтр.Количество();
	
	клНетДа(Новый ОписаниеОповещения("ВставитьСтрокиИзБуфераЗавершение", ЭтотОбъект, Новый Структура("БуфДок,БуфСтр,НовЦен", БуфДок, БуфСтр, НовЦен)),
		"Вставить из " + гоИмя(БуфДок) + " " + ?(БуфКол = 0, "все строки", " выделенные строки (" + БуфКол + ")") + "?");
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтрокиИзБуфераЗавершение(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	О = "";
	ИДИ = ВставитьСтрокиИзБуфераСервер(Параметры.БуфДок, Параметры.БуфСтр, Параметры.НовЦен, О);
	клЕстьОшибка(О);
	Если ИДИ = -1 Тогда Возврат КонецЕсли;
	
	МояЗаписать(Ложь);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
КонецПроцедуры

&НаСервере
Функция ВставитьСтрокиИзБуфераСервер(БуфДок, БуфСтр, ОбщЦен, О)
	Рез = -1;
	БуфКол = БуфСтр.Количество();
	
	Для Каждого Стр Из БуфДок.Товары Цикл
		Если БуфКол <> 0 Тогда
			Если БуфСтр.Найти(Стр.НомерСтроки) = Неопределено Тогда Продолжить КонецЕсли; КонецЕсли; 
			
		//в строке у нас партия и возможно, цена, если не задана одна общая
		НовКол = Стр.Количество;
		НовПар = Стр.Партия;
		НовНом = НовПар.Владелец;
		
		//2016.12.14
		Если гоРеквизит(НовНом, "ЗапретОтгрузки") Тогда Сообщить(гоИмя(НовПар) + " - включен запрет отгрузки, строка пропускается!"); Продолжить; КонецЕсли;
		
		НовСер = Стр.Серия;
		Если ОбщЦен = 0 Тогда 
			НовЦен = омСервер.ПересчетЗн(НовПар.ЦенаЗакупки, НовПар.Валюта, Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);
		Иначе 
			НовЦен = ОбщЦен;
		КонецЕсли; 
		
		ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
		Если ОстПар < НовКол Тогда Сообщить(гоИмя(НовПар) + " - остаток партии " + ОстПар + " меньше указанного количества " + НовКол + "!" + гоРС() +
											?(ОстПар = 0, "Строка пропускается", "Количество исправлено") + "!"); 
			Если ОстПар = 0 Тогда 
				Продолжить; 
			Иначе 
				НовКол = ОстПар;
			КонецЕсли; 
		КонецЕсли; 
			
		НовСтр = Объект.Товары.Добавить();
		
		НовСтр.Номенклатура = НовНом;
		НовСтр.Партия = НовПар;
		НовСтр.Количество = НовКол;
		НовСтр.ЦенаПродажи = НовЦен;
		
		Рез = НовСтр.ПолучитьИдентификатор();
		
		гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Вставка из буфера", Объект.Ссылка, 2);
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция ЕстьЕще(ТекИДИ, ТекНом)
	Рез = Новый Массив;
	
	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекНом));
	Если НЕ (Нашли.Количество() = 0) Тогда
		Для Каждого Стр Из Нашли Цикл
			Если Стр.ПолучитьИдентификатор() = ТекИДИ Тогда Продолжить КонецЕсли;
			Рез.Добавить(Стр);
		КонецЦикла; 
	КонецЕсли;

	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура МоеРедактирование(Кол)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	
	//2016.05.24
	//Усл = гоРеквизит(Стр.Номенклатура, "Услуги");
	Усл = гоРеквизит(Стр.Номенклатура, "ТипНоменклатуры") = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
	
	Если гоЭто("ЦенаПродажи", Кол) Тогда
		БылЦен = Стр.ЦенаПродажи;
		
		Если Кол = "ЦенаПродажи" Тогда
			НовЦен = БылЦен;
			ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаЦены", ЭтотОбъект, Новый Структура("ИДИ,БылЦен", ИДИ, БылЦен)), НовЦен, "Цена", 19, ЧислоЗнаковЦена);
			Возврат;
		КонецЕсли;
	ИначеЕсли Кол = "ДляПечати" Тогда
		БылСтр = СокрЛП(Стр.ДляПечати);
		НовСтр = БылСтр;
		
		ПоказатьВводСтроки(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаДляПечати", ЭтотОбъект, Новый Структура("ИДИ,БылСтр", ИДИ, БылСтр)), НовСтр, НСтр("ru = 'Для печати'; en = 'For print'"), 100, Ложь);
	//2017.01.17	
	ИначеЕсли Кол = "ДатаВозврата" Тогда
		//2017.01.18
		//услуги не трогаем
		Если Усл Тогда Возврат КонецЕсли;
		Зна = Стр[Кол];
		Был = Зна;
		Если НЕ ЗначениеЗаполнено(Зна) Тогда Зна = гоТекущаяДата() КонецЕсли;
		ПоказатьВводДаты(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаДатыВозврата", ЭтотОбъект, Новый Структура("ИДИ,Был,Кол", ИДИ, Был, Кол)), Зна, "Дата возврата:", ЧастиДаты.Дата);
	ИначеЕсли Кол = "Количество" Тогда
		//2017.01.17
		Если ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда клОшибка("Уже введена дата возврата!"); Возврат; КонецЕсли;
		
		БылКол = Стр.Количество;
		НовКол = БылКол;
		
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаКоличества", ЭтотОбъект, Новый Структура("ИДИ,БылКол,Усл", ИДИ, БылКол, Усл)), НовКол, НСтр("ru = 'Введите количество'; en = 'Input quantity'"), 14, ЧислоЗнаковКоличество);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаЦены(НовЦен, Параметры) Экспорт
	Если НовЦен = Неопределено Тогда Возврат КонецЕсли;
	Если НовЦен = Параметры.БылЦен Тогда Возврат КонецЕсли; 
	
	ИДИ = Параметры.ИДИ;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	БылЦен = Параметры.БылЦен;
	Доба = "";
	
	Стр.ЦенаПродажи = НовЦен;
	
	Колич =	Стр.Количество;
	Номен =	Стр.Номенклатура;
	
	МояЗаписать(Ложь);
	гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(БылЦен, ЧислоЗнаковЦена) + "->" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование цены" + Доба, Объект.Ссылка, 2);
	
	Нашли = ЕстьЕще(ИДИ, Номен);
	Если НЕ (Нашли.Количество() = 0) Тогда
		клДаНет(Новый ОписаниеОповещения("МоеРедактированиеПослеПодтвержденияОстальных", ЭтотОбъект, Новый Структура("Нашли,НовЦен,Доба", Нашли, НовЦен, Доба)),
			НСтр("ru = 'В документе есть еще такая же номенклатура! Проставить новую цену и на нее тоже?'; en = 'The document also contains the same nomenclature! Set a new price on it too?'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеПодтвержденияОстальных(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	НовЦен = Параметры.НовЦен;
	Доба = Параметры.Доба;
	
	Для Каждого Стр Из Параметры.Нашли Цикл
		БылЦен = Стр.ЦенаПродажи;
		Если БылЦен = НовЦен Тогда Продолжить КонецЕсли; 
		
		Стр.ЦенаПродажи = НовЦен;
		
		Колич =	Стр.Количество;
		Номен =	Стр.Номенклатура;
		гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(БылЦен, ЧислоЗнаковЦена) + "->" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование цены" + Доба, Объект.Ссылка, 2);
	КонецЦикла;
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаДляПечати(НовСтр, Параметры) Экспорт
	Если НовСтр = Неопределено Тогда Возврат КонецЕсли;
	Если СокрЛП(НовСтр) = Параметры.БылСтр Тогда Возврат КонецЕсли; 
	
	Стр = Объект.Товары.НайтиПоИдентификатору(Параметры.ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	Стр.ДляПечати = НовСтр;
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаДатыВозврата(Зна, Параметры) Экспорт
	Если Зна = Неопределено Тогда Возврат КонецЕсли;
	Был = Параметры.Был;
	Если Был = Зна Тогда Возврат КонецЕсли;
	
	ИДИ = Параметры.ИДИ;
	Кол = Параметры.Кол;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	//2017.01.18
	//если снимаем дату возврата, то нужно убедиться, что есть остаток, может, его переместили
	Если НЕ ЗначениеЗаполнено(Зна) Тогда
		ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия);
		Если Стр.Количество > ОстПар Тогда клОшибка("Не хватит остатка " + Строка(Стр.Количество - ОстПар) + " для " + гоИмя(Стр.Партия) + "!"); Возврат; КонецЕсли;
	КонецЕсли;
	Стр[Кол] = Зна;
	МояЗаписать(Ложь);
	Номен = Стр.Номенклатура;
	СЦена = Стр.ЦенаПродажи;
	гоЗаписьЖурналаРегистрации(гоДата2(Был) + "->" + гоДата2(Зна) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦена) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Редактирование даты возврата", Номен, 2);
	гоЗаписьЖурналаРегистрации(гоДата2(Был) + "->" + гоДата2(Зна) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦена) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование даты возврата", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаКоличества(НовКол, Параметры) Экспорт
	Если НовКол = Неопределено Тогда Возврат КонецЕсли;
	
	ИДИ = Параметры.ИДИ;
	БылКол = Параметры.БылКол;
	Усл = Параметры.Усл;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	//2016.05.24
	//не нужно проверять услуги на остаток
	Если НЕ Усл Тогда  
		ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия);
		Если Объект.Проведен Тогда ОстПар = ОстПар + БылКол КонецЕсли;
		
		Если НовКол > ОстПар Тогда 
			клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(Стр.Партия) + ", исправлено на " + ОстПар + "!");
			НовКол = ОстПар;
		КонецЕсли;
	КонецЕсли; 
	Если НовКол = Стр.Количество Тогда Возврат КонецЕсли;
	
	Стр.Количество = НовКол;
	
	МояЗаписать(Ложь);
	
	Колич = НовКол;
	Номен = Стр.Номенклатура;
	СЦена = Стр.ЦенаПродажи;
	
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦена) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Редактирование количества", Номен, 2);
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦена) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование количества", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура МоеУдаление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда 
		Если гоАдминистратор() Тогда 
			Сообщить("Под ответственность Администратора!");
		Иначе 
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("МоеУдалениеЗавершение", ЭтотОбъект, ИДИ),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеУдалениеЗавершение(Результат, ИДИ) Экспорт 
	
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	
	Объект.Товары.Удалить(Удаляем);
	
	гоЗаписьЖурналаРегистрации(СтрШаблон("%1|%2|%3",
	                           		Строка(Удаляем.Количество),
							   		гоСуммаЗн(Удаляем.ЦенаПродажи, ЧислоЗнаковЦена),
							   		гоИмя(Удаляем.Номенклатура, Ложь)),
							   ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);

	//партия сама пометится на удаление при записи
	МояЗаписать(Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли;
	Если омСервер.ЕстьНезакрытыеДокументы(Объект.Контрагент, Объект.Ссылка) Тогда 
		клВнимание(НСтр("ru = 'ВНИМАНИЕ! Есть незакрытые документы!!!'; en = 'ATTENTION! There are unclosed documents!!!'")) 
	КонецЕсли; 
	// © Primus1C  13.11.2024  НАЧАЛО ►
	ОтобразитьДолгИРазрешения();
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	//2016.01.31
	Если Объект.счеКонсигнация = 0 Тогда 
		//тут все обыденно
		Объект.Окончательно = Истина;
		МояЗаписать(Ложь);
		УстановитьЗавершение();
	Иначе 
		//2016.02.02
		//проверяем валюты на совпадение временно, ставим запрет, если не та валюта
		//Сч = 0;  
		Сч = Новый СписокЗначений;
		Для Каждого Стр Из Объект.Товары Цикл
			ПарВал = гоРеквизит(Стр.Партия, "Валюта");
			Если ПарВал = Объект.Валюта Тогда Продолжить КонецЕсли;
			//гоПлюс(Сч);  
			Сч.Добавить(Стр.номерСтроки);
		КонецЦикла; 
		//Если Сч <> 0 Тогда клОшибка("В документе есть К-партии: " + Сч + ", оприходованные в другой валюте!" + гоРС() + 
		//							"Установка {Окончательно} запрещена!"); Возврат; КонецЕсли;
		Если Сч.Количество()> 0 Тогда клОшибка("В документе есть К-партии: строка (строки) " + Сч + ", оприходованные в другой валюте! 
												|Установка {Окончательно} запрещена!"); Возврат; КонецЕсли;
		
		клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтвержденияКонсигнации", ЭтотОбъект), СтрШаблон(
				НСтр("ru = 'Есть строки с К-партиями: %1!%2В их приходах будут установлены ТЕКУЩИЕ цены продажи по текущему курсу, долг поставщику УВЕЛИЧИТСЯ!!!%2 Все равно продолжать?'; 
				|en = 'There are lines with K-parties: %1!%2In their parishes, CURRENT selling prices will be set at the current rate, the debt to the supplier will INCREASE!!!%2 Should we continue anyway?'"), 
				Объект.счеКонсигнация, гоРС()));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтвержденияКонсигнации(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	//ставим все в транзакции на сервере, чтобы иметь возможность все отменить
	О = "";
	М = Новый Массив;
	УстановитьСервер(О, Ложь, М);
	Если клЕстьОшибка(О) Тогда Возврат КонецЕсли;
	
	//тут вручную обновим все
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги();
	
	клОповеститьОбИзмененииМассив(М);
	
	УстановитьЗавершение();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗавершение()
	гоЗаписьЖурналаРегистрации(СтрШаблон("Установили. Строк %1, сумма %2",Объект.Товары.Количество(),Формат(Объект.Сумма,"ЧДЦ=2")), ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаСервере
Процедура УстановитьСервер(О, Снятие = Ложь, М)
	
	НачатьТранзакцию();
	
	Попытка
	
		// © Primus1C  26.04.2026  НАЧАЛО ►
		// (рефакторинг оригинального кода)
		
		// установка в справочнике Партии цен закупки товаров консигнации 
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		             |	ТЧТовары.Партия КАК Партия,
		             |	ТЧТовары.Партия.Док КАК ДокументПартии,
		             |	ТЧТовары.Партия.Валюта КАК Валюта,
		             |	ТЧТовары.ЦенаПродажи КАК ЦенаПродажи,
		             |	ТЧТовары.Партия.Док.Проведен КАК ДокументПартииПроведен
		             |ИЗ
		             |	Документ.РасходнаяНакладная.Товары КАК ТЧТовары
		             |ГДЕ
		             |	ТЧТовары.Ссылка = &Ссылка
		             |	И ТЧТовары.Партия.Консигнация";
		Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
		РезультатЗапроса = Запр.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка Цикл
				ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
				Если Снятие Тогда 
					ПартияОбъект.ЦенаЗакупки = 0;
				Иначе 
					ПартияОбъект.ЦенаЗакупки = омСервер.ПересчетЗн(Выборка.ЦенаПродажи, Объект.Валюта, Выборка.Валюта, Объект.Фирма, Объект.Дата, Объект.Фирма.ЧислоЗнаковЦенаЗакупки);
				КонецЕсли; 
				ПартияОбъект.Записать();
				М.Добавить(Выборка.Партия);
			КонецЦикла;
		КонецЕсли;
		тзПерепроведения = РезультатЗапроса.Выгрузить().Свернуть("ДокуметПартии,ДокументПартииПроведен",);
		Для каждого стр Из тзПерепроведения Цикл
			Если стр.ДокументПартииПроведен Тогда
				ДокОбъект = стр.ДокументПартии.ПолучитьОбъект();	
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				М.Добавить(стр.ДокументПартии);
			КонецЕсли;
		КонецЦикла;
		
		// © Primus1C  ОКОНЧАНИЕ ◄
		// далее закомменирован	оригинальный код
	
		////выгрузим в таблицу, заполним документ, чтобы по нему сгруппировать и обрабатывать последовательно все документы прихода
		//Табл = Объект.Товары.Выгрузить();
		//
		//глНоваяКолонка(Табл, "Док");
		//
		//Удалить = Новый Массив;
		//
		//Для Каждого _Табл Из Табл Цикл 
		//	//все нам не нужны
		//	Если НЕ _Табл.Партия.Консигнация Тогда Удалить.Добавить(_Табл); Продолжить; КонецЕсли; 
		//	
		//	_Табл.Док = _Табл.Партия.Док; 
		//КонецЦикла; 
		//
		//глУдалитьСтроки(Табл, Удалить);
		//
		//Дабл = Табл.Скопировать();
		//Дабл.Свернуть("Док", "Количество");
		//
		////есть таблица документов
		//Для Каждого _Дабл Из Дабл Цикл
		//	Док = _Дабл.Док.ПолучитьОбъект();
		//	
		//	Сч = 0;
		//	Мас = Табл.НайтиСтроки(Новый Структура("Док", _Дабл.Док));
		//	Для Каждого _Табл Из Мас Цикл
		//		Пар = _Табл.Партия.ПолучитьОбъект();
		//		Если Снятие Тогда 
		//			Пар.ЦенаЗакупки = 0;
		//		Иначе 
		//			Пар.ЦенаЗакупки = омСервер.ПересчетЗн(_Табл.ЦенаПродажи, Объект.Валюта, Пар.Валюта, Объект.Фирма, Объект.Дата, Объект.Фирма.ЧислоЗнаковЦенаЗакупки);
		//		КонецЕсли; 
		//		Пар.Записать();
		//		
		//		М.Добавить(Пар.Ссылка);
		//		
		//		гоПлюс(Сч);
		//	КонецЦикла; 
		//	
		//	//по идее, ПН сам все цены обновит из партий
		//	//вот только смущает, что цена не проверяется на ноль, если эту партию вернут и продадут заново по другой цене, то получится ерунда - цена снова обновится
		//	//пока возвратов нет, но потом могут быть.
		//	//что делать при возврате будут? решим потом!!!
		//	Если Сч = 0 Тогда Продолжить КонецЕсли;
		//	
		//	Док.Записать(РежимЗаписиДокумента.Проведение);
		//	
		//	М.Добавить(Док.Ссылка);
		//КонецЦикла;
		
		//ничего придумывать особо не будем
		Объект.Окончательно = НЕ Снятие;
		Записать(РежимЗаписиПроведение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение 
		
	    гоРезСоо(О, ОписаниеОшибки());
		
		ОтменитьТранзакцию();
		
		//вдруг уже записалось, хотя вряд ли
		Если Объект.Окончательно Тогда  
			Объект.Окончательно = Снятие;
			Записать(РежимЗаписиПроведение);
		КонецЕсли; 
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг <Окончательно>?'; en = 'Unset flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	//2016.01.31
	Если Объект.счеКонсигнация = 0 Тогда 
		//тут все обыденно
		Объект.Окончательно = Ложь;
		МояЗаписать(Ложь);
		СнятьЗавершение();
	Иначе 
		клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтвержденияКонсигнации", ЭтотОбъект), СтрШаблон(
				НСтр("ru = 'Есть строки с К-партиями: %1!%2В их приходах будут возвращены НУЛЕВЫЕ цены, долг поставщику уменьшится и может стать ОТРИЦАТЕЛЬНЫМ!!!%2 Все равно продолжать?'; 
				|en = 'There are lines with K-parties: %1!%2ZERO prices will be returned to their receipts, the debt to the supplier will decrease and may become NEGATIVE!!!%2 Should we continue anyway?'"), 
				Объект.счеКонсигнация, гоРС()));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтвержденияКонсигнации(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	//ставим все в транзакции на сервере, чтобы иметь возможность все отменить
	О = "";
	М = Новый Массив;
	УстановитьСервер(О, Истина, М);
	Если клЕстьОшибка(О) Тогда Возврат КонецЕсли;
	
	//тут вручную обновим все
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги();
	
	клОповеститьОбИзмененииМассив(М);
	
	СнятьЗавершение();
КонецПроцедуры

&НаКлиенте
Процедура СнятьЗавершение()
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), НСтр("ru = 'Удалить все строки?'; en = 'Delete all lines?'"));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Товары.Очистить();
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//2016.02.08
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ЛюбаяСерия(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПривязки(Откуда)
	локПривязки = ЗначениеИзСтрокиВнутр(Откуда);
	
	Если Объект.Привязки.Количество() <> 0 Тогда Объект.Привязки.Очистить() КонецЕсли; 
	
	Для Каждого Стр Из локПривязки Цикл
		Если Стр.СуммаДокумента = 0 Тогда Продолжить КонецЕсли;
		
		Нов = Объект.Привязки.Добавить();
		
		Нов.Сумма1 = Стр.СуммаДокумента;
		Нов.Валюта1 = Стр.ВалютаДокумента;
		Нов.Сумма2 = Стр.СуммаДолга;
		Нов.Валюта2 = Стр.ВалютаДолга;
		Нов.КроссКурс = Стр.КроссКурс;
		Нов.ОбратныйКурс = Стр.ОбратныйКурс;
		Нов.Док2 = Стр.Док;
		Нов.Примечание = Стр.Примечание;
		Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязки()
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	//2016.08.26
	//Если гоЧужойДокумент(Объект.КемСоздан) Тогда Возврат КонецЕсли; 
	
	лПривязать = Объект.Сумма;
	Если лПривязать = 0 Тогда Возврат КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	Если НЕ Объект.Проведен Тогда клОшибка(НСтр("ru = 'Документ не проведен!'; en = 'The document is not posted!'")); Возврат; КонецЕсли;
	
	Пар = Новый Структура("Док, Привязки, ТолькоПривязки", Объект.Ссылка, Объект.Привязки, 0);
	
	ОткрытьФорму("Обработка.ПривязкаДолгов.Форма.Форма", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоиПривязкиЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязкиЗавершение(Рез, ДопПараметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли; 
	
	//2015.11.27
	СохМасПривязки = клПривязкиВМассив(Объект);
	
	ЗаполнитьПривязки(Рез.ПривязкиСтрока);
	
	МояЗаписать(Ложь);
	
	//2015.11.27
	клОповеститьПривязки(Объект, СохМасПривязки);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыЗачет(Команда)
	МоиПривязки();
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	// © Primus1C  19.01.2025  НАЧАЛО ►
	Если Объект.ПометкаУдаления Тогда
		клОшибка(НСтр("ru = 'Документ помечен на удаление!'; en = 'The document is marked as deleted!'"));
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄	
	ЛюбаяСерия(РучнойШК, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
//2016.03.25
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера(Новый ОписаниеОповещения("ИзБуфераОбменаПослеПолученияБуфера", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбменаПослеПолученияБуфера(Буф, ДопПараметры) Экспорт
	//2016.04.23
	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() <> 0 Тогда
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	//2016.04.23
	Если ЕстЦен <> 0 Тогда 
		ИзБуфераОбменаПродолжить(Буф, ЕстЦен);
	Иначе 
		ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзБуфераОбменаПослеВводаЦены", ЭтотОбъект, Буф), 0, НСтр("ru = 'Цена (0 - взять цены прихода)'; en = 'Price (0 - use arrival prices)'"), 19, ЧислоЗнаковЦена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбменаПослеВводаЦены(НовЦен, Буф) Экспорт
	Если НовЦен = Неопределено Тогда Возврат КонецЕсли;
	ИзБуфераОбменаПродолжить(Буф, НовЦен);
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбменаПродолжить(Буф, НовЦен)
	КвоСтрок = СтрЧислоСтрок(Буф);
	
	// © Primus1C  13.11.2025  НАЧАЛО ►  
	
	// массив нужен чтобы сохранить порядок серий
	мас = Новый Массив;
	Для Н = 1 По КвоСтрок Цикл
		НовСер = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (НовСер = "") И (С <> "") Цикл
			НовСер = гоСледПолеТаб(С);
		КонецЦикла;	
		серия = СокрЛП(НовСер);
		Если серия = "" Тогда
			Продолжить;		
		Иначе
			мас.Добавить(серия);
		КонецЕсли;
	КонецЦикла;

	СоотвПартий = СведенияПартий(мас);
	
	Ошибки = Новый СписокЗначений;
	НовыхСтрок = 0;
	Для каждого Эл Из мас Цикл
		СведенияПартии = СоотвПартий.Получить(Эл);
		Если СведенияПартии = Неопределено Тогда
			Ошибки.Добавить(СтрШаблон("%1: %2", НСтр("ru = 'Нет остатков серии'; en = 'There are no remaining goods for the series'"), Эл));   
		Иначе           
			НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Партия", СведенияПартии.Партия));
			Если НайдСтроки.Количество() > 0 Тогда
				Ошибки.Добавить(СтрШаблон("%1 %2 %3 !", НСтр("ru = 'Cерия'; en = 'Series'"), Эл, НСтр("ru = 'уже есть в накладной'; en = 'is already in the document'")));   
			    Продолжить;
			КонецЕсли;
			НовСтр = Объект.Товары.Добавить();
			НовСтр.Номенклатура = СведенияПартии.Номенклатура;
			НовСтр.Партия 		= СведенияПартии.Партия; 
			НовСтр.ЦенаЗакупки 	= СведенияПартии.ЦенаЗакупки; 
			НовСтр.Серия 		= Эл;
			НовСтр.Количество 	= 1; 
			Если НовЦен = 0 Тогда 
				// 10.5.2026
				//НовЦен = омСервер.ПересчетЗн(СведенияПартии.ЦенаЗакупки, СведенияПартии.Валюта, Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);	 
				НовЦен = РаботаСВалютой.Пересчитать2025(СведенияПартии.ЦенаЗакупки, СведенияПартии.Валюта, Объект.Валюта, Объект.Фирма, Объект.Дата);
			КонецЕсли;
			НовСтр.ЦенаПродажи 	= НовЦен; 
			НовСтр.СуммаПродажи = НовЦен;  
			//СтрокаТЧ.стрПроцент 	= ПредставлениеНаценки(СтрокаТЧ.стрПроцент);
			НовыхСтрок = НовыхСтрок + 1;
		КонецЕсли;
	КонецЦикла;	
	
	МояЗаписать(Ложь);
	гоЗаписьЖурналаРегистрации("Добавлено из буфера обмена строк: " + НовыхСтрок, ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строк", Объект.Ссылка, 2);
	
	Если Объект.Товары.Количество() > 0  Тогда
		ИДИ = Объект.Товары[Объект.Товары.Количество()-1].ПолучитьИдентификатор();
	    Элементы.Товары.ТекущаяСтрока = ИДИ;
	КонецЕсли;

	МоиИтоги();

	Если Ошибки.Количество() > 0 Тогда   
		ТекстОшибок = "";
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибок = ТекстОшибок + Ош.Значение + Символы.ПС;
		КонецЦикла;
		клОшибка(ТекстОшибок, , НСтр("ru = 'Ошибки заполнения'; en = 'Filling Errors'"));
	КонецЕсли;
	
	Возврат ;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//////////тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	////////Для Н = 1 По КвоСтрок Цикл
	////////	НовСер = "";
	////////	С = СтрПолучитьСтроку(Буф, Н);
	////////	Пока (НовСер = "") И (С <> "") Цикл
	////////		НовСер = гоСледПолеТаб(С);
	////////	КонецЦикла; 

	////////	// © Primus1C  13.11.2025  НАЧАЛО ►
	////////	//ЛюбаяСерия(СС, , НовЦен); 
	////////	////ЛюбаяСерия(НовСер, СтатьНаРучной = Ложь, ЦенаУжеТут = -1)
	////////	
	////////	ШК = СокрЛП(НовСер);
	////////	Если ШК = "" Тогда Продолжить КонецЕсли; 
	////////	
	////////	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	////////	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	////////	
	////////	Ско = СпиПар.Количество();
	////////	ТекПар = 0;
	////////	Если Ско  = 0 Тогда
	////////		Сигнал();
	////////		клОшибка(СтрШаблон("%1: %2 %3", 
	////////		омСервер.Фрмт(НСтр("ru = 'Нет остатков по серии'; en = 'There are no remaining goods for the series!'"), "НАДПИСЬ_ЦВ1"), 
	////////		омСервер.Фрмт(ШК, "НАДПИСЬ_ЦВ2"),
	////////		омСервер.Фрмт("!", "НАДПИСЬ_ЦВ1")));
	////////		Продолжить;
	////////	ИначеЕсли Ско > 1 Тогда
	////////		Сигнал();
	////////		Эле = СпиПар.ВыбратьЭлемент(НСтр("ru = 'Найдено несколько партий с такой серией, выберите:'; en = 'Several batches with this series have been found, please select:'"));
	////////		Если Эле = Неопределено Тогда Продолжить КонецЕсли;
	////////		ТекПар = Эле.Значение;
	////////	Иначе
	////////		ТекПар = СпиПар[0].Значение;
	////////	КонецЕсли; 
	////////	Если ТекПар = 0 Тогда Продолжить КонецЕсли; 
	////////	
	////////	НовКол = 1;
	////////	НовЦен = омСервер.ПересчетЗн(гоРеквизит(ТекПар, "ЦенаЗакупки"), гоРеквизит(ТекПар, "Валюта"), Объект.Валюта, Объект.Фирма, Объект.Дата, ЧислоЗнаковЦена);	//вот вопрос!!!
	////////	НовНом = гоРеквизит(ТекПар, "Владелец");
	////////	
	////////	//2016.12.14
	////////	Если гоРеквизит(НовНом, "ЗапретОтгрузки") Тогда клОшибка(НСтр("ru = 'Включен запрет отгрузки, выберите другую номенклатуру!'; en = 'Shipment prohibition is enabled, select another good!'")); Возврат; КонецЕсли;
	////////	
	////////	//2016.04.23
	////////	//если уже есть такой товар, зачем искать цену
	////////	ЕстЦен = 0;
	////////	Если Объект.Товары.Количество() <> 0 Тогда
	////////		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
	////////		Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	////////	КонецЕсли; 
	////////	
	////////	//2016.04.23
	////////	Если ЕстЦен <> 0 Тогда 
	////////		НовЦен = ЕстЦен;
	////////	Иначе 
	////////		//2016.04.07
	////////		Если НЕ (ЦенаУжеТут = -1) Тогда  
	////////			Если НЕ (ЦенаУжеТут = 0) Тогда  
	////////				НовЦен = ЦенаУжеТут;
	////////			КонецЕсли; 
	////////		Иначе
	////////			Если НЕ ВвестиЧисло(НовЦен, НСтр("ru = 'Цена (подставлена закупка по курсу)'; en = 'Price (purchase is set at the exchange rate)'"), 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	////////		КонецЕсли; 
	////////	КонецЕсли;
	////////	
	////////	НовСтр = Объект.Товары.Добавить();
	////////	
	////////	НовСтр.Номенклатура = НовНом;
	////////	НовСтр.Партия = ТекПар;
	////////	НовСтр.Количество = НовКол;
	////////	НовСтр.ЦенаПродажи = НовЦен;
	////////	
	////////	ИДИ = НовСтр.ПолучитьИдентификатор();
	////////	
	////////	МояЗаписать(Ложь);
	////////	
	////////	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦена) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	////////	
	////////	Элементы.Товары.ТекущаяСтрока = ИДИ;
	////////	
	////////	////2016.03.25
	////////	//Если СтатьНаРучной Тогда 
	////////	//	РучнойШК = "";
	////////	//	ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	////////	//КонецЕсли; 
	////////	
	////////	
	////////	
	////////	// © Primus1C  ОКОНЧАНИЕ ◄

	////////КонецЦикла;  

КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагента(Команда)
//2016.06.09

	клИскатьКонтрагента(Новый ОписаниеОповещения("ИскатьКонтрагентаЗавершение", ЭтотОбъект), Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагентаЗавершение(НовКон, ДопПараметры) Экспорт
	Если НовКон = Неопределено Тогда Возврат КонецЕсли; 
	Объект.Контрагент = НовКон;
КонецПроцедуры

// © Primus1C  27.12.2023  НАЧАЛО ►

&НаСервере  
// Возвращает соответствие Серия -> Значения реквизитов партий, имеющихся на остатке
//
Функция СведенияПартий(МассивСерий)
	
	МассивВРег = Новый Массив;
	МассивНРег = Новый Массив;
	Для каждого Эл Из МассивСерий Цикл
		МассивВРег.Добавить(Врег(Эл));
		МассивНРег.Добавить(Нрег(Эл));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Партия КАК Партия,
	               |	Рег.ОстатокОстаток КАК Остаток,
	               |	Рег.Партия.Серия КАК Серия,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	Рег.Партия.ЦенаЗакупки КАК ЦенаЗакупки,
	               |	Рег.Партия.Валюта КАК Валюта
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Остатки КАК Рег
	               |ГДЕ
	               |	Рег.Фирма = &Фирма
	               |	И Рег.Склад = &Склад
	               |	И Рег.ОстатокОстаток >= 1
	               |	И (Рег.Партия.Серия В (&Серии)
	               |			ИЛИ Рег.Партия.Серия В (&СерииНРег)
	               |			ИЛИ Рег.Партия.Серия В (&СерииВРег))";
	Запрос.УстановитьПараметр("Серии",  	МассивСерий);
	Запрос.УстановитьПараметр("СерииНРег",  МассивВРег);
	Запрос.УстановитьПараметр("СерииВРег",  МассивНРег);
	Запрос.УстановитьПараметр("Склад",  	Объект.Склад);
	Запрос.УстановитьПараметр("Фирма",  	Объект.Фирма);
	Выборка = Запрос.Выполнить().Выбрать(); 
	СоотвПартий = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СведенияПартии = Новый Структура("Партия,Номенклатура,Остаток,ЦенаЗакупки,Валюта", 
										Выборка.Партия, Выборка.Номенклатура, Выборка.Остаток, Выборка.ЦенаЗакупки, Выборка.Валюта);
		Серия = СокрЛП(Выборка.Серия);								
		СоотвПартий.Вставить(Серия, СведенияПартии);
		СоотвПартий.Вставить(ВРег(Серия), СведенияПартии);
		СоотвПартий.Вставить(НРег(Серия), СведенияПартии);
	КонецЦикла;
	Возврат СоотвПартий;

КонецФункции 

&НаСервереБезКонтекста
Функция ПредставлениеНаценки(стрПроцент)
	
	Если ЗначениеЗаполнено(стрПроцент) Тогда
		Если стрПроцент = "У" Тогда
			Возврат "У";	
		ИначеЕсли Лев(стрПроцент,1) = "-" Тогда
			Возврат стрПроцент;  
		Иначе
			Возврат "%";
		КонецЕсли;
	Иначе
		Возврат "";	
	КонецЕсли;      
	
КонецФункции	
	
&НаКлиенте
Процедура ОтобразитьДолгИРазрешения()
	
	ДолгиПокупателя = ОбщегоНазначенияСервер.ДолгиПокупателя(Объект.Контрагент, Объект.Дата);
	Если ЗначениеЗаполнено(ДолгиПокупателя) Тогда
		Элементы.ГруппаРазрешения.Видимость = Истина;
	   	Элементы.ДекорацияДолг.Заголовок = СтрШаблон(НСтр("ru = 'Оплата просрочена: %1 дней'; en = 'Оплата просрочена: %1 дней'"), ДолгиПокупателя.Срок);  
		//ОтгрузкаРазрешена = СтатусРазрешения = ПредопределенноеЗначение("Перечисление.СтатусыРазрешений.Разрешено");
	Иначе
		Элементы.ГруппаРазрешения.Видимость = Ложь;
		//ОтгрузкаРазрешена = Истина;
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры  

&НаКлиенте
 Процедура ВалютаПриИзменении(Элемент)

	 ОтобразитьЦветВалюты();
	 
 КонецПроцедуры
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
		Элементы.Валюта1.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенные(Команда)
//2017.05.30
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если стрОплата <> "" Тогда Возврат КонецЕсли; 
	
	ВыдСтр = Элементы.Товары.ВыделенныеСтроки;
	ВыдКол = ВыдСтр.Количество();
	Если ВыдКол <= 1 Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВыделенныеЗавершение", ЭтотОбъект, ВыдСтр),
		стрШаблон(НСтр("ru = 'Удалить выделенные (%1) строки?'; en = 'Delete selected (%1) lines?'"), ВыдКол));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныеЗавершение(Результат, ВыдСтр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удалить = Новый Массив;
	
	Для Каждого ИДИ Из ВыдСтр Цикл
		Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
		Если Стр = Неопределено Тогда клОшибка("Странно, не нашли текущую строку по ИДИ=" + ИДИ + "!"); Продолжить; КонецЕсли;
		Удалить.Добавить(Стр);
	КонецЦикла;
	
	Для Каждого Стр Из Удалить Цикл
		Номен = Стр.Номенклатура;
		//СЦена = Стр.ЦенаЗакупки;
		Колич = Стр.Количество;
		//гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦена) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удалить выделенные", Объект.Ссылка, 2);
		гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удалить выделенные", Объект.Ссылка, 2);
		
		Объект.Товары.Удалить(Стр);
	КонецЦикла;
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦену(Команда)
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	//ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	//Если ВыделенныеСтроки.Количество() < 2 Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Если Кол = "ЦенаПродажи" Тогда     
		БылЦен = Элементы.Товары.ТекущиеДанные.Ценапродажи;
		НовЦен = БылЦен;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("УстановитьЦенуЗавершение", ЭтотОбъект, БылЦен), НовЦен, "Цена", 19, ЧислоЗнаковЦена);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦенуЗавершение(НовЦен, БылЦен) Экспорт
	Если НовЦен = Неопределено Тогда Возврат КонецЕсли;
	Если НовЦен = БылЦен Тогда Возврат КонецЕсли;  
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	//Для каждого ВыдСтрока Из ВыделенныеСтроки Цикл
	//	Объект.Товары[ВыдСтрока].ЦенаПродажи = НовЦен;
	//КонецЦикла;                                     
	Элементы.Товары.ТекущиеДанные.ЦенаПродажи = НовЦен;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДолгНажатие(Элемент)
	клВнимание(ПредставлениеДолга(Ложь),,"Долги покупателя " + Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеДолга(СКонтрагентом = Истина)
	
	Рез = "";
	Если СКонтрагентом Тогда
		Рез = Рез + "Покупатель: " + Объект.Контрагент + Символы.ПС;	
	КонецЕсли;
	Рез = Рез + СтрШаблон("Оплата просрочена: %1 дней.", ДолгиПокупателя.Срок) + Символы.ПС; 	
	Для каждого эл Из ДолгиПокупателя.Долги Цикл
		Рез = Рез + СтрШаблон("%1 %2 просрочено дней %3", Формат(эл.Сумма, "ЧДЦ=2"), эл.Валюта, эл.Срок) + Символы.ПС; 	
	КонецЦикла;
	Возврат Рез;
	
КонецФункции 

&НаСервере
Процедура ОбновитьЦенуЗакупкиНаСервере()
	
	Если Не РольДоступна("Разработка") Тогда
		Возврат;	
	КонецЕсли;    
	
	//Для каждого строкаТЧ Из Объект.Товары Цикл        
	//	НовЦен = омСервер.ПересчетЗн(СтрокаТЧ.Партия.ЦенаЗакупки, СтрокаТЧ.Партия.Валюта, Объект.Валюта, Объект.Фирма, Объект.Дата, 4);			

	//	Если СтрокаТЧ.ЦенаЗакупки <> НовЦен Тогда
	//	 	Сообщить(СтрШаблон("строка %1: %2", СтрокаТЧ.НомерСтроки, НовЦен));

	//	КонецЕсли;
	//КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦенуЗакупки(Команда)
	
	//ОбновитьЦенуЗакупкиНаСервере();   
	
	номСтр = 0;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ОбновитьЦенуЗакупкиПослеВводаНомераСтроки", ЭтотОбъект), НомСтр, "Номер строки", 3, 0);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦенуЗакупкиПослеВводаНомераСтроки(НомСтр, ДопПараметры) Экспорт
	Если НомСтр = Неопределено Тогда Возврат КонецЕсли;
	
	СтрокаТЧ = Объект.Товары[НомСтр-1]; 
    Партии = ПартииСерии(СтрокаТЧ.Серия);
	Спис = Новый СписокЗначений;     
	Цены = Новый Соответствие;
	Для каждого Партия Из Партии Цикл
		П = Партия.Значение;
		Спис.Добавить(П.Партия, СтрШаблон("%1: %2 %3%4", П.Партия, Формат(П.ЦенаЗакупки, "ЧДЦ=4"), П.Валюта, ?(П.Удален, " (удал.)", ""))); 
		Цены.Вставить(П.Партия, П.ЦенаЗакупки);
	КонецЦикла;
	Спис.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОбновитьЦенуЗакупкиПослеВыбораПартии", ЭтотОбъект, Новый Структура("СтрокаТЧ,Цены", СтрокаТЧ, Цены)), НСтр("ru = 'Выберите партию'; en = 'Select batch'"));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦенуЗакупкиПослеВыбораПартии(Выб, Параметры) Экспорт
	СтрокаТЧ = Параметры.СтрокаТЧ;
	Цены = Параметры.Цены;
	Если Выб <> Неопределено И Выб.Значение <> СтрокаТЧ.Партия Тогда
		СтрокаТЧ.Партия = Выб.Значение;	
		СтрокаТЧ.ЦенаЗакупки = Цены.Получить(СтрокаТЧ.Партия);
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПартииСерии(Серия)
	
	спис = Новый СписокЗначений;
	запр = Новый Запрос;  
	запр.УстановитьПараметр("Серия", Серия);
	запр.Текст = "ВЫБРАТЬ
	             |	Партии.Ссылка КАК Партия,
	             |	Партии.ПометкаУдаления КАК ПометкаУдаления,
	             |	Партии.ЦенаЗакупки КАК ЦенаЗакупки,
	             |	Партии.Валюта КАК Валюта
	             |ИЗ
	             |	Справочник.Партии КАК Партии
	             |ГДЕ
	             |	Партии.Серия = &Серия";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		спис.Добавить(Новый Структура("Партия,Удален,ЦенаЗакупки,Валюта", 
										Выборка.Партия, 
										Выборка.ПометкаУдаления,  
										омСервер.ПересчетЗн(Выборка.ЦенаЗакупки, Выборка.Валюта, Объект.Валюта, Объект.Фирма, Объект.Дата, 4),
										Выборка.Валюта
										));
	КонецЦикла;
	Возврат Спис;
	
КонецФункции // ПартииСерии()

&НаКлиенте
Процедура ОбновитьЦенуСЗатратами(Команда)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Цены = ОбщегоНазначенияСервер.СоставЗатрат(Элементы.Товары.ТекущиеДанные.Партия, ЭтаФорма.Объект.Ссылка, Истина); 
	НоваяЦена = Цены.СуммаВал + Элементы.Товары.ТекущиеДанные.ЦенаЗакупки;
	Если ТекДанные.ВКД_ЦенаСЗатратами = Окр(НоваяЦена, 4) Тогда
		клВнимание(СтрШаблон("Цена с затратами составляет %1
							|(обновление не требуется)", 
							Формат(НоваяЦена,"ЧДЦ=5"))
					,, "Цена с затратами");
	Иначе	
		клДаНет(Новый ОписаниеОповещения("ОбновитьЦенуСЗатратамиЗавершение", ЭтотОбъект, Новый Структура("ТекДанные,НоваяЦена", ТекДанные, НоваяЦена)),
			СтрШаблон("Цена с затратами составляет %1. Установить это значение?", Формат(НоваяЦена,"ЧДЦ=5")), Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦенуСЗатратамиЗавершение(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	ТекДанные = Параметры.ТекДанные;
	НоваяЦена = Параметры.НоваяЦена;
	
	ТекДанные.ВКД_ЦенаСЗатратами = НоваяЦена;   
	ТекДанные.стрПроцент = гоПроцент0(ТекДанные.СуммаПродажи, ТекДанные.ВКД_ЦенаСЗатратами * ТекДанные.Количество);   
	Модифицированность = Истина;
КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.РасходнаяНакладная.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти


&НаКлиенте
Процедура УстановитьКолво(Команда) 
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Количество = 1;
	КонецЦикла;
    Объект.Дата = Дата(2026,02,12);
	Записать();
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄