#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);  
	
	гоСтандартныйОтборПоПолю("Склады", Список, "Склад");
	
	СтруктураПечатныхФорм = Документы.Инвентаризация.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

КонецПроцедуры

#КонецОбласти   


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ИнвентаризацияСклады.Склад КАК Склад,
	             |	ИнвентаризацияСклады.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.Инвентаризация.Склады КАК ИнвентаризацияСклады
	             |ГДЕ
	             |	ИнвентаризацияСклады.Ссылка В(&Ссылки)";
	Запр.УстановитьПараметр("Ссылки", Строки.ПолучитьКлючи());
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Выборка.Ссылка];
		СтрокаСписка.Данные.Склады = СтрокаСписка.Данные.Склады + Выборка.Склад + ", ";
	КонецЦикла;
	
КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Инвентаризация.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти 