
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		//НОВАЯ
		
		//Запись.Автор = Пользователи.ТекущийПользователь();
		Запись.Автор = ПараметрыСеанса.Пользователь;
		Запись.ЗапланированнаяДатаДоставки = ТекущаяДата();
		Запись.УникИдент = Новый УникальныйИдентификатор; 
		
	КонецЕсли;
	
	// © Primus1C  10.09.2023  НАЧАЛО ►
	Сп = Элементы.Получатель.СписокВыбора;
    Сп.Очистить();
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Пользователи.Ссылка,
	             |	Пользователи.Наименование
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	НЕ Пользователи.ПометкаУдаления
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Пользователи.Наименование";  
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл            
		Если Сооб_Сервер.ПроверитьНаличиеРоли(Выборка.Ссылка) Тогда
			Сп.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;  
	
	Сп = Элементы.ТипСообщения.СписокВыбора;
	Сп.Очистить();
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Напоминание,,,БиблиотекаКартинок.СообщениеЗеленое16);
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Сообщение,,,БиблиотекаКартинок.СообщениеСинее16);
	Сп.Добавить(Перечисления.Сооб_ТипСообщения.Поручение,,,БиблиотекаКартинок.СообщениеКрасное16);  
	
	Если НЕ РольДоступна("Сооб_АдминистраторСообщений") Тогда
	
		
	
	КонецЕсли; 
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Автор = гоПользователь() И Запись.ДатаСоздания = Сооб_Сервер.ПустаяДата() Тогда
		
		Запись.ДатаСоздания = ТекущаяДата();
		Запись.ДатаПервогоПолучения = Запись.ЗапланированнаяДатаДоставки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	
	// © Primus1C  10.09.2023  НАЧАЛО ►
	Элементы.ГруппаВыполнение.Видимость = Запись.ТипСообщения = ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Поручение");
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Если ЗначениеЗаполнено(Запись.ДатаСоздания) Тогда
		
		Элементы.Получатель.ТолькоПросмотр = Истина;
		Элементы.ЗапланированнаяДатаДоставки.ТолькоПросмотр = Истина;
		Элементы.Категория.ТолькоПросмотр = Истина;
		Элементы.ТипСообщения.ТолькоПросмотр = Истина;
		Элементы.Тема.ТолькоПросмотр = Истина;
		Элементы.Сообщение.ТолькоПросмотр = Истина;
		Элементы.СсылкаНаОбъект.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если Запись.Получатель = гоПользователь() Тогда
		
		Элементы.ПометитьНаУдаление.ТолькоПросмотр = ЛОЖЬ;
		
		Если (НЕ ЗначениеЗаполнено(Запись.ДатаВыполнения))
			И ЭтоПоручение() Тогда 
			Элементы.Выполнено.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.Выполнено.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Запись.Автор = гоПользователь() Тогда
		
		Элементы.МожноУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Запись.КтоЗаблокировал)) И (Запись.КтоЗаблокировал = гоПользователь()) Тогда
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Запись.КтоЗаблокировал) Тогда
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ЛОЖЬ;
		
	Иначе
		
		Элементы.ВременноНеУдалять.ТолькоПросмотр = ИСТИНА;
		
	КонецЕсли;
	
	Если ЭтоНапоминание() тогда
		
		Элементы.Получатель.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПоручение()
	
	Если Запись.ТипСообщения = Перечисления.Сооб_ТипСообщения.Поручение Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЭтоНапоминание()
	
	Если Запись.ТипСообщения = Перечисления.Сооб_ТипСообщения.Напоминание Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ВыполненоПриИзменении(Элемент)
	
	Если (Запись.Выполнено) И (Запись.ДатаВыполнения = Сооб_Сервер.ПустаяДата()) Тогда     
		
		Запись.ДатаВыполнения = ТекущаяДата();
		
		ЭтаФорма.Записать();
		ЭтаФорма.ОбновитьОтображениеДанных();
		
		УстановитьДоступностьРеквизитов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	
	Если ЭтоНапоминание() Тогда
		
		Запись.Получатель = гоПользователь();
		
	КонецЕсли;
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если НЕ Сооб_Сервер.ПроверитьНаличиеРоли(Запись.Получатель) Тогда
		
		Запись.Получатель = Сооб_Сервер.ПустойПользователь();
		
		СообщПольз = Новый СообщениеПользователю;
		СообщПольз.Текст = НСтр("ru = 'Пользователь не подключен к подсистеме ""Сообщения""'; en = 'The user is not connected to the subsystem ""Messages""'");
		СообщПольз.ПутьКДанным = "Запись.Получатель";
		СообщПольз.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ТекстКом = Запись.Комментарий;
	
	Запись.Комментарий = "";
	
	Если СокрЛП(ТекстКом) = "" Тогда
		Запись.Комментарий = СокрЛП(гоПользователь())+" "+Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:MM:ss'")+" >>> ";
	Иначе
		Запись.Комментарий = ТекстКом + "
		|******************************"+ "
		|"+ СокрЛП(гоПользователь())+" "+Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:MM:ss'")+" >>> ";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МожноУдалятьПриИзменении(Элемент)
	
	Если Запись.МожноУдалять Тогда     
		
		Запись.ДатаМожноУдалять = ТекущаяДата();
		
	Иначе
		
		Запись.ДатаМожноУдалять = Сооб_Сервер.ПустаяДата();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеПриИзменении(Элемент)
	
	Если Запись.ПометитьНаУдаление Тогда     
		
		Запись.ДатаПометкиНаУдаление = ТекущаяДата();
		
	Иначе
		
		Запись.ДатаПометкиНаУдаление = Сооб_Сервер.ПустаяДата();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВременноНеУдалятьПриИзменении(Элемент)
	
	Если Запись.ВременноНеУдалять Тогда     
		
		Запись.КтоЗаблокировал = гоПользователь();
		
	Иначе
		
		Запись.КтоЗаблокировал = Сооб_Сервер.ПустойПользователь();
		
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

// © Primus1C  10.09.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПолучательНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)


КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
