
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ОжидаемоеПоступлениеДС") Тогда
		ОжидаемоеПоступлениеДС	 = ДанныеЗаполнения;
		Валюта					 = ДанныеЗаполнения.Валюта;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	_ВзаиморасчетыСКлиентамиОстатки.Валюта,
		               |	_ВзаиморасчетыСКлиентамиОстатки.СуммаОплатыОстаток
		               |ИЗ
		               |	РегистрНакопления._ВзаиморасчетыСКлиентами.Остатки(&Дата, ОжидаемоеПоступлениеДС = &ОжидаемоеПоступлениеДС) КАК _ВзаиморасчетыСКлиентамиОстатки";
		Запрос.УстановитьПараметр("Дата",					 МоментВремени());
		Запрос.УстановитьПараметр("ОжидаемоеПоступлениеДС",	 ОжидаемоеПоступлениеДС);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.СуммаОплатыОстаток > 0 Тогда
				Сумма	 = Выборка.СуммаОплатыОстаток;
				Валюта	 = Выборка.Валюта;
			Иначе
				
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВЗАИМОРАСЧЕТЫ С КЛИЕНТАМИ
	Движения._ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движение						 = Движения._ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения			 = ВидДвиженияНакопления.Расход;
	Движение.Период					 = Дата;
	Движение.ОжидаемоеПоступлениеДС	 = ОжидаемоеПоступлениеДС;
	Движение.Контрагент				 = ОжидаемоеПоступлениеДС.Контрагент;
	Движение.СуммаОплаты			 = Сумма;
	Движение.Валюта					 = Валюта;
	
КонецПроцедуры