&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Таб.Очистить();
	
	Если Параметры.Свойство("Таб") Тогда 
		Таб.Вывести(Параметры.Таб); 
		Таб.ОриентацияСтраницы = Параметры.Таб.ОриентацияСтраницы;
	КонецЕсли; 
	Если Параметры.Свойство("КлючСохраненияПоложенияОкна") Тогда ЭтаФорма.КлючСохраненияПоложенияОкна = Параметры.КлючСохраненияПоложенияОкна КонецЕсли; 
	
	Имя = "Печать таблицы";
	Если Параметры.Свойство("Имя") Тогда Имя = Параметры.Имя КонецЕсли; 
	
	//ЭтаФорма.Заголовок = Параметры.Имя; 
КонецПроцедуры

&НаКлиенте
Процедура ТабОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
КонецПроцедуры
