
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НачислениеЗарплаты.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЗарплаты.Валюта,
	|	НачислениеЗарплаты.Дата,
	|	НачислениеЗарплаты.Курс,
	|	НачислениеЗарплаты.Номер,
	|	НачислениеЗарплаты.Период,
	|	НачислениеЗарплаты.Список.(
	|		НомерСтроки,
	|		Сотрудник,
	|		НачисленоВДолларах,
	|		НачисленоВРублях,
	|		КВыдачеВДолларах,
	|		КВыдачеВРублях
	|	)
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокШапка = Макет.ПолучитьОбласть("СписокШапка");
	ОбластьСписок = Макет.ПолучитьОбласть("Список");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		Строка = Выборка.Номер;
		
		Номер = СокрЛП(Строка);
		Пока Лев(Номер, 1) = "0" Цикл 
			Номер = Сред(Номер, 2);
		КонецЦикла;
		Дата = Формат(Выборка.Дата,"ДЛФ=DD");
		Шапка.Параметры.ЗаголовокДокумента = "Начисление зарплаты № " + СокрЛП(Номер) + " от " + СокрЛП(Дата);
		Шапка.Параметры.Период = "за период: " + Формат(Выборка.Период, "ДФ='MMMM гггг ''г.'''");               
		ТабДок.Вывести(Шапка, Выборка.Уровень());                                                            
		
		ТабДок.Вывести(ОбластьСписокШапка);
		ВыборкаСписок = Выборка.Список.Выбрать();
		Пока ВыборкаСписок.Следующий() Цикл
			ОбластьСписок.Параметры.Заполнить(ВыборкаСписок);
			ТабДок.Вывести(ОбластьСписок, ВыборкаСписок.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
