
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок 			= Параметры.Заголовок;  
	Если Параметры.Свойство("Пояснение") Тогда
		Пояснение 		= Параметры.Пояснение;
	Иначе
		Элементы.ГруппаПояснение.Видимость = Ложь;	
	КонецЕсли;
    РезультатВыполнения = Параметры.РезультатВыполнения;
	//ПараметрыВыполненияКоманды =  Параметры.ПараметрыВыполненияКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Буф = РаботаСоСканеромШК.ОставитьТолькоИМЕИ(ДлиннаяСтрока);
    КвоСтрок = СтрЧислоСтрок(Буф);
	// массив нужен чтобы сохранить порядок серий
	мас = Новый Массив;
	Для Н = 1 По КвоСтрок Цикл
		НовСер = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (НовСер = "") И (С <> "") Цикл
			НовСер = гоСледПолеТаб(С);
		КонецЦикла;	
		серия = СокрЛП(НовСер);
		Если серия = "" Тогда
			Продолжить;		
		Иначе
			мас.Добавить(серия);
		КонецЕсли;
	КонецЦикла;
	Если мас.ВГраница() > -1 Тогда
		Отбор = Новый Структура("Серия, Фирма", мас, гоФирма());
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
		//ОткрытьФорму("Отчет.ОборотыОднойСерии.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		ОткрытьФорму(РезультатВыполнения, ПараметрыФормы, , , );
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры
