// © Primus1C  20.11.2023  НАЧАЛО ►

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	ЗаполнитьКэшДанных();  
	
	ЗаполнитьПоказателиПеремещений() ;

	//ОтобразитьТоварныеГруппы();
	
	СформироватьГиперссылкиФайловНаФорме();
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	Элементы.ВалютаЗатрат.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	
	СтруктураПечатныхФорм = Документы.ОтправкаПеремещений.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	УстановитьУсловноеОформление();
	
	////++
	//ИсторияИзменений = Новый Структура("Шапка,ТЧ", Новый Массив, Новый Массив);
	//Для каждого Рекв Из Метаданные.Документы.ОтправкаПеремещений.Реквизиты Цикл
	//	ИсторияИзменений.Шапка.Добавить(Новый Структура("Имя,Синоним,Значение", Рекв.Имя, Рекв.Синоним, Объект[Рекв.Имя]));
	//КонецЦикла;
	//Для каждого ТЧ Из Метаданные.Документы.ОтправкаПеремещений.ТабличныеЧасти Цикл
	//	Строки = Новый Массив;
	//	Строки.Добавить();
	//	ИсторияИзменений.ТЧ.Добавить(Новый Структура("Имя,Строки", ТЧ.Имя, Строки))	
	//КонецЦикла;
	////--

	Элементы.ТоварныеДокументыСумма.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Sum'"), ПараметрыСеанса.БазоваяВалюта.Символ);	

	ЗаполнитьДеревоЗначенийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	ОтобразитьЦветВалюты();
	ОбновитьИтоги();
	УстановитьДоступность();
	
	//ОбновитьРасчетныеКолонкиРаспределениеЗатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// !! Функционал с выбором поставки выбранного инвойса --
	//
	//НедопоставкиИнвойса = НедопоставкиИнвойса(ВыбранноеЗначение); 
	//Если НедопоставкиИнвойса.Количество() = 0 Тогда
	//    клВнимание(НСтр("ru = 'По выбранной поставке все товары уже доставлены!'; en = 'For the selected delivery, all goods have already been delivered!'"), , НСтр("ru = 'Выбор поставки'; en = 'Delivery selection'"));
	//	Возврат;
	//ИначеЕсли НедопоставкиИнвойса.Количество() = 1 Тогда	
	//    ВыбраннаяПоставка = НедопоставкиИнвойса[0].Значение;
	//Иначе
	//	ВыбраннаяПоставка = клВариантСписка(НСтр("ru = 'Выберите поставку'; en = 'Select delivery'"), НедопоставкиИнвойса); 
	//	Если ВыбраннаяПоставка = Неопределено Тогда
	//	    Возврат;
	//	КонецЕсли;
	//КонецЕсли;                                                    
	//
	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбранноеЗначение)); 
	//Если НайдСтроки.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;        
	//НовСтрокаТЧ = Объект.Инвойсы.Добавить(); 
	//НовСтрокаТЧ.Инвойс 		= ВыбранноеЗначение; 
	//НовСтрокаТЧ.Поставка 	= ВыбраннаяПоставка;
	//ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ); 
	// 
	// -- !!
	
	Если ИсточникВыбора.ПоследнееОтправлено Тогда 
		//ИсточникВыбора.ТекущийЭлемент.ТекущиеДанные.НомерИнвойса
		клПредупреждение(НСтр("ru = 'Уже отправлено!'; en = 'Already sent!'"), 5, НСтр("ru = 'Выбор инвойса/поставки'; en = 'Selection the invoice/delivery'"));
		Возврат;
	КонецЕсли; 
	ВыбДокумент 		= ИсточникВыбора.ПоследнийДокумент; 
	//ВыбПоставка		= ИсточникВыбора.ПоследняяПоставка;

	//НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", ВыбИнвойс)); 
	НайдСтроки = Объект.ТоварныеДокументы.НайтиСтроки(Новый Структура("ТоварныйДокумент", ВыбДокумент)); 
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;        
	НовСтрокаТЧ = Объект.ТоварныеДокументы.Добавить(); 
	НовСтрокаТЧ.ТоварныйДокумент = ВыбДокумент; 
	//НовСтрокаТЧ.Поставка 	= ВыбПоставка;
	//ЗаполнитьДанныеСтрокиПоИнвойсу(НовСтрокаТЧ);
	ЗаполнитьПоказателиПеремещений();
	ОбновитьИтоги();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСтрокуПрикреплений" Тогда
		СформироватьГиперссылкиФайловНаФорме();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыПодбора(Рез, Доп) Экспорт 
	//если ничего не выбрали, то в рез будет пусто...
	//Если НЕ Рез = Неопределено Тогда 
	//	Объект.ТабличнаяЧасть1.Добавить().Кво = Рез;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// проверка дублей строк
	Ошибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из Объект.ТоварныеДокументы Цикл
		НайдСтроки = Объект.ТоварныеДокументы.НайтиСтроки(Новый Структура("ТоварныйДокумент", СтрокаТЧ.ТоварныйДокумент));
		Если НайдСтроки.ВГраница() > 0 Тогда  
			Стр = "";
			Для Инд = 0 По НайдСтроки.ВГраница() Цикл
				Стр = Стр + НайдСтроки[Инд].НомерСтроки + ", ";
			КонецЦикла;
			Ошибки.Вставить(СтрокаТЧ.ТоварныйДокумент, Стр);
		КонецЕсли;	
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Найдены дубли в строках: '; en = 'Duplicates found in the lines: '") + Символы.ПС;
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 %2 - строки %3%4'; en = '%1 %2 - lines %3%4'"), ТекстОшибки, Ош.Ключ, Ош.Значение, Символы.ПС);
		КонецЦикла;
		ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-3);	
		Сообщить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	ЗаполнитьКэшДанных();
	ОбновитьИтоги();
	
КонецПроцедуры

#КонецОбласти         


#Область ДействияЭлементовФормы

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	//КэшДанных.Вставить("РаспределятьПоТоварнымГруппамПревозчика", ТекущаяДата() > Дата(2025, 02, 01));
	//Режим = КэшДанных.РаспределятьПоТоварнымГруппамПревозчика;
	//Элементы.ЗатратыТоварнаяГруппа.Видимость = НЕ Режим;
	//Элементы.ЗатратыТоварнаяГруппаПеревозчика.Видимость = Режим;
	//Элементы.РаспределениеЗатратТоварнаяГруппа.Видимость = НЕ Режим;
	//Элементы.РаспределениеЗатратТоварнаяГруппаПеревозчика.Видимость = Режим;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаЗатратПриИзменении(Элемент)
	
	ОтобразитьЦветВалюты();  
	
КонецПроцедуры

#КонецОбласти 


#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ТоварныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварныеДокументыТоварныйДокумент" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.ТоварныйДокумент);   
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеДокументыПослеУдаления(Элемент)

	ЗаполнитьКэшДанных();
	ОбновитьИтоги();

КонецПроцедуры


&НаКлиенте
Процедура ИнвойсыПеремещениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
        МассивТипов = Новый Массив;
        МассивТипов.Добавить(ВыбранноеЗначение);
        ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
        ТекущиеДанные = Элементы.ТоварныеДокументы.ТекущиеДанные;
        ТекущиеДанные.ТоварныйДокумент = ОписаниеТипов.ПривестиЗначение();
        СтандартнаяОбработка = Ложь;
        
        // после выбора типа можно сразу вызвать выбор документа, но это не обязательно
        ОткрытьФормуВыбораДокумента(ТекущиеДанные.ТоварныйДокумент, Элемент)
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДокумента(Ссылка, Элемент, МножественныйВыбор = Ложь)
	
    ПараметрыФормы  = Новый Структура;        
    Отбор = Новый Структура("Склад", Объект.СкладОтправитель);
    
    // здесь формируем отборы
    
    ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Если МножественныйВыбор Тогда
		
		
		
	Иначе
		
		
		
		ИмяФормыВыбора = ПолучитьИмяФормыВыбораПоСсылке(Ссылка);
		ФормаВыбора = ПолучитьФорму(ИмяФормыВыбора, ПараметрыФормы, Элемент);
		ФормаВыбора.Заголовок = НСтр("ru = 'Форма выбора с отбором по складу'; en = 'Selection filtered by warehouse'");
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыВыбораПоСсылке(Ссылка)
    Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаВыбора";
КонецФункции



&НаКлиенте
Процедура ИнвойсыПеремещениеПриИзменении(Элемент)
	
	ЗаполнитьПоказателиПеремещений();
	ОбновитьИтоги();
  	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоказателиПеремещений()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	СУММА(ПеремещениеТовары.Количество) КАК Количество,
	             |	СУММА(ПеремещениеТовары.СуммаЗакупки) КАК Сумма,
	             |	ПеремещениеТовары.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.Перемещение.Товары КАК ПеремещениеТовары
	             |ГДЕ
	             |	ПеремещениеТовары.Ссылка В(&ТоварныеДокументы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ПеремещениеТовары.Ссылка
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	СУММА(РасходнаяТовары.Количество),
	             |	СУММА(РасходнаяТовары.СуммаЗакупки),
	             |	РасходнаяТовары.Ссылка
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяТовары
	             |ГДЕ
	             |	РасходнаяТовары.Ссылка В(&ТоварныеДокументы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасходнаяТовары.Ссылка";
	Запр.УстановитьПараметр("ТоварныеДокументы", Объект.ТоварныеДокументы.Выгрузить(,"ТоварныйДокумент").ВыгрузитьКолонку(0)); 
	Соотв = Новый Соответствие;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соотв.Вставить(Выборка.Ссылка, Новый Структура("Количество,Сумма", Выборка.Количество, Выборка.Сумма));
	КонецЦикла;
	Для каждого СтрокаТЧ Из Объект.ТоварныеДокументы Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ТоварныйДокумент) И Соотв.Получить(СтрокаТЧ.ТоварныйДокумент) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Соотв.Получить(СтрокаТЧ.ТоварныйДокумент));
		КонецЕсли; 
		СтрокаТЧ.СтатусПроведения = ОбщегоНазначенияСервер.СтатусПроведения(СтрокаТЧ.ТоварныйДокумент);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбораПоставок(СтрокаТЧ)

	КвоПоставок = КэшДанных.ТоварныеДокументы[СтрокаТЧ.Инвойс].КоличествоПоставокВИнвойсе;
	Если КвоПоставок = 0 Тогда
		//	//Поле.СписокВыбора.Добавить(0, "инвойс полностью");
	Иначе  
		ПолеПоставка = Элементы.ТоварныеДокументы.ПодчиненныеЭлементы.ИнвойсыПоставка;
		ПолеПоставка.СписокВыбора.Очистить();
		Для Инд = 1 По КвоПоставок Цикл     
			КвоВПоставке = КэшДанных.ТоварныеДокументы[СтрокаТЧ.Инвойс].ПоставкиИнвойсов[Инд].Количество;
			ПолеПоставка.СписокВыбора.Добавить(Инд, СтрШаблон(НСтр("ru = '%1 (из %2), кол-во %3'; en = '%1 (of %2), quantity %3'"), Инд, КвоПоставок, КвоВПоставке));
		КонецЦикла;
		Элементы.ТоварныеДокументы.ТекущиеДанные.Поставка = 1;
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьДанныеСтрокиПоИнвойсу(СтрокаТЧ)
//	
//	ЗаполнитьКэшДанных();
//	УстановитьКоличествоПоставки(СтрокаТЧ); 
//	ОбновитьИтоги();
//   	Модифицированность = Истина;
//   
//КонецПроцедуры

&НаКлиенте
Процедура ТоварныеДокументыПриАктивизацииЯчейки(Элемент)
	 
	Поле = Элемент.ТекущийЭлемент; 
	Если Поле.Имя = "ИнвойсыПоставка" Тогда
	
		Поле.СписокВыбора.Очистить();
		КвоПоставок = КэшДанных.ТоварныеДокументы[Элемент.ТекущиеДанные.Инвойс].КоличествоПоставокВИнвойсе;
		Если КвоПоставок = 0 Тогда
			//Поле.СписокВыбора.Добавить(0, "инвойс полностью");
		Иначе
			Для Инд = 1 По КвоПоставок Цикл   
				КвоВПоставке = КэшДанных.ТоварныеДокументы[Элемент.ТекущиеДанные.Инвойс].ПоставкиИнвойсов[Инд].Количество;
				Поле.СписокВыбора.Добавить(Инд, СтрШаблон(НСтр("ru = '%1 (из %2), кол-во %3'; en = '%1 (of %2), quantity %3'"), Инд, КвоПоставок, КвоВПоставке));
			КонецЦикла;
			//Элемент.ТекущиеДанные.Поставка = 1;
		КонецЕсли;	
	
	КонецЕсли; 
	
КонецПроцедуры

//&НаКлиенте
//Процедура ИнвойсыПоставкаПриИзменении(Элемент) 
//	
//	УстановитьКоличествоПоставки(Элементы.Перемещения.ТекущиеДанные); 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьКоличествоПоставки(ТекДанные)
//	
//	//ДанныеПоставки = КэшДанных.Перемещения[ТекДанные.Инвойс].ПоставкиИнвойсов[ТекДанные.Поставка]; 
//	//Если ДанныеПоставки <> Неопределено Тогда
//	//	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеПоставки, "Количество,Сумма,Статус,Затраты"); 
//	//КонецЕсли;

//КонецПроцедуры

&НаКлиенте
Процедура ПодборРасходных(Команда)
	
	ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаВыбора", 
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, ВыбранныеИнвойсы, ВидимостьКнопкиВыбора",
						Ложь, Истина, Ложь, ДокументыТЧ(), Ложь), 
		ЭтаФорма,
		, , ,
		Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора", ЭтаФорма, "Подбор"), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаКлиенте
Процедура ПодборПеремещений(Команда)

	ОткрытьФорму("Документ.Перемещение.Форма.ФормаВыбора", 
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, ВыбранныеДокументы, ВидимостьКнопкиВыбора, СкладОтправитель",
						Ложь, Истина, Истина, ДокументыТЧ(), Ложь, Объект.СкладОтправитель), 
		ЭтаФорма,
		, , ,
		Новый ОписаниеОповещения("ПриЗакрытииФормыПодбора", ЭтаФорма, "Подбор"), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);       
	
КонецПроцедуры

&НаСервере
Функция ДокументыТЧ()
	
	Спис = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из Объект.ТоварныеДокументы Цикл
		Спис.Добавить(СтрШаблон("%1##", СтрокаТЧ.ТоварныйДокумент.Номер));
	КонецЦикла;
	Возврат Спис;

КонецФункции 

&НаКлиенте
Процедура ОбновитьТЧ(Команда)
	
	//Для каждого СтрокаТЧ Из Объект.Перемещения Цикл
	//	УстановитьКоличествоПоставки(СтрокаТЧ);
	//КонецЦикла;
	ЗаполнитьПоказателиПеремещений();
    ОбновитьИтоги();
	
КонецПроцедуры

#КонецОбласти                    


#Область РаботаСФайлами

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), 
																"НажатиеГиперссылкиФайла");

КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СтандартнаяОбработка = Ложь;
	НажатиеГиперссылкиФайла(Неопределено, СтандартнаяОбработка) 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	//Сообщить("Тип клиента: "+ПолучитьТипКлиента());
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Документ еще не записан. Записать его и прикрепить файл?'; en = 'The document has not yet been saved. Save it and attach the file?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			//Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		//Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры // ПолучитьРазмерФайла()

#КонецОбласти


#Область Служебные

&НаСервере
Функция НедопоставкиИнвойса(ИнвойсСсылка)
	
	СписокНедопоставок = Новый СписокЗначений;
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Инвойс", ИнвойсСсылка);
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ОтправкаИнвойсов.Поставка КАК Поставка,
	             |	СУММА(ОтправкаИнвойсов.Количество) КАК Количество,
	             |	СУММА(ОтправкаИнвойсов.Сумма) КАК Сумма
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |ГДЕ
	             |	ОтправкаИнвойсов.Инвойс = &Инвойс
	             //|	И ОтправкаИнвойсов.Поставка <> 0
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОтправкаИнвойсов.Поставка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Поставка";
	Выборка = Запр.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		СписокНедопоставок.Добавить(Выборка.Поставка, 
									СтрШаблон(НСтр("ru = 'Поставка %1: %2 %3 шт, сумма %4 %5'; en = 'Delivery %1: %2 %3 , sum %4 %5'"), 
												Выборка.Поставка, 
												?(Выборка.Количество < 0, НСтр("ru = 'отправлено'; en = 'sent'"), НСтр("ru = 'ожидается'; en = 'expected'")), 
												Выборка.Количество, 
												Выборка.Сумма, 
												ИнвойсСсылка.Валюта), ,
									?(Выборка.Количество <= 0, БиблиотекаКартинок.ДоставкаНеактивна, БиблиотекаКартинок.Доставка));
	КонецЦикла;
	
	Возврат СписокНедопоставок;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКэшДанных()
	
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Инвойсы", Объект.Инвойсы.Выгрузить().ВыгрузитьКолонку("Инвойс"));
	//Запр.Текст = "ВЫБРАТЬ
	//             |	МАКСИМУМ(_ИнвойсПоставки.Поставка) КАК Поставка,
	//             |	_ИнвойсПоставки.Ссылка КАК Инвойс
	//             |ИЗ
	//             |	Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	//             |ГДЕ
	//             |	_ИнвойсПоставки.Ссылка В(&Инвойсы)
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	_ИнвойсПоставки.Ссылка
	//             |;
	//             |
	//             |////////////////////////////////////////////////////////////////////////////////
	//             |ВЫБРАТЬ
	//             |	_Инвойс.Ссылка КАК Инвойс,
	//             |	_Инвойс.СуммаЗатрат КАК Затраты,
	//             |	ЕСТЬNULL(_ИнвойсПоставки.Поставка, 0) КАК Поставка,
	//             |	ВЫБОР
	//             |		КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	//             |			ТОГДА СкоррИнвойсы.КоличествоОборот
	//             |		ИНАЧЕ СУММА(_ИнвойсПоставки.Количество)
	//             |	КОНЕЦ КАК Количество,
	//             |	ЕСТЬNULL(ВЫБОР
	//             |			КОГДА _ИнвойсПоставки.Поставка ЕСТЬ NULL
	//             |				ТОГДА СкоррИнвойсы.СуммаОборот
	//             |			ИНАЧЕ СУММА(_ИнвойсПоставки.Сумма)
	//             |		КОНЕЦ, 0) КАК Сумма,
	//             |	СостоянияИнвойсов.Статус КАК Статус
	//             |ИЗ
	//             |	Документ._Инвойс КАК _Инвойс
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	//             |		ПО (_ИнвойсПоставки.Ссылка = _Инвойс.Ссылка)
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//             |			СкорИнв.Инвойс КАК Инвойс,
	//             |			СкорИнв.КоличествоОборот КАК КоличествоОборот,
	//             |			СкорИнв.СуммаОборот КАК СуммаОборот
	//             |		ИЗ
	//             |			РегистрНакопления.СкорректированныеИнвойсы.Обороты(, , , Инвойс В (&Инвойсы)) КАК СкорИнв) КАК СкоррИнвойсы
	//             |		ПО _Инвойс.Ссылка = СкоррИнвойсы.Инвойс
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	//             |		ПО (СостоянияИнвойсов.Инвойс = _Инвойс.Ссылка)
	//             |ГДЕ
	//             |	_Инвойс.Ссылка В(&Инвойсы)
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	_ИнвойсПоставки.Поставка,
	//             |	_Инвойс.Ссылка,
	//             |	СкоррИнвойсы.КоличествоОборот,
	//             |	СкоррИнвойсы.СуммаОборот,
	//             |	СостоянияИнвойсов.Статус,
	//             |	_Инвойс.СуммаЗатрат";
	//РезультатЗапроса = Запр.ВыполнитьПакет();
	//
	//Выборка = РезультатЗапроса[0].Выбрать();
	//Соотв = Новый Соответствие; 
	//Пока Выборка.Следующий() Цикл
	//	Соотв.Вставить(Выборка.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", Выборка.Поставка, Новый Соответствие));
	//КонецЦикла;    
	//
	//Объект.Сумма = 0;
	//ВыборкаП = РезультатЗапроса[1].Выбрать();
	//Пока ВыборкаП.Следующий() Цикл
	//	НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
	//	Если НайдСоотв = Неопределено Тогда
	//		Соотв.Вставить(ВыборкаП.Инвойс, Новый Структура("КоличествоПоставокВИнвойсе, ПоставкиИнвойсов", 0, Новый Соответствие));
	//		НайдСоотв = Соотв[ВыборкаП.Инвойс]; 
	//	КонецЕсли;
	//	НайдСоотв.ПоставкиИнвойсов.Вставить(ВыборкаП.Поставка, Новый Структура("Количество,Сумма,Статус", 	ВыборкаП.Количество, ВыборкаП.Сумма, ВыборкаП.Статус));
	//	//+
	//	НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс, Поставка", ВыборкаП.Инвойс, ВыборкаП.Поставка));
	//	Если НайдСтроки.Количество() > 0 Тогда
	//		//	НайдСтроки[0].РасхождениеСумма 		= НайдСтроки[0].Сумма <> ВыборкаП.Сумма;
	//		//	НайдСтроки[0].РасхождениеКоличество = НайдСтроки[0].Количество <> ВыборкаП.Количество;   
	//		НайдСтроки[0].Количество 	= ВыборкаП.Количество;
	//		//НайдСтроки[0].Сумма 		= ВыборкаП.Сумма / ?(ВыборкаП.Инвойс.Курс=0, 1, ВыборкаП.Инвойс.Курс); 
	//		НайдСтроки[0].Сумма 		= ВыборкаП.Сумма; 
	//		НайдСтроки[0].Статус		= ВыборкаП.Статус;
	//		НайдСтроки[0].Затраты		= ВыборкаП.Затраты;
	//		Объект.Сумма = Объект.Сумма + ВыборкаП.Сумма; 
	//	КонецЕсли; 
	//	Элементы.ИнвойсыЗатраты.ТекстПодвала = Формат(Объект.Инвойсы.Итог("Затраты"), "ЧДЦ=2");
	//	//-
	//КонецЦикла;     
	
	//КэшДанных = Новый Структура("Инвойсы", Соотв); 
	//КэшДанных.Вставить("ПоказателиИнвойсов", ПоказателиИнвойсов());
	КэшДанных = Новый Структура();
	КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	//КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветВалюты()
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		//Элементы.ВалютаЗатрат.ЦветФона = ОбщегоНазначения.ЦветВалюты(Объект.ВалютаЗатрат);   
		Элементы.ВалютаЗатрат.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.ВалютаЗатрат);
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	Для каждого СтрокаТЧ Из Объект.ТоварныеДокументы Цикл
		СтрокаТЧ.Контрагент = Контрагент(СтрокаТЧ.ТоварныйДокумент); 
	КонецЦикла;
	Элементы.ТоварныеДокументыКоличество.ТекстПодвала = Объект.ТоварныеДокументы.Итог("Количество");
	Элементы.ТоварныеДокументыСумма.ТекстПодвала = Объект.ТоварныеДокументы.Итог("Сумма");
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент(ДокументСсылка)

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Возврат ДокументСсылка.Контрагент;
	Иначе	
	    Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	

КонецФункции // ()

#КонецОбласти


&НаКлиенте
Процедура ВводНаОснованииИнвойса(Команда)
	
	Если Элементы.ТоварныеДокументы.ТекущиеДанные <> Неопределено Тогда                                                          
		ПараметрыФормы = Новый Структура("Основание", Новый Структура("Инвойс,Поставка", Элементы.ТоварныеДокументы.ТекущиеДанные.Инвойс, Элементы.ТоварныеДокументы.ТекущиеДанные.Поставка));
		ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры


#Область ОкончательноСнятьУстановить

&НаКлиенте
Процедура Установить(Команда)

	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.ТоварныеДокументы.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>? 
							|Документ будет проведен.'; en = 'Set flag <Finaly>?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Попытка
		Объект.Окончательно = Истина;
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));             
		УстановитьДоступность();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);	

КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	//// © Primus1C  06.02.2024  НАЧАЛО ►
	//Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() Тогда
	//	Если клНетДа(НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	//	Объект.Окончательно = Ложь;
	//	МояЗаписать(Ложь);    
	//	МоиИтоги();
	//	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);    
	//	Возврат;
	//КонецЕсли;
	//// © Primus1C  ОКОНЧАНИЕ ◄

	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	//
	//Сч = 0;
	//Для Каждого Стр Из Объект.Товары Цикл
	//	Нельзя = ?(НельзяРедактироватьЦену(Стр.Партия), 1, 0);
	//	Сч = Сч + Нельзя;
	//	Если Нельзя = 0 Тогда Продолжить КонецЕсли;
	//	Сообщить(НСтр("ru = 'Есть движения партии: '; en = 'Batches movements are posted: '") + гоИмя(Стр.Партия));
	//КонецЦикла;
	//
	////Если НЕ гоЕстьРоль("Оператор") Тогда
	//	Если Сч <> 0 Тогда клОшибка(НСтр("ru = 'Есть движения партий '; en = 'Batches movements are posted '") + гоИмя(Сч) + "!"); Возврат; КонецЕсли;
	////КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг <Окончательно>?'; en = 'Unset flag <Finaly>?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	//МояЗаписать(Ложь);
	Записать();
	УстановитьДоступность();

	//гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Для каждого Элемент Из Элементы Цикл 
		Тип = ТипЗнч(Элемент);
		Если Тип = Тип("ПолеФормы") ИЛИ Тип = Тип("ТаблицаФормы") Тогда
			Элемент.ТолькоПросмотр = Объект.Окончательно; 
		ИначеЕсли Тип = Тип("КнопкаФормы") И Элемент.Родитель <> Элементы.ФормаКоманднаяПанель И Элемент.Родитель.Имя <> "МенюПечать" И Элемент.Имя <> "ДеревоВхожденияНоменклатуры" Тогда
			Элемент.Доступность = НЕ Объект.Окончательно;
		КонецЕсли;
	КонецЦикла;	    
	Если Элементы.Найти("Снять") <> Неопределено Тогда
		Элементы.Снять.Доступность = Объект.Окончательно;
	КонецЕсли;
	Если Элементы.Найти("Установить") <> Неопределено Тогда
		Элементы.Установить.Доступность = НЕ Объект.Окончательно;
	КонецЕсли;
	Элементы.Окончательно.ТолькоПросмотр = Истина;

КонецПроцедуры
	
#КонецОбласти


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.ОтправкаПеремещений.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти


#Область РаспределениеЗатрат

//&НаСервере
//Функция СписокРаспределенныхЗатрат()
//	
//	тз =  Объект.РаспределениеЗатрат.Выгрузить(,"ТоварнаяГруппа");
//	тз.Свернуть("ТоварнаяГруппа");
//	Список = Новый СписокЗначений;
//	Список.ЗагрузитьЗначения( тз.ВыгрузитьКолонку("ТоварнаяГруппа") );   
//	Список.Добавить(Справочники.ГруппыПодбораНоменклатуры.ПустаяСсылка());
//	Возврат Список;
//	
//КонецФункции	

//&НаСервереБезКонтекста
//Функция ТоварнаяГруппа(Знач Номенклатура)
// 	
//	Пока Номенклатура.Уровень() > 0 Цикл
//		Группа = Номенклатура.Родитель.ГруппаПодбора;
//		Если ЗначениеЗаполнено(Группа) Тогда
//			Возврат Группа;
//		КонецЕсли;
//		Номенклатура = Номенклатура.Родитель;		
//	КонецЦикла;
//	Возврат Справочники.Номенклатура.ПустаяСсылка();
//	
//КонецФункции 

&НаСервереБезКонтекста
Функция НоменклатураТоварныхГруппПеревозчика(Перевозчик)
	
	Соотв = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Перевозчик", Перевозчик);
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				 |	ТоварныеГруппыПеревозчиковТовары.Номенклатура КАК ГруппаНоменклатуры,
	             |	ТоварныеГруппыПеревозчиковТовары.Ссылка КАК ТоварнаяГруппаПеревозчика
	             |ИЗ
	             |	Справочник.ТоварныеГруппыПеревозчиков.Товары КАК ТоварныеГруппыПеревозчиковТовары
	             |ГДЕ
	             |	ТоварныеГруппыПеревозчиковТовары.Ссылка.Владелец = &Перевозчик
	             |	И НЕ ТоварныеГруппыПеревозчиковТовары.Ссылка.ПометкаУдаления"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗапрН = Новый Запрос;   
		ЗапрН.УстановитьПараметр("Группа", Выборка.ГруппаНоменклатуры);
		ЗапрН.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              |	Номенклатура.Ссылка КАК Ссылка
		              |ИЗ
		              |	Справочник.Номенклатура КАК Номенклатура
		              |ГДЕ
		              |	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
		              |	И НЕ Номенклатура.ЭтоГруппа";
		ВыборкаН = ЗапрН.Выполнить().Выбрать(); 
		Пока ВыборкаН.Следующий() Цикл
			Соотв.Вставить(ВыборкаН.Ссылка, Выборка.ТоварнаяГруппаПеревозчика);
		КонецЦикла;
	КонецЦикла;             
	
	Возврат Соотв;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьТоварныеГруппы()

	//Если КэшДанных.РаспределятьПоТоварнымГруппамПревозчика Тогда
		
		ТГПеревозчика = НоменклатураТоварныхГруппПеревозчика(Объект.Перевозчик);
		Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
			//СтрокаТЧ.ТоварнаяГруппа = 0; 
			СтрокаТЧ.ТоварнаяГруппаПеревозчика = ТГПеревозчика.Получить(СтрокаТЧ.Номенклатура);
		КонецЦикла;
		
	//Иначе
	//	
	//	Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
	//		СтрокаТЧ.ТоварнаяГруппа = ТоварнаяГруппа(СтрокаТЧ.Номенклатура); 
	//		СтрокаТЧ.ТоварнаяГруппаПеревозчика = 0;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьЗатратыНаСервере(Номенклатура = Неопределено, ТекстСообщения = "")
	
	// 0
	
	Отказ = "";
	Для каждого СтрокаТЧ Из Объект.ТоварныеДокументы Цикл 
		Если НЕ СтрокаТЧ.ТоварныйДокумент.Проведен Тогда
			Отказ = ОбщегоНазначения.ПредставлениеДокументаДляПечати(СтрокаТЧ.ТоварныйДокумент) + ", ";
		КонецЕсли;	
	КонецЦикла;
	Если Отказ <> "" Тогда
		Отказ = Лев(Отказ, СтрДлина(Отказ) - 2);
		Сообщить(НСтр("ru = 'Распределение невозможно! Документ не проведен: '; en = 'Distribution impossible! Document not posted:'") + Отказ);
		Возврат;
	КонецЕсли; 
	Разделитель = Символы.ПС + Символы.ПС;
	
	// Партии товаров без серий 
	
	ЗапрБез = Новый Запрос;
	ЗапрБез.УстановитьПараметр("ТоварныеДокументы", Объект.ТоварныеДокументы.Выгрузить(,"ТоварныйДокумент").ВыгрузитьКолонку(0));
	ЗапрБез.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	Свод.Номенклатура КАК Номенклатура,
	                |	СУММА(ПНТовары.Количество) КАК Количество
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ПеремещениеТовары.Номенклатура КАК Номенклатура,
	                |		ПеремещениеТовары.Партия КАК Партия
	                |	ИЗ
	                |		Документ.Перемещение.Товары КАК ПеремещениеТовары
	                |	ГДЕ
	                |		ПеремещениеТовары.Ссылка В(&ТоварныеДокументы)
	                |		И НЕ ПеремещениеТовары.Номенклатура.УчетПоСериям
	                |	
	                |	ОБЪЕДИНИТЬ
	                |	
	                |	ВЫБРАТЬ
	                |		РасхНаклТовары.Номенклатура,
	                |		РасхНаклТовары.Партия
	                |	ИЗ
	                |		Документ.РасходнаяНакладная.Товары КАК РасхНаклТовары
	                |	ГДЕ
	                |		РасхНаклТовары.Ссылка В(&ТоварныеДокументы)
	                |		И НЕ РасхНаклТовары.Номенклатура.УчетПоСериям) КАК Свод
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК ПНТовары
	                |		ПО Свод.Партия = ПНТовары.Партия
	                |			И Свод.Партия.Док = ПНТовары.Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	Свод.Номенклатура";
	ВыгрузкаБез = ЗапрБез.Выполнить().Выбрать();
	СоотвКолБезСерий = Новый Соответствие;  
	Пока ВыгрузкаБез.Следующий() Цикл
		СоотвКолБезСерий.Вставить(ВыгрузкаБез.Номенклатура, ВыгрузкаБез.Количество); 
	КонецЦикла;
	
	// 1. Затраты товарных групп
	
	Если Номенклатура = Неопределено Тогда
		Объект.РаспределениеЗатрат.Очистить();   
		Для каждого СтрокаТЧ Из Объект.Затраты Цикл
			СтрокаТЧ.Вес 	= 0;
			СтрокаТЧ.ЦенаКг = 0;
		КонецЦикла;
	КонецЕсли;
	
	// заполним вес нетто    
	
	Если Номенклатура <> Неопределено Тогда 
		ТекстСообщения = ТекстСообщения + "Вхождения товара:" + Символы.ПС;
		ЗапрИнфо = Новый Запрос;  
		ЗапрИнфо.УстановитьПараметр("ТоварныеДокументы", Объект.ТоварныеДокументы.Выгрузить(,"ТоварныйДокумент").ВыгрузитьКолонку(0));
		ЗапрИнфо.УстановитьПараметр("Номенклатура", Номенклатура);
		ЗапрИнфо.Текст = "ВЫБРАТЬ разрешенные
		                 |	ПеремещениеТовары.Номенклатура КАК Номенклатура,
		                 |	СУММА(ПеремещениеТовары.Количество) КАК Количество,
		                 |	СУММА(ПеремещениеТовары.Количество) * ПеремещениеТовары.Номенклатура.Вес / 1000 КАК Вес,
		                 |	ПеремещениеТовары.Ссылка КАК Ссылка
		                 |ИЗ
		                 |	Документ.Перемещение.Товары КАК ПеремещениеТовары
		                 |ГДЕ
		                 |	ПеремещениеТовары.Ссылка В(&ТоварныеДокументы)
		                 |	И ПеремещениеТовары.Номенклатура = &Номенклатура
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	ПеремещениеТовары.Номенклатура,
		                 |	ПеремещениеТовары.Ссылка,
		                 |	ПеремещениеТовары.Номенклатура.Вес
		                 |
		                 |ОБЪЕДИНИТЬ
		                 |
		                 |ВЫБРАТЬ
		                 |	РасхНаклТовары.Номенклатура,
		                 |	СУММА(РасхНаклТовары.Количество),
		                 |	СУММА(РасхНаклТовары.Количество) * РасхНаклТовары.Номенклатура.Вес / 1000,
		                 |	РасхНаклТовары.Ссылка
		                 |ИЗ
		                 |	Документ.РасходнаяНакладная.Товары КАК РасхНаклТовары
		                 |ГДЕ
		                 |	РасхНаклТовары.Ссылка В(&ТоварныеДокументы)
		                 |	И РасхНаклТовары.Номенклатура = &Номенклатура
		                 |
		                 |СГРУППИРОВАТЬ ПО
		                 |	РасхНаклТовары.Номенклатура,
		                 |	РасхНаклТовары.Ссылка,
		                 |	РасхНаклТовары.Номенклатура.Вес"; 		
		ВыборкаИнфо = ЗапрИнфо.Выполнить().Выбрать();
		Пока ВыборкаИнфо.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + СтрШаблон("%1: кол-во %2, вес %3%4",
											    	ВыборкаИнфо.Ссылка,
													ВыборкаИнфо.Количество, 
													ВыборкаИнфо.Вес, 
													Символы.ПС);
		КонецЦикла;
	КонецЕсли;	
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("ТоварныеДокументы", Объект.ТоварныеДокументы.Выгрузить(,"ТоварныйДокумент").ВыгрузитьКолонку(0));
	Запр.Текст = "ВЫБРАТЬ  разрешенные
	             |	Свод.Номенклатура КАК Номенклатура,
	             |	СУММА(Свод.Количество) КАК Количество,
	             |	СУММА(Свод.Вес) КАК Вес
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ПеремещениеТовары.Номенклатура КАК Номенклатура,
	             |		СУММА(ПеремещениеТовары.Количество) КАК Количество,
	             |		СУММА(ПеремещениеТовары.Количество * ПеремещениеТовары.Номенклатура.Вес) / 1000 КАК Вес
	             |	ИЗ
	             |		Документ.Перемещение.Товары КАК ПеремещениеТовары
	             |	ГДЕ
	             |		ПеремещениеТовары.Ссылка В(&ТоварныеДокументы)
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		ПеремещениеТовары.Номенклатура
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		РасхНаклТовары.Номенклатура,
	             |		СУММА(РасхНаклТовары.Количество),
	             |		СУММА(РасхНаклТовары.Количество * РасхНаклТовары.Номенклатура.Вес) / 1000
	             |	ИЗ
	             |		Документ.РасходнаяНакладная.Товары КАК РасхНаклТовары
	             |	ГДЕ
	             |		РасхНаклТовары.Ссылка В(&ТоварныеДокументы)
	             |		И РасхНаклТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		РасхНаклТовары.Номенклатура) КАК Свод
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Свод.Номенклатура
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Свод.Номенклатура
	             |АВТОУПОРЯДОЧИВАНИЕ";  
	Выгрузка = Запр.Выполнить().Выгрузить();
	Если Номенклатура = Неопределено Тогда
		Объект.РаспределениеЗатрат.Загрузить(Выгрузка); 
	Иначе
		Для каждого СтрокаВыгрузки Из Выгрузка Цикл
			Если СтрокаВыгрузки.Номенклатура = Номенклатура Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС +
								СтрШаблон("Общее кол-во: %1, вес: %2%3", СтрокаВыгрузки.Количество, СтрокаВыгрузки.Вес, Символы.ПС);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ЗаполнитьТоварныеГруппы();

	// © Primus1C  26.01.2026  НАЧАЛО ►
	Если Объект.Затраты.Количество() = 0 Тогда
		// заполним ТЧ ЗатрарыТоварнымиГруппами	
		тз = Объект.РаспределениеЗатрат.Выгрузить();
		тз.Свернуть("ТоварнаяГруппаПеревозчика", "Вес"); 
		тз.Сортировать("ТоварнаяГруппаПеревозчика");
		Объект.Затраты.Загрузить(тз);
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	тзРаспределениеЗатрат = Объект.РаспределениеЗатрат.Выгрузить(); 
	тзРаспределениеЗатрат.Очистить();

	// распределим по каждой затрате:
	Для каждого СтрокаЗатрат Из Объект.Затраты Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппаПеревозчика) Тогда
			СтрокиОднойГруппы = Объект.РаспределениеЗатрат.НайтиСтроки(Новый Структура("ТоварнаяГруппаПеревозчика", СтрокаЗатрат.ТоварнаяГруппаПеревозчика));
		Иначе
			СтрокиОднойГруппы = Объект.РаспределениеЗатрат;
		КонецЕсли;
		
		// распределим сумму затраты по весу
		ВесГруппы = 0;     
		масТоварыГруппы = Новый Массив;
		Для каждого СтрокаТЧ Из СтрокиОднойГруппы Цикл 
			Если масТоварыГруппы.Найти(СтрокаТЧ.Номенклатура) = Неопределено Тогда
				ВесГруппы = ВесГруппы + СтрокаТЧ.Вес;
			    масТоварыГруппы.Добавить(СтрокаТЧ.Номенклатура); 
			КонецЕсли;
		КонецЦикла; 
		Если ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппаПеревозчика) Тогда
			СтрокаЗатрат.Вес = ВесГруппы; 
		КонецЕсли;     
		
		СтрокаЗатрат.ЦенаКг = ?(СтрокаЗатрат.Вес=0, СтрокаЗатрат.Сумма, СтрокаЗатрат.Сумма / СтрокаЗатрат.Вес);
		к = ?(ВесГруппы=0, 0, СтрокаЗатрат.Сумма / ВесГруппы);        
		
		Для каждого СтрокаГруппы Из СтрокиОднойГруппы Цикл
			//СтрокаГруппы.Сумма = СтрокаГруппы.Сумма + СтрокаГруппы.Вес * к;
			СтрокаТЗ = тзРаспределениеЗатрат.Добавить();
			СтрокаТЗ.Номенклатура				= СтрокаГруппы.Номенклатура; 
			СтрокаТЗ.ТоварнаяГруппаПеревозчика 	= СтрокаЗатрат.ТоварнаяГруппаПеревозчика;
			СтрокаТЗ.Затрата        			= СтрокаЗатрат.Затрата;
			СтрокаТЗ.Количество     			= СтрокаГруппы.Количество;
			СтрокаТЗ.Вес            			= СтрокаГруппы.Вес;
			СтрокаТЗ.Сумма          			= СтрокаГруппы.Вес * к;
			Если Номенклатура <> Неопределено И Номенклатура = СтрокаТЗ.Номенклатура Тогда
				ТекстСообщения = ТекстСообщения + СтрШаблон("%1, Затрата %2, Кол-во: %3, Вес: %4, Сумма: %5%6",	
				                                            ?(ЗначениеЗаполнено(СтрокаТЗ.ТоварнаяГруппаПеревозчика), "Тов.гр. " + СтрокаТЗ.ТоварнаяГруппаПеревозчика, "Без тов.группы"),
															СтрокаТЗ.Затрата,
															СтрокаТЗ.Количество,
			                                                СтрокаТЗ.Вес,
															СтрокаТЗ.Сумма,
															Символы.ПС);
				Прервать;											
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;                               
	
	// для затрат без тов.группы  
	Если Объект.Затраты.Итог("Вес") > 0 Тогда
		Для каждого СтрокаЗатрат Из Объект.Затраты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаЗатрат.ТоварнаяГруппаПеревозчика) Тогда
				СтрокаЗатрат.ЦенаКг = СтрокаЗатрат.Сумма / Объект.Затраты.Итог("Вес");	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//тзРаспределениеЗатрат.Свернуть("Номенклатура,Затрата,Вес,Количество", "Сумма,СуммаИнвойс,СуммаAWB"); 
	Если Номенклатура = Неопределено Тогда
		//ЗаполнитьТоварныеГруппы();
		Объект.РаспределениеЗатрат.Загрузить(тзРаспределениеЗатрат); 
	КонецЕсли;
	
	// 2. ОтправкаAWB: получим "серия-инвойс-поставка"
	
	Если Номенклатура = Неопределено Тогда
		Объект.ЗатратыДоп.Очистить();
	КонецЕсли;

	ЗапрИнв = Новый Запрос;
	ЗапрИнв.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ЗапрИнв.Текст = "ВЫБРАТЬ разрешенные
	                |	ТЧ.Номенклатура КАК Номенклатура,
	                |	СУММА(ТЧ.Количество) КАК Количество,
	                |	ТЧ.Партия КАК Партия
	                |ПОМЕСТИТЬ ВТ
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	                |		РасходнаяНакладнаяТовары.Количество КАК Количество,
	                |		РасходнаяНакладнаяТовары.Партия КАК Партия
	                |	ИЗ
	                |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	                |	ГДЕ
	                |		РасходнаяНакладнаяТовары.Ссылка В
	                |				(ВЫБРАТЬ
	                |					ТЧ.ТоварныйДокумент
	                |				ИЗ
	                |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
	                |				ГДЕ
	                |					ТЧ.Ссылка = &Ссылка)
	                |		И РасходнаяНакладнаяТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	                |	
	                |	ОБЪЕДИНИТЬ ВСЕ
	                |	
	                |	ВЫБРАТЬ
	                |		ПеремещениеТовары.Номенклатура,
	                |		ПеремещениеТовары.Количество,
	                |		ПеремещениеТовары.Партия
	                |	ИЗ
	                |		Документ.Перемещение.Товары КАК ПеремещениеТовары
	                |	ГДЕ
	                |		ПеремещениеТовары.Ссылка В
	                |				(ВЫБРАТЬ
	                |					ТЧ.ТоварныйДокумент
	                |				ИЗ
	                |					Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
	                |				ГДЕ
	                |					ТЧ.Ссылка = &Ссылка)) КАК ТЧ
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ТЧ.Номенклатура,
	                |	ТЧ.Партия
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВТ.Номенклатура КАК Номенклатура,
	                |	ВТ.Количество КАК Количество,
	                |	ВТ.Партия КАК Партия,
	                |	ВТ.Партия.Док КАК ПартияДок,
	                |	ВТ.Партия.Док.Ссылка.ВКД_Инвойс КАК Инвойс,
	                |	ВТ.Партия.Док.Поставка КАК Поставка
	                |ПОМЕСТИТЬ ИСХ
	                |ИЗ
	                |	ВТ КАК ВТ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ разрешенные
	                |	ЗатратыАВБ.Номенклатура КАК Номенклатура,
	                |	ЗатратыАВБ.Валюта КАК Валюта,
	                |	СРЕДНЕЕ(ЗатратыАВБ.Сумма) КАК Сумма
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Затраты.Регистратор КАК Регистратор,
	                |		Затраты.Источник КАК Источник,
	                |		Затраты.Номенклатура КАК Номенклатура,
	                |		Затраты.Инвойс КАК Инвойс,
	                |		Затраты.Поставка КАК Поставка,
	                |		Затраты.Валюта КАК Валюта,
	                |		Затраты.Сумма КАК Сумма
	                |	ИЗ
	                |		РегистрСведений.Затраты КАК Затраты
	                |	ГДЕ
	                |		Затраты.Источник ССЫЛКА Документ.ОтправкаAWB
	                |		И (Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка) В
	                |				(ВЫБРАТЬ
	                |					ИСХ.Номенклатура,
	                |					ИСХ.Инвойс,
	                |					ИСХ.Поставка
	                |				ИЗ
	                |					ИСХ КАК ИСХ)) КАК ЗатратыАВБ
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗатратыАВБ.Номенклатура,
	                |	ЗатратыАВБ.Валюта
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ разрешенные
	                |	ЗатратыАВБ.Номенклатура КАК Номенклатура,
	                |	ЗатратыАВБ.Валюта КАК Валюта,
	                |	СРЕДНЕЕ(ЗатратыАВБ.Сумма) КАК Сумма
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		Затраты.Регистратор КАК Регистратор,
	                |		Затраты.Источник КАК Источник,
	                |		Затраты.Номенклатура КАК Номенклатура,
	                |		Затраты.Инвойс КАК Инвойс,
	                |		Затраты.Поставка КАК Поставка,
	                |		Затраты.Валюта КАК Валюта,
	                |		Затраты.Сумма КАК Сумма
	                |	ИЗ
	                |		РегистрСведений.Затраты КАК Затраты
	                |	ГДЕ
	                |		Затраты.Источник ССЫЛКА Документ._Инвойс
	                |		И (Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка) В
	                |				(ВЫБРАТЬ
	                |					ИСХ.Номенклатура,
	                |					ИСХ.Инвойс,
	                |					ИСХ.Поставка
	                |				ИЗ
	                |					ИСХ КАК ИСХ)) КАК ЗатратыАВБ
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗатратыАВБ.Номенклатура,
	                |	ЗатратыАВБ.Валюта";   
	Пакет = ЗапрИнв.ВыполнитьПакет();
	ВыборкаАВБ = Пакет[2].Выбрать();
	Пока ВыборкаАВБ.Следующий() Цикл 
		Если Номенклатура = Неопределено Тогда
			СтрокаТЧ = Объект.ЗатратыДоп.Добавить();  
			СтрокаТЧ.Номенклатура 	= ВыборкаАВБ.Номенклатура; 
			СтрокаТЧ.Цена	 		= ВыборкаАВБ.Сумма;
			//СтрокаТЧ.Сумма	 		= ВыборкаАВБ.Сумма * СтрокаТЧ.Количество;  
			СтрокаТЧ.Вид 			= Перечисления.РегистраторыЗатрат.ОтправкаAWB; 
		ИначеЕсли Номенклатура = ВыборкаАВБ.Номенклатура Тогда  
			ТекстСообщения = ТекстСообщения + СтрШаблон("Отправка AWB: цена %1%2", ВыборкаАВБ.Сумма, Символы.ПС);
			//+++
			//ЗапрИнфо = Новый Запрос;
			//Запр.Текст = "ВЫБРАТЬ
			//             |	Затраты.Источник КАК Источник
			//             |ИЗ
			//             |	РегистрСведений.Затраты КАК Затраты";
			//ЗапрИнфо.УстановитьПараметр("Номенклатура", Номенклатура);
			//ЗапрИнфо.УстановитьПараметр("", );  
			//+++
		КонецЕсли;
	КонецЦикла;
	ВыборкаИнв = Пакет[3].Выбрать();
	Пока ВыборкаИнв.Следующий() Цикл
		Если Номенклатура = Неопределено Тогда
			СтрокаТЧ = Объект.ЗатратыДоп.Добавить();  
			СтрокаТЧ.Номенклатура 	= ВыборкаИнв.Номенклатура; 
			СтрокаТЧ.Цена	 		= ВыборкаИнв.Сумма;
			//СтрокаТЧ.Сумма	 		= ВыборкаИнв.Сумма * СтрокаТЧ.Количество;  
			СтрокаТЧ.Вид 			= Перечисления.РегистраторыЗатрат.Инвойс;
		ИначеЕсли Номенклатура = ВыборкаИнв.Номенклатура Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон("Инвойс: цена %1%2", ВыборкаИнв.Сумма, Символы.ПС);	
		КонецЕсли;
	КонецЦикла;
	
	 // 3. Итого 
	 
	////ТГПеревозчика = НоменклатураТоварныхГруппПеревозчика(Объект.Перевозчик);
	Если Номенклатура = Неопределено Тогда  
		
		Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
			Если СтрокаТЧ.Номенклатура.УчетПоСериям Тогда
				//СтрокаТЧ.Цена = (СтрокаТЧ.Сумма + СтрокаТЧ.СуммаAWB + СтрокаТЧ.СуммаИнвойс) / СтрокаТЧ.Количество; 
				СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество; 
			Иначе
				//Сообщить(СтрШаблон("стр.%1 %2 == %3", СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура, СоотвКолБезСерий.Получить(СтрокаТЧ.Номенклатура)));
				СтрокаТЧ.Цена = СтрокаТЧ.Сумма / СоотвКолБезСерий.Получить(СтрокаТЧ.Номенклатура); 
			КонецЕсли;
			////Если ТГПеревозчика.Количество() > 0 Тогда
			////	СтрокаТЧ.ТоварнаяГруппаПеревозчика = ТГПеревозчика.Получить(СтрокаТЧ.Номенклатура);
			////КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьДеревоЗначенийНаСервере();
		
	КонецЕсли; 

	//УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	//Если Элементы.Найти("Затраты") = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;	
	//	
	//УО = ЭтаФорма.УсловноеОформление; 
	//УО.Элементы.Очистить(); 
	//ЭлементУО = УО.Элементы.Добавить(); 
	//
	//	Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//	Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыТоварнаяГруппа.Имя);
	//	Оформляемоеполе.Использование = ИСТИНА;  
	//
	//Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыЗатрата.Имя);
	//Оформляемоеполе.Использование = ИСТИНА;  
	//
	//Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить();   
	//Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗатратыСумма.Имя);
	//Оформляемоеполе.Использование = ИСТИНА;  
	//
	//ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловия.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных("Объект.Затраты.ТоварнаяГруппа");
	//ЭлементУсловия.ПравоеЗначение = КэшДанных.СписокРаспределенныхЗатрат;
	//ЭлементУсловия.ВидСравнения    = ВидСравненияКомпоновкиДанных.НеВСписке;   
	//ЭлементУсловия.Использование   = Истина;    
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный); 

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатраты(Команда)  
	
	Ошибки = Новый СписокЗначений;
	Если Объект.Затраты.Количество() = 0 Тогда
		//Ошибки.Добавить(НСтр("ru = 'Нет затрат для распределения!'; en = 'No cost for allocation!'"));  
		// заполним товарные группы
		//ЗаполнитьЗатратыПоУмолчанию();
	Иначе
		Для каждого СтрокаТЧ Из Объект.Затраты Цикл
			//Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТоварнаяГруппа) И ЗначениеЗаполнено(СтрокаТЧ.Вес) Тогда
			//	Ошибки.Добавить(СтрШаблон("Строка %1: вес брутто д.быть заполнен только для товарной группы", СтрокаТЧ.НомерСтроки)); 
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Ошибки.Количество() > 0 Тогда
	    Для каждого Эл Из Ошибки Цикл
			Сообщить(Эл.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	//Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
	// 	Если НЕ клДаНет(НСтр("ru = 'Табличная часть ''Распределение затрат'' будет перезаполнена. Продолжить?'; en = 'The ''Cost Allocation'' table part will be refilled. Continue?'")) Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;      
	//Если Модифицированность Тогда
	// 	Если НЕ клДаНет(НСтр("ru = 'Документ будет записан. Продолжить?'; en = 'The document will be saved. Continue?'")) Тогда
	//		Возврат;
	//	КонецЕсли; 
	//	Записать();
	//КонецЕсли;      
	//
	//РаспределитьЗатратыНаСервере(); 
	////ОбновитьРасчетныеКолонкиРаспределениеЗатрат();
	////КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	//Модифицированность = Истина;
	Если Объект.РаспределениеЗатрат.Количество() > 0 Тогда
		клДаНет(Новый ОписаниеОповещения("РаспределитьЗатратыПослеПроверкиРаспределения", ЭтотОбъект), 
			НСтр("ru = 'Табличная часть ''Распределение затрат'' будет перезаполнена. Продолжить?'; en = 'The ''Cost Allocation'' table part will be refilled. Continue?'"));
		Возврат;
	КонецЕсли;      
	
	РаспределитьЗатратыШаг2();
	
КонецПроцедуры
 &НаКлиенте
Процедура РаспределитьЗатратыПослеПроверкиРаспределения(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	РаспределитьЗатратыШаг2();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыШаг2()
	Если Модифицированность Тогда
		клДаНет(Новый ОписаниеОповещения("РаспределитьЗатратыПослеПроверкиЗаписи", ЭтотОбъект), 
			НСтр("ru = 'Документ будет записан. Продолжить?'; en = 'The document will be saved. Continue?'"));
		Возврат;
	КонецЕсли;      
	
	РаспределитьЗатратыШаг3();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыПослеПроверкиЗаписи(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Записать();
	РаспределитьЗатратыШаг3();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыШаг3()
	РаспределитьЗатратыНаСервере(); 
	//ОбновитьРасчетныеКолонкиРаспределениеЗатрат();
	//КэшДанных.Вставить("СписокРаспределенныхЗатрат", СписокРаспределенныхЗатрат());
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РаспределениеЗатратПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Данные = Элементы.Затраты.ТекущиеДанные; 	
		Данные.Затрата = гоКонстанта("НоменклатураУслугаДоставки");	
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ИнфоЗатрат(Номенклатура)
	
	Мас = Новый Массив;
	Запр = Новый Запрос;	
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
    Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	ОприходНоменклатуры.Документ КАК Документ,
                 |	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
                 |	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес,
                 |	ОприходНоменклатуры.Поставка
                 |ИЗ
                 |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
                 |ГДЕ
                 |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
                 |			(ВЫБРАТЬ
                 |				ИнвойсыОтправки.Инвойс,
                 |				ИнвойсыОтправки.Поставка
                 |			ИЗ
                 |				Документ.Отправка.Инвойсы КАК ИнвойсыОтправки
                 |			ГДЕ
                 |				ИнвойсыОтправки.Ссылка = &Ссылка)
                 |	И ОприходНоменклатуры.Номенклатура = &Номенклатура
                 |
                 |СГРУППИРОВАТЬ ПО
                 |	ОприходНоменклатуры.Документ,
                 |	ОприходНоменклатуры.Поставка
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	ОприходНоменклатуры.Документ.Дата" ;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Мас.Добавить(Новый Структура("Инвойс,Поставка,Количество,Вес", Выборка.Документ, Выборка.Поставка, Выборка.Количество, Выборка.Вес));	
	КонецЦикла;	
	Возврат Мас;
	
КонецФункции

&НаКлиенте
Процедура РаспределениеЗатратВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//мас = ИнфоЗатрат(Элемент.ТекущиеДанные.Номенклатура);
	//ТекстСообщения = СтрШаблон("%1 %2", НСтр("ru = 'Вхождения'; en = 'Entering'"), Элемент.ТекущиеДанные.Номенклатура); 
	//ТекстПояснения = "";
	//Для каждого эл Из Мас Цикл
	//	ТекстПояснения = ТекстПояснения + СтрШаблон(НСтр("ru = '%1 (%2):
	//												|к-во %3, 
	//												|вес %4 кг'; en = '%1 (%2): 
	//												|amnt. %3, 
	//												|weigth %4 kg'"), 
	//												эл.Инвойс, 
	//												?( эл.Поставка=0, НСтр("ru = 'целиком'; en = 'entirely'"), НСтр("ru = 'поставка '; en = 'delivivery '") + эл.Поставка ),
	//												эл.Количество, 
	//												эл.Вес) 
	//									+ Символы.ПС;
	//КонецЦикла;
	////клНамекнуть(ТекстСообщения, ТекстПояснения, БиблиотекаКартинок.Информация);
	//клПредупреждение(ТекстПояснения, , ТекстСообщения);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьРасчетныеКолонкиРаспределениеЗатрат()

//	Для каждого СтрокаТЧ Из Объект.РаспределениеЗатрат Цикл 
//		Если СтрокаТЧ.Количество = 0 Тогда
//			СтрокаТЧ.ЦенаОтправки 	= 0;
//			СтрокаТЧ.ЦенаAWB 		= 0; 
//			СтрокаТЧ.ЦенаИнвойс 	= 0;
//		Иначе	
//			СтрокаТЧ.ЦенаОтправки 	= СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
//			СтрокаТЧ.ЦенаAWB 		= СтрокаТЧ.СуммаAWB / СтрокаТЧ.Количество; 
//			СтрокаТЧ.ЦенаИнвойс 	= СтрокаТЧ.СуммаИнвойс / СтрокаТЧ.Количество;
//		КонецЕсли;
//	КонецЦикла;	

//КонецПроцедуры

#КонецОбласти


#Область Дерево

&НаСервере
Процедура ЗаполнитьДеревоЗначенийНаСервере()
	
	Дер = РеквизитФормыВЗначение("Дерево");
	Дер.Строки.Очистить(); 
	
	ТГПеревозчика = НоменклатураТоварныхГруппПеревозчика(Объект.Перевозчик);

	// 1
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Затрата КАК Затрата,
	             |	ТЗ.Количество КАК Количество,
	             |	ТЗ.Цена КАК Цена,
	             |	ТЗ.Вес КАК Вес,
	             |	ТЗ.Сумма КАК Сумма
	             |ПОМЕСТИТЬ ТЗ
	             |ИЗ
	             |	&ТЧ КАК ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ДляТЧРаспрЗатрат.Номенклатура КАК Номенклатура,
	             |	ДляТЧРаспрЗатрат.Затрата КАК Затрата,
	             |	ДляТЧРаспрЗатрат.Количество КАК Количество,
	             |	ДляТЧРаспрЗатрат.Цена КАК Цена,
	             |	ДляТЧРаспрЗатрат.Вес КАК Вес,
	             |	ДляТЧРаспрЗатрат.Сумма КАК Сумма
	             |ИЗ
	             |	ТЗ КАК ДляТЧРаспрЗатрат
	             |ИТОГИ
	             |	СРЕДНЕЕ(Количество),
	             |	СУММА(Цена),
	             |	СРЕДНЕЕ(Вес),
	             |	СУММА(Сумма)
	             |ПО
	             |	Номенклатура,
	             |	Затрата";
	Запр.УстановитьПараметр("ТЧ", Объект.РаспределениеЗатрат.Выгрузить());
  	ВыборкаН = Запр.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаН.Следующий() Цикл 
		СтрокаН = Дер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаН, ВыборкаН); 
		СтрокаН.ТоварнаяГруппаПеревозчика = ТГПеревозчика.Получить(СтрокаН.Номенклатура);
		ВыборкаЗ = ВыборкаН.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗ.Следующий() Цикл
			СтрокаЗ = СтрокаН.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗ, ВыборкаЗ, "Номенклатура,Затрата,Сумма");  
		КонецЦикла;
	КонецЦикла;
	
	// 2
	
	Для каждого СтрокаЗатратДоп Из Объект.ЗатратыДоп Цикл
		НайдСтроки = Дер.Строки.НайтиСтроки(Новый Структура("Номенклатура", СтрокаЗатратДоп.Номенклатура));	
		Если НайдСтроки.Количество() > 0 Тогда
			НайдСтрока = НайдСтроки[0];  
			Если СтрокаЗатратДоп.Вид = Перечисления.РегистраторыЗатрат.ОтправкаAWB Тогда
				НайдСтрока.ЦенаAWB = СтрокаЗатратДоп.Цена;
				НайдСтрока.СуммаAWB	= СтрокаЗатратДоп.Цена * НайдСтрока.Количество;
			ИначеЕсли СтрокаЗатратДоп.Вид = Перечисления.РегистраторыЗатрат.Инвойс Тогда
				НайдСтрока.ЦенаИнвойс = СтрокаЗатратДоп.Цена;
				НайдСтрока.СуммаИнвойс 	= СтрокаЗатратДоп.Цена * НайдСтрока.Количество;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаТЧ Из Дер.Строки Цикл
		СтрокаТЧ.ЦенаИтог = СтрокаТЧ.Цена + СтрокаТЧ.ЦенаAWB + СтрокаТЧ.ЦенаИнвойс;	
		СтрокаТЧ.ПометкаУдаления = СтрокаТЧ.Номенклатура.ПометкаУдаления;
	КонецЦикла;
	
	// 3
	
	ЗначениеВРеквизитФормы(Дер, "Дерево");
	
	Элементы.ДеревоНоменклатура.ТекстПодвала	= Дер.Строки.Количество();  
	Элементы.ДеревоКоличество.ТекстПодвала 		= Дер.Строки.Итог("Количество");
	Элементы.ДеревоСумма.ТекстПодвала 			= Формат(Дер.Строки.Итог("Сумма"), "ЧДЦ=4");
	Элементы.ДеревоВес.ТекстПодвала 			= Формат(Дер.Строки.Итог("Вес"), "ЧДЦ=3");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если Поле.Имя = "ДеревоНоменклатура" Тогда                                        
	//	СтандартнаяОбработка = Ложь;
	//	ОткрытьЗначение(Элемент.ТекущиеДанные.Номенклатура);   
	//КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ВхожденияНоменклатуры(Команда) 

	Данные = Элементы.Дерево.ТекущиеДанные; 
	Если Данные <> Неопределено Тогда 
		ТекстСообщения = "";
		РаспределитьЗатратыНаСервере(Данные.Номенклатура, ТекстСообщения); 
		Если ТекстСообщения <> "" Тогда 
			клПредупреждение(ТекстСообщения,, "Распред.затрат " + Данные.Номенклатура); 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
