#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриВходеВПрограмму        = Параметры.ПриВходеВПрограмму;
	ВернутьПарольБезУстановки = Параметры.ВернутьПарольБезУстановки;
	СтарыйПароль              = Параметры.СтарыйПароль;
	
	Если ВернутьПарольБезУстановки Или ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		//Пользователь = Пользователи.АвторизованныйПользователь();
		Пользователь = гоПользователь();
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	Если Не ВернутьПарольБезУстановки Тогда
		ДополнительныеПараметры.Вставить("ПроверятьДействительностьПользователя");
		ДополнительныеПараметры.Вставить("ПроверятьНаличиеПользователяИБ");
	КонецЕсли;
	//Если Не ПользователиСлужебный.ВозможноИзменитьПароль(Пользователь, ДополнительныеПараметры) Тогда
	//	ТекстОшибки = ДополнительныеПараметры.ТекстОшибки;
	//	Возврат;
	//КонецЕсли;
		
	//+  
	лПарольУстановлен = Ложь; 
	Если ЗначениеЗаполнено(Пользователь.ИдентификаторПользователяИБ) Тогда
		лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Пользователь.ИдентификаторПользователяИБ);		
	    лПарольУстановлен = лПользовательИБ.ПарольУстановлен;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ЭтоТекущийПользовательИБ", гоПользователь() = Пользователь);
	ДополнительныеПараметры.Вставить("ПарольУстановлен", лПарольУстановлен);
	//-

	Если Не ВернутьПарольБезУстановки Тогда
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Пользователь, , УникальныйИдентификатор);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Если Не ПриВходеВПрограмму Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось открыть форму смены пароля по причине:"
						""
						"%1';en='The password change form could not be opened due to:"
						""
						"%1'"),
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
				Возврат;
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
	Если ПриВходеВПрограмму Тогда
		Если ДополнительныеПараметры.ПарольУстановлен Тогда
			КлючНазначенияФормы = "СменаПароляПриВходеВПрограмму";
		Иначе
			КлючНазначенияФормы = "УстановкаПароляПриВходеВПрограмму";
			Элементы.ПояснениеПриВходе.Заголовок =
				НСтр("ru='Для входа в программу нужно установить пароль.';en='To enter the program you need to set a password.'")
		КонецЕсли;
	Иначе
		Если Не ДополнительныеПараметры.ПарольУстановлен Тогда
			КлючНазначенияФормы = "УстановкаПароля";
		КонецЕсли;
		Элементы.ПояснениеПриВходе.Видимость = Ложь;
		Элементы.ФормаЗакрытьФорму.Заголовок = НСтр("ru='Отмена';en='Cancel'");
	КонецЕсли;
	
	//ОбщегоНазначенияСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, КлючНазначенияФормы, , Ложь);
	ЭтотОбъект.КлючНазначенияИспользования = КлючНазначенияФормы;
	
	Если Не ДополнительныеПараметры.ЭтоТекущийПользовательИБ
	 Или Не ДополнительныеПараметры.ПарольУстановлен Тогда
		
		Элементы.СтарыйПароль.Видимость = Ложь;
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Установка пароля';en='Setting a password'");

	ИначеЕсли Параметры.СтарыйПароль <> Неопределено Тогда
		ТекущийЭлемент = Элементы.НовыйПароль;
	КонецЕсли;
	
	//Элементы.НовыйПароль.Подсказка  = ПользователиСлужебный.ПодсказкаДляНовогоПароля();
	//Элементы.НовыйПароль2.Подсказка = ПользователиСлужебный.ПодсказкаДляНовогоПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Отказ = Истина;
		//СтандартныеПодсистемыКлиент.УстановитьХранениеФормы(ЭтотОбъект, Истина);
		ПодключитьОбработчикОжидания("ПоказатьТекстОшибкиИСообщитьОЗакрытии", 0.1, Истина);
	Иначе
		ПроверитьПодтверждениеПароля();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПроверитьПодтверждениеПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ПроверитьПодтверждениеПароля(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНовыйПарольПриИзменении(Элемент)
	
	ПоказыватьНовыйПарольПриИзмененииНаСервере();
	ПроверитьПодтверждениеПароля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	Если Не ПоказыватьНовыйПароль И НовыйПароль <> Подтверждение Тогда
		ТекущийЭлемент = Элементы.Подтверждение;
		Элементы.Подтверждение.ВыделенныйТекст = Элементы.Подтверждение.ТекстРедактирования;
		ПоказатьПредупреждение(, НСтр("ru='Подтверждение пароля указано некорректно.';en='Password confirmation is incorrect.'"));
		Возврат;
	КонецЕсли;
	
	//Если Не ВернутьПарольБезУстановки
	//   И Не ЭтоТекущийПользовательИБ
	//   И СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().РазделениеВключено
	//   И ПарольПользователяСервиса = Неопределено Тогда
	//	
	//	ПользователиСлужебныйКлиент.ЗапроситьПарольДляАутентификацииВСервисе(
	//		Новый ОписаниеОповещения("УстановитьПарольЗавершение", ЭтотОбъект),
	//		ЭтотОбъект,
	//		ПарольПользователяСервиса);
	//Иначе
	//	УстановитьПарольЗавершение();
	//КонецЕсли;
	
	ТекстОшибки = УстановитьПарольНаСервере();
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Элементы.ФормаУстановитьПароль.Доступность = Ложь;
		ПодключитьОбработчикОжидания("ВернутьРезультатИЗакрытьФорму", 0.1, Истина);
	Иначе
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьТекстОшибкиИСообщитьОЗакрытии()
	
	//СтандартныеПодсистемыКлиент.УстановитьХранениеФормы(ЭтотОбъект, Ложь);
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения(
		"ПоказатьТекстОшибкиИСообщитьОЗакрытииЗавершение", ЭтотОбъект), ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекстОшибкиИСообщитьОЗакрытииЗавершение(Контекст) Экспорт
	
	Если ЭтотОбъект.ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ЭтотОбъект.ОписаниеОповещенияОЗакрытии);
		ЭтотОбъект.ОписаниеОповещенияОЗакрытии = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодтверждениеПароля(ПолеПароля = Неопределено)
	
	Если ПоказыватьНовыйПароль Тогда
		лПарольСовпадает = Истина;
	
	ИначеЕсли ПолеПароля = Элементы.НовыйПароль
	      Или ПолеПароля = Элементы.НовыйПароль2 Тогда
		
		лПарольСовпадает = (ПолеПароля.ТекстРедактирования = Подтверждение);
		
	ИначеЕсли ПолеПароля = Элементы.Подтверждение Тогда
		//лПарольСовпадает = (НовыйПароль = ПолеПароля.ТекстРедактирования);	
		Если НовыйПароль = ПолеПароля.ТекстРедактирования Тогда
			лПарольСовпадает = Истина;
		Иначе
			лПарольСовпадает = Ложь;
		КонецЕсли;;
	Иначе
		//лПарольСовпадает = (НовыйПароль = Подтверждение);
		Если НовыйПароль = Подтверждение Тогда
			лПарольСовпадает = Истина;
		Иначе
			лПарольСовпадает = Ложь;
		КонецЕсли;;
	КонецЕсли;
	
	Элементы.НадписьПарольНеСовпадает.Видимость = Не лПарольСовпадает;
	//Если лПарольСовпадает Тогда
	//	Элементы.НадписьПарольНеСовпадает.Заголовок = "";
	//Иначе
	//	Элементы.НадписьПарольНеСовпадает.Заголовок = "НЕ СОВПАД";
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьНовыйПарольПриИзмененииНаСервере()
	
	Элементы.Подтверждение.Доступность = Не ПоказыватьНовыйПароль;
	
	Элементы.НовыйПароль.Видимость  = Не ПоказыватьНовыйПароль;
	Элементы.НовыйПароль2.Видимость =    ПоказыватьНовыйПароль;
	
	Если ПоказыватьНовыйПароль Тогда
		Подтверждение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьПарольНаСервере()
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Пользователь",              Пользователь);
	ПараметрыВыполнения.Вставить("НовыйПароль",               НовыйПароль);
	ПараметрыВыполнения.Вставить("СтарыйПароль",              СтарыйПароль);
	ПараметрыВыполнения.Вставить("ПриВходеВПрограмму",        ПриВходеВПрограмму);
	//ПараметрыВыполнения.Вставить("ПарольПользователяСервиса", ПарольПользователяСервиса);
	ПараметрыВыполнения.Вставить("ТолькоПроверить",           ВернутьПарольБезУстановки);
	
	Попытка
		ТекстОшибки = ОбработатьНовыйПароль(ПараметрыВыполнения);
	Исключение
	//	ИнформацияОбОшибке = ИнформацияОбОшибке();
	//	Если ПараметрыВыполнения.Свойство("ОшибкаЗаписанаВЖурналРегистрации") Тогда
	//		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	//	Иначе
	//		ВызватьИсключение;
	//	КонецЕсли;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПараметрыВыполнения.СтарыйПарольСовпадает Тогда
		ТекущийЭлемент = Элементы.СтарыйПароль;
		СтарыйПароль = "";
	КонецЕсли;
	
	//ПарольПользователяСервиса = ПараметрыВыполнения.ПарольПользователяСервиса;
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаКлиенте
Процедура ВернутьРезультатИЗакрытьФорму()
	
	Результат = Новый Структура;
	Если ВернутьПарольБезУстановки Тогда
		Результат.Вставить("НовыйПароль",  НовыйПароль);
		Результат.Вставить("СтарыйПароль", ?(Элементы.СтарыйПароль.Видимость, СтарыйПароль, Неопределено));
	Иначе
		Результат.Вставить("УстановленПустойПароль", НовыйПароль = "");
	КонецЕсли;
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти


#Область МодульУНФ_ПользователиСлужебный	

// Для формы СменаПароля и перед записью пользователя ИБ.
// Выполняет проверку нового пароля, старого пароля и в случае успеха
// регистрирует новый пароль в списке использованных паролей,
// а также устанавливает его, если вызов выполнен из формы СменаПароля.
// 
// Параметры:
//  Параметры - Структура:
//   * Пользователь - СправочникСсылка.Пользователи
//                  - СправочникСсылка.ВнешниеПользователи - при вызове из формы СменаПароля.
//                  - СправочникОбъект.Пользователи
//                  - СправочникОбъект.ВнешниеПользователи - при записи объекта.
//
//   * НовыйПароль  - Строка - пароль, который планируется установить пользователю ИБ.
//   * СтарыйПароль - Строка - пароль, который установлен пользователю ИБ (для проверки).
//
//   * ПриВходеВПрограмму    - Булево - может быть Истина при вызове из формы СменаПароля.
//   * ТолькоПроверить       - Булево - может быть Истина при вызове из формы СменаПароля.
//   * СтарыйПарольСовпадает - Булево - возвращаемое значение. Если Ложь, значит не совпадает.
//
//   * ПарольПользователяСервиса - Строка - пароль текущего пользователя при вызове
//                                          из формы СменаПароля, сбрасывается при ошибке.
//
// Возвращаемое значение:
//  Строка - текст ошибки, если не пустая строка.
// 
&НаСервереБезКонтекста
Функция ОбработатьНовыйПароль(Параметры) 
	
	НовыйПароль  = Параметры.НовыйПароль;
	СтарыйПароль = Параметры.СтарыйПароль;
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторПользователяИБ, ПарольУстановлен, ЭтоТекущийПользовательИБ",
											Параметры.Пользователь.ИдентификаторПользователяИБ, 
											ЗначениеЗаполнено(НовыйПароль),
											Параметры.Пользователь.ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	Если ТипЗнч(Параметры.Пользователь) = Тип("СправочникОбъект.Пользователи") Тогда
		
		СсылкаОбъекта = Параметры.Пользователь.Ссылка;
		//Пользователь  = СсылкаОбъекта(Параметры.Пользователь); 
		Пользователь  = Параметры.Пользователь;
		ВызовИзФормыСменаПароля = Ложь;
		
		//Если ТипЗнч(Параметры.Пользователь) = Тип("СправочникОбъект.Пользователи")
		//   И Параметры.Пользователь.Служебный Тогда
		//	
		//	ДополнительныеПараметры.Вставить("ЭтоСлужебныйПользователь");
		//КонецЕсли;
	Иначе
		СсылкаОбъекта = Параметры.Пользователь;
		Пользователь  = Параметры.Пользователь;
		ВызовИзФормыСменаПароля = Истина;
	КонецЕсли;
	
	Параметры.Вставить("СтарыйПарольСовпадает", Ложь);
	
	//Если Не ВозможноИзменитьПароль(СсылкаОбъекта, ДополнительныеПараметры) Тогда
	//	Возврат ДополнительныеПараметры.ТекстОшибки;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДополнительныеПараметры.ЭтоТекущийПользовательИБ
	   И ДополнительныеПараметры.ПарольУстановлен
	   И (ВызовИзФормыСменаПароля Или СтарыйПароль <> Неопределено) Тогда
		
		Параметры.СтарыйПарольСовпадает = СтарыйПарольСовпадаетССохраненным(
			СтарыйПароль, ДополнительныеПараметры.ИдентификаторПользователяИБ);
		
		Если Не Параметры.СтарыйПарольСовпадает Тогда
			Возврат НСтр("ru='Старый пароль указан неверно.';en='The old password is incorrect.'");
		КонецЕсли;
	КонецЕсли;
	
	//Если ПользователиСлужебныйПовтИсп.Настройки().ОбщиеНастройкиВхода Тогда
	//	Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
	//		НастройкиВхода = ПользователиСлужебныйПовтИсп.Настройки().ВнешниеПользователи;
	//	Иначе
	//		НастройкиВхода = ПользователиСлужебныйПовтИсп.Настройки().Пользователи;
	//	КонецЕсли;
	//	ТекстОшибкиПароля = ОшибкаДлиныИлиСложностиПароля(НовыйПароль,
	//		НастройкиВхода.МинимальнаяДлинаПароля,
	//		НастройкиВхода.ПарольДолженОтвечатьТребованиямСложности);
	//Иначе
	//	ТекстОшибкиПароля = ОшибкаДлиныИлиСложностиПароля(НовыйПароль,
	//		ПолучитьМинимальнуюДлинуПаролейПользователей(),
	//		ПолучитьПроверкуСложностиПаролейПользователей());
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ТекстОшибкиПароля) Тогда
	//	Возврат ТекстОшибкиПароля;
	//КонецЕсли;
	
	ТекстОшибки = "";
	СохраняемоеЗначениеПароля = СохраняемоеЗначениеСтрокиПароля(НовыйПароль);
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить(Метаданные.НайтиПоТипу(ТипЗнч(Пользователь)).ПолноеИмя());
	//ЭлементБлокировки.УстановитьЗначение("Ссылка", Пользователь);
	//ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СведенияОПользователях");
	//ЭлементБлокировки.УстановитьЗначение("Пользователь", Пользователь);
	НачатьТранзакцию();
	Попытка
		//Блокировка.Заблокировать();
		//НаборЗаписей = РегистрыСведений.СведенияОПользователях.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		//НаборЗаписей.Прочитать();
		//Если НаборЗаписей.Количество() = 0 Тогда
		//	СведенияОПользователе = НаборЗаписей.Добавить();
		//	СведенияОПользователе.Пользователь = Пользователь;
		//Иначе
		//	СведенияОПользователе = НаборЗаписей[0];
		//КонецЕсли;
		//ИспользованныеПароли = СведенияОПользователе.ИспользованныеПароли.Получить();
		//Если ИспользованныеПароли = Неопределено Тогда
		//	ИспользованныеПароли = Новый Массив;
		//КонецЕсли;
		
		//Если ПользователиСлужебныйПовтИсп.Настройки().ОбщиеНастройкиВхода
		//   И ЗначениеЗаполнено(НастройкиВхода.ЗапретитьПовторениеПароляСредиПоследних)
		//   И НовыйПарольИспользовалсяРанее(ИспользованныеПароли, СохраняемоеЗначениеПароля) Тогда
		//	
		//	ТекстОшибки = НСтр("ru='Новый пароль использовался ранее.';uk='Новий пароль використовувався раніше.'");
		//	
		//Иначе
			
		Если Не (ВызовИзФормыСменаПароля И Параметры.ТолькоПроверить) Тогда
			
			Если ВызовИзФормыСменаПароля Тогда
				ОписаниеПользователяИБ = Новый Структура;
				ОписаниеПользователяИБ.Вставить("Действие", "Записать");
				ОписаниеПользователяИБ.Вставить("Пароль", НовыйПароль);
				
				ТекущийОбъект = Пользователь.ПолучитьОбъект();
				ТекущийОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ",
					ОписаниеПользователяИБ);
				
				Если Параметры.ПриВходеВПрограмму Тогда
					ТекущийОбъект.ДополнительныеСвойства.Вставить("СменаПароляПриВходеВПрограмму");
				КонецЕсли;
				//Если ОбщегоНазначения.РазделениеВключено() Тогда
				//	Если ДополнительныеПараметры.ЭтоТекущийПользовательИБ Тогда
				//		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса",
				//			СтарыйПароль);
				//	Иначе
				//		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПарольПользователяСервиса",
				//			Параметры.ПарольПользователяСервиса);
				//	КонецЕсли;
				//	ТекущийОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьССервисом", Истина);
				//КонецЕсли;
				Попытка
					ТекущийОбъект.Записать();
				Исключение
					//Параметры.ПарольПользователяСервиса = Неопределено;
					ВызватьИсключение;
				КонецПопытки;
			Иначе
				//СведенияОПользователе.ДатаНачалаИспользованияПароля = Неопределено;
				//Если Параметры.Пользователь.ДополнительныеСвойства.Свойство("СменаПароляПриВходеВПрограмму") Тогда
				//	СведенияОПользователе.ПотребоватьСменуПароляПриВходе = Ложь;
				//КонецЕсли;
				//Если ПользователиСлужебныйПовтИсп.Настройки().ОбщиеНастройкиВхода
				//   И ЗначениеЗаполнено(НастройкиВхода.ЗапретитьПовторениеПароляСредиПоследних) Тогда
				//
				//	ИспользованныеПароли.Добавить(СохраняемоеЗначениеПароля);
				//	Пока ИспользованныеПароли.Количество() > НастройкиВхода.ЗапретитьПовторениеПароляСредиПоследних Цикл
				//		ИспользованныеПароли.Удалить(0);
				//	КонецЦикла;
				//Иначе
				//	ИспользованныеПароли.Очистить();
				//КонецЕсли;
				//СведенияОПользователе.ИспользованныеПароли = Новый ХранилищеЗначения(ИспользованныеПароли);
				//НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
//		ИнформацияОбОшибке = ИнформацияОбОшибке();
//		Если ВызовИзФормыСменаПароля Тогда
//			ЗаписьЖурналаРегистрации(
//				НСтр("ru='Пользователи.Ошибка смены пароля';uk='Користувачі.Помилка зміни пароля'",
//				     ОбщегоНазначения.КодОсновногоЯзыка()),
//				УровеньЖурналаРегистрации.Ошибка,
//				Метаданные.НайтиПоТипу(ТипЗнч(Пользователь)),
//				Пользователь,
//				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru='Не удалось сменить пароль пользователя ""%1"" по причине:"
//"%2';uk='Не вдалося змінити пароль користувача ""%1"" через:"
//"%2'"),
//					Пользователь, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
//			Параметры.Вставить("ОшибкаЗаписанаВЖурналРегистрации");
//		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Сравнивает старый пароль с ранее сохраненным паролем
// для пользователя ИБ без учета контроля сложности пароля.
//
// Параметры:
//  Пароль                      - Строка - старый пароль, который нужно сравнить.
//
//  ИдентификаторПользователяИБ - УникальныйИдентификатор - пользователь ИБ для которого
//                                нужно проверить старый пароль.
//
// Возвращаемое значение:
//  Булево - Истина, если пароль совпадает без учета контроля сложности пароля.
//
&НаСервереБезКонтекста
Функция СтарыйПарольСовпадаетССохраненным(Пароль, ИдентификаторПользователяИБ) 
	
	Если ТипЗнч(ИдентификаторПользователяИБ) <> Тип("УникальныйИдентификатор") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ИдентификаторПользователяИБ);
	
	Если ТипЗнч(ПользовательИБ) <> Тип("ПользовательИнформационнойБазы") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ХешСуммаПароляСовпадает(СохраняемоеЗначениеСтрокиПароля(Пароль),
		ПользовательИБ.СохраняемоеЗначениеПароля);
	
КонецФункции

// Проверяет что у первого и второго паролей совпадают первые или вторые хеш-суммы.
//
// Параметры:
//  СохраняемоеЗначениеПервогоПароля - Строка - содержит хеш-суммы сохраняемого пароля в формате
//                                       одноименного свойства типа ПользовательИнформационнойБазы.
//
//  СохраняемоеЗначениеВторогоПароля - Строка - то же, что и СохраняемоеЗначениеВторогоПароля.
//
//
&НаСервереБезКонтекста
Функция ХешСуммаПароляСовпадает(СохраняемоеЗначениеПервогоПароля, СохраняемоеЗначениеВторогоПароля)
	
	Если СохраняемоеЗначениеПервогоПароля = СохраняемоеЗначениеВторогоПароля Тогда
		Возврат Истина;
	КонецЕсли;
	
	ХешСуммыПервогоПароля = ОбщегоНазначения.СтрРазделить(СохраняемоеЗначениеПервогоПароля, ",", Ложь);
	Если ХешСуммыПервогоПароля.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ХешСуммыВторогоПароля = ОбщегоНазначения.СтрРазделить(СохраняемоеЗначениеВторогоПароля, ",", Ложь);
	Если ХешСуммыВторогоПароля.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ХешСуммыПервогоПароля[0] = ХешСуммыВторогоПароля[0]
		Или ХешСуммыПервогоПароля[1] = ХешСуммыВторогоПароля[1];
	
КонецФункции

// Возвращает сохраняемое значение пароля для указанного пароля.
//
// Параметры:
//  Пароль    - Строка - пароль для которого нужно получить сохраняемое значение.
//  ДляЗаписи - Булево - если Истина, тогда для пустого пароля будет непустой результат.
//
// Возвращаемое значение:
//  Строка - сохраняемое значение пароля в формате свойства СохраняемоеЗначениеПароля
//           типа ПользовательИнформационнойБазы.
//
&НаСервереБезКонтекста
Функция СохраняемоеЗначениеСтрокиПароля(Пароль, ДляЗаписи = Ложь) 
	
	Если Пароль = "" И Не ДляЗаписи Тогда
		СохраняемоеЗначениеПароля = "";
	Иначе
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA1);
		ХешированиеДанных.Добавить(Пароль);
		
		СохраняемоеЗначениеПароля = Base64Строка(ХешированиеДанных.ХешСумма);
		
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA1);
		ХешированиеДанных.Добавить(ВРег(Пароль));
		
		СохраняемоеЗначениеПароля = СохраняемоеЗначениеПароля + ","
			+ Base64Строка(ХешированиеДанных.ХешСумма);
	КонецЕсли;
	
	Возврат СохраняемоеЗначениеПароля;
	
КонецФункции 

// Проверяет наличие учетной записи и прав, необходимых для изменения пароля.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//               - СправочникСсылка.ВнешниеПользователи - пользователь для смены пароля.
//
//  ДополнительныеПараметры - Структура - возвращаемое значение со свойствами:
//   * ТекстОшибки                 - Строка - описание ошибки, если нет возможности изменить пароль.
//   * ИдентификаторПользователяИБ - УникальныйИдентификатор - идентификатор пользователя ИБ.
//   * ЭтоТекущийПользовательИБ    - Булево - Истина, если пользователь является текущим.
//
// Возвращаемое значение:
//  Булево - Ложь, если нет возможности изменить пароль.
//
&НаСервереБезКонтекста
Функция ВозможноИзменитьПароль(Пользователь, ДополнительныеПараметры = Неопределено) 
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	//Если Не ДополнительныеПараметры.Свойство("ЭтоСлужебныйПользователь")
	//   И ОбщегоНазначения.РазделениеВключено()
	//   И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПользователиВМоделиСервиса") Тогда
	//	
	//	МодульПользователиСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("ПользователиСлужебныйВМоделиСервиса");
	//	ДействияСПользователемСервиса = МодульПользователиСлужебныйВМоделиСервиса.ПолучитьДействияСПользователемСервиса(
	//		Пользователь);
	//	
	//	Если Не ДействияСПользователемСервиса.ИзменениеПароля Тогда
	//		ДополнительныеПараметры.Вставить("ТекстОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//			НСтр("ru='Сервис: Недостаточно прав для изменения пароля пользователя ""%1"".';uk='Сервіс: Недостатньо прав для зміни пароля користувача ""%1"".'"), Пользователь));
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	//	Пользователь, "Ссылка, Недействителен, ИдентификаторПользователяИБ, Подготовлен");
	РеквизитыПользователя = Новый Структура("Ссылка, Недействителен, ИдентификаторПользователяИБ, Подготовлен",
										Пользователь.Ссылка, Пользователь.ПометкаУдаления, Пользователь.ИдентификаторПользователяИБ, Истина);
		
	Если РеквизитыПользователя.Ссылка <> Пользователь Тогда
		РеквизитыПользователя.Ссылка = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Пользователь).ПустаяСсылка();
		РеквизитыПользователя.Недействителен = Ложь;
		РеквизитыПользователя.Подготовлен = Ложь;
		РеквизитыПользователя.ИдентификаторПользователяИБ = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ПроверятьДействительностьПользователя")
	   И РеквизитыПользователя.Недействителен <> Ложь Тогда
		
		ДополнительныеПараметры.Вставить("ТекстОшибки", СтрШаблон(
			НСтр("ru='Пользователь ""%1"" недействителен (помечен на удаление).';en='User ""%1"" is out of use (marked as deleted).'"), Пользователь));
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторПользователяИБ = РеквизитыПользователя.ИдентификаторПользователяИБ;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДополнительныеПараметры.Свойство("ПроверятьНаличиеПользователяИБ")
	   И ПользовательИБ = Неопределено Тогда
		
		ДополнительныеПараметры.Вставить("ТекстОшибки", СтрШаблон(
			НСтр("ru = 'Не существует учетная запись пользователя ""%1"".';en='User account does not exist: ""%1"".'"), Пользователь));
		Возврат Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	
	ИдентификаторТекущегоПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	ДополнительныеПараметры.Вставить("ЭтоТекущийПользовательИБ", ИдентификаторПользователяИБ = ИдентификаторТекущегоПользователяИБ);
	
	//УровеньДоступа = УровеньДоступаКСвойствамПользователя(РеквизитыПользователя);
	
	//Если Не ДополнительныеПараметры.ЭтоТекущийПользовательИБ 
	//	И Не УровеньДоступа.НастройкиДляВхода Тогда
	//	
	//	ДополнительныеПараметры.Вставить("ТекстОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru='Недостаточно прав для изменения пароля пользователя ""%1"".';uk='Недостатньо прав для зміни пароля користувача ""%1"".'"), Пользователь));
	//	Возврат Ложь;
	//КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ПарольУстановлен",
		ПользовательИБ <> Неопределено И ПользовательИБ.ПарольУстановлен);
	
	Если ПользовательИБ <> Неопределено И ПользовательИБ.ЗапрещеноИзменятьПароль Тогда
//		Если УровеньДоступа.НастройкиДляВхода Тогда
//			Если ДополнительныеПараметры.Свойство("УчитыватьСвойствоЗапрещеноИзменятьПароль") Тогда
//				ДополнительныеПараметры.Вставить("ТекстОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//					НСтр("ru='Установлен запрет изменения пароля пользователя ""%1"".';uk='Встановлено заборону зміни пароля користувача ""%1"".'"), Пользователь));
//				Возврат Ложь;
//			КонецЕсли;
//		Иначе
//			ДополнительныеПараметры.Вставить("ТекстОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru='Установлен запрет изменения пароля пользователя ""%1""."
//"Обратитесь к администратору.';uk='Встановлено заборону зміни пароля користувача ""%1""."
//"Зверніться до адміністратора.'"), Пользователь));
//			Возврат Ложь;
//		КонецЕсли;
	КонецЕсли;
	
	//Если ДополнительныеПараметры.Свойство("УчитыватьСвойствоАутентификацияСтандартная")
	//   И ПользовательИБ <> Неопределено
	//   И Не ПользовательИБ.АутентификацияСтандартная Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	//// Проверка минимального срока действия пароля.
	//Если УровеньДоступа.НастройкиДляВхода Тогда
	//	Возврат Истина;
	//КонецЕсли;
	
	//Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
	//	НастройкиВхода = ПользователиСлужебныйПовтИсп.Настройки().ВнешниеПользователи;
	//Иначе
	//	НастройкиВхода = ПользователиСлужебныйПовтИсп.Настройки().Пользователи;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(НастройкиВхода.МинимальныйСрокДействияПароля) Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//УстановитьПривилегированныйРежим(Истина);
	//НаборЗаписей = РегистрыСведений.СведенияОПользователях.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	//НаборЗаписей.Прочитать();
	//УстановитьПривилегированныйРежим(Ложь);
	//
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//СведенияОПользователе = НаборЗаписей[0];
	//
	//Если Не ЗначениеЗаполнено(СведенияОПользователе.ДатаНачалаИспользованияПароля) Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//НачалоДняТекущейДатыСеанса = НачалоДня(ТекущаяДатаСеанса());
	//ОстатокМинимальногоСрокаДействияПароля = НастройкиВхода.МинимальныйСрокДействияПароля
	//	- (НачалоДняТекущейДатыСеанса - СведенияОПользователе.ДатаНачалаИспользованияПароля) / (24*60*60);
	//
	//Если ОстатокМинимальногоСрокаДействияПароля <= 0 Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//КоличествоДней = ОстатокМинимальногоСрокаДействияПароля;
	//
	//ЧислоИПредмет = Формат(КоличествоДней, "ЧГ=") + " "
	//	+ ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(КоличествоДней,
	//		"", НСтр("ru='день,дня,дней,,,,,,0';uk='день,дня,днів,,,,,,0'"));
	//
	//ДополнительныеПараметры.Вставить("ТекстОшибки", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	НСтр("ru='Пароль можно будет сменить только через %1.';uk='Пароль можна буде перемінити тільки через %1.'"), ЧислоИПредмет));
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
