// © Primus1C  01.07.2023  НАЧАЛО ►

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._Инвойс") Тогда
		
		ЗаполнитьПоИнвойсу(ДанныеЗаполнения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр _ВзаиморасчетыСПоставщиками Приход 
	Если Сумма <> Инвойс.Сумма Тогда
		Движения._ВзаиморасчетыСПоставщиками.Записывать = Истина;
		Движение = Движения._ВзаиморасчетыСПоставщиками.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Контрагент 	= Инвойс.Контрагент;
		Движение.Инвойс 		= Инвойс;
		Движение.Валюта 		= Инвойс.Валюта;
		Движение.СуммаОплаты 	= Сумма - Инвойс.Сумма;
	КонецЕсли;

	// регистр ВКД_ОприходованиеНоменклатуры Приход  
	Движения.ВКД_ОприходованиеНоменклатуры.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Товары Цикл   
		Если СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоДоКорректировки ИЛИ СтрокаТЧ.Сумма <> СтрокаТЧ.СуммаДоКорректировки Тогда
			Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Номенклатура 	= СтрокаТЧ.Номенклатура;
			Движение.Документ 		= Инвойс;
			Движение.Количество 	= СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоКорректировки;
			Движение.СуммаЗакупки 	= СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоКорректировки; 
			Движение.ЦенаЗакупки 	= СтрокаТЧ.Цена;
		КонецЕсли;
	КонецЦикла;
	
	// регистр СкорректированныеИнвойсы 
	ПоляСтруктуры = "Номенклатура,Количество,Сумма,ТипСтроки,НомерСтрокиИнвойса";
	Движения.СкорректированныеИнвойсы.Записывать = Истина;
	Движения.СкорректированныеИнвойсы.Очистить();
	Для Каждого СтрокаТЧ Из Товары Цикл
        ТипСтроки = ?(СтрокаТЧ.ТипСтроки = Перечисления.ТипыСтрокИнвойса.ВходитВИнвойс, 
						Перечисления.ТипыСтрокИнвойса.ВходитВИнвойс, 
						Перечисления.ТипыСтрокИнвойса.ДобавленаКорректировкой); 
		Если СтрокаТЧ.НоменклатураДоКорректировки = СтрокаТЧ.Номенклатура Тогда
			// изм. кол-ва/суммы
			Если СтрокаТЧ.КоличествоДоКорректировки = СтрокаТЧ.Количество И СтрокаТЧ.СуммаДоКорректировки = СтрокаТЧ.Сумма Тогда
			    Продолжить;
			КонецЕсли;
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
														СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество - СтрокаТЧ.КоличествоДоКорректировки,
			                                            СтрокаТЧ.Сумма - СтрокаТЧ.СуммаДоКорректировки,
			                                            ТипСтроки, 
														СтрокаТЧ.НомерСтроки));	
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.НоменклатураДоКорректировки) Тогда
			// изм. номенклатуры, возможно кол-ва/суммы
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.НоменклатураДоКорректировки,
														-СтрокаТЧ.КоличествоДоКорректировки,
			                                            -СтрокаТЧ.СуммаДоКорректировки,
			                                            ТипСтроки, 
														СтрокаТЧ.НомерСтроки));
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество,
			                                            СтрокаТЧ.Сумма,
			                                            ТипСтроки,
														СтрокаТЧ.НомерСтроки));	
		Иначе	
			// добавл. номенклатуры
			Если СтрокаТЧ.Количество = 0 И СтрокаТЧ.Сумма = 0 Тогда
			    Продолжить;
			КонецЕсли;
			ДобавитьДвижениеСкорректированныеИнвойсы(Новый Структура(ПоляСтруктуры,
			                                            СтрокаТЧ.Номенклатура,
														СтрокаТЧ.Количество,
			                                            СтрокаТЧ.Сумма,
			                                            Перечисления.ТипыСтрокИнвойса.ДобавленаКорректировкой,
														СтрокаТЧ.НомерСтроки));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьДвижениеСкорректированныеИнвойсы(ДанныеЗаписи)

	Движение = Движения.СкорректированныеИнвойсы.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ДанныеЗаписи); 
    Движение.Период = Дата;
	Движение.Инвойс = Инвойс;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Сумма = Товары.Итог("Сумма");
	Количество = Товары.Итог("Количество");
	
	Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры

Процедура ЗаполнитьПоИнвойсу(ДанныеЗаполнения) Экспорт
	
	Запр = Новый Запрос;   
	Запр.УстановитьПараметр("Инвойс", ДанныеЗаполнения);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.Номенклатура, ИнвойсТовары.Номенклатура) КАК НоменклатураДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.Номенклатура, ИнвойсТовары.Номенклатура) КАК Номенклатура,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.ТипСтроки, ЗНАЧЕНИЕ(Перечисление.ТипыСтрокИнвойса.ВходитВИнвойс)) КАК ТипСтроки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.КоличествоОборот, 0) КАК КоличествоДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.КоличествоОборот, 0) КАК Количество,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.СуммаОборот, 0) КАК СуммаДоКорректировки,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.СуммаОборот, 0) КАК Сумма,
	             |	ЕСТЬNULL(ВЫБОР
	             |			КОГДА СкоррИнвойсыОбороты.КоличествоОборот = 0
	             |				ТОГДА 0
	             |			ИНАЧЕ СкоррИнвойсыОбороты.СуммаОборот / СкоррИнвойсыОбороты.КоличествоОборот
	             |		КОНЕЦ, 0) КАК ЦенаДоКорректировки,
	             |	ЕСТЬNULL(ВЫБОР
	             |			КОГДА СкоррИнвойсыОбороты.КоличествоОборот = 0
	             |				ТОГДА 0
	             |			ИНАЧЕ СкоррИнвойсыОбороты.СуммаОборот / СкоррИнвойсыОбороты.КоличествоОборот
	             |		КОНЕЦ, 0) КАК Цена,
	             |	ЕСТЬNULL(СкоррИнвойсыОбороты.НомерСтрокиИнвойса, ИнвойсТовары.НомерСтроки) КАК НомерСтрокиИнвойса
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ИнвойсТовары.НомерСтроки КАК НомерСтроки,
	             |		ИнвойсТовары.Номенклатура КАК Номенклатура
	             |	ИЗ
	             |		Документ._Инвойс.ВКД_Товары КАК ИнвойсТовары
	             |	ГДЕ
	             |		ИнвойсТовары.Ссылка = &Инвойс) КАК ИнвойсТовары
	             |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.СкорректированныеИнвойсы.Обороты(, , , Инвойс = &Инвойс) КАК СкоррИнвойсыОбороты
	             |		ПО ИнвойсТовары.НомерСтроки = СкоррИнвойсыОбороты.НомерСтрокиИнвойса
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерСтрокиИнвойса"; 
	Выгрузка = Запр.Выполнить().Выгрузить();	
	Товары.Загрузить(Выгрузка);
    Инвойс = ДанныеЗаполнения;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄