Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Заказы товара";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента(Тек, Поз, Таб, Параметры = 0) Экспорт
	Таб.Очистить();
	
	М = Документы.ЗаказТовара.ПолучитьМакет("Печать" + ?(Тек.Сумма = 0, "БезЦен", ""));
	С = Новый Структура;
	гоВставитьКучу(С, "Загол, ИмяПокупателя1, ИмяПокупателя2, ИмяПокупателя3, ИмяПоставщика1, ИмяПоставщика2, ИмяПоставщика3, ИмяПоставщика4, ИмяПоставщика5, ИмяПоставщика6");
	гоВставитьКучу(С, "ИмяСклада, ДопНомера, НомерПП, лНоменклатура, лЕИ, лКоличество, лЦена, лСумма, сКоличество, СтрСНДС");
	гоВставитьКучу(С, "лВалюта");
	
	С.Загол = "Заказ № " + Тек.Номер + " от " + гоДата(Тек.Дата);
	С.ИмяСклада = "";
	С.ИмяПоставщика1 = "";
	С.ИмяПоставщика2 = "";
	С.ИмяПоставщика3 = "";
	С.ИмяПоставщика4 = "";
	С.ИмяПоставщика5 = "";
	С.ИмяПоставщика6 = "";
	С.ИмяПокупателя1 = "";
	С.ИмяПокупателя2 = "";
	С.ИмяПокупателя3 = "";

	Если гоНПЗ(Тек.Контрагент) Тогда
		С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.ПолнНаименование);
		Если С.ИмяПоставщика1 = "" Тогда С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.Наименование) КонецЕсли;
	КонецЕсли;
	
	Если гоНПЗ(Тек.Фирма) Тогда
		С.ИмяПокупателя1 = СокрЛП(Тек.Фирма.ПолнНаименование);
	КонецЕсли;
	
	Фикс = 4;
	глВывестиСекцию(Таб, М, "ШапкаП1", С); гоПлюс(Фикс);
	Если С.ИмяПоставщика2 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика3 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП3", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика4 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП4", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика5 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП5", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика6 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП6", С); гоПлюс(Фикс); КонецЕсли;
	глВывестиСекцию(Таб, М, "ШапкаК1", С); гоПлюс(Фикс);
	Если С.ИмяПокупателя2 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаК2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПокупателя3 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаК3", С); гоПлюс(Фикс); КонецЕсли;
	
	глВывестиСекцию(Таб, М, "Шапка", С);
	
	Табл = Тек.Товары.Выгрузить();
	Если Тек.Сумма = 0 Тогда 
		Табл.Свернуть("Номенклатура", "Количество");
	Иначе 
		Табл.Свернуть("Номенклатура, ЦенаЗакупки", "Количество, СуммаЗакупки");
	КонецЕсли; 
	
	С.лВалюта = СокрЛП(Тек.Валюта);
	
	ЧислоЗнаковЦена = Тек.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	НомерПП = 0;
	Для Каждого _Табл Из Табл Цикл
		гоПлюс(НомерПП);
		
		С.лНоменклатура = гоИмя(_Табл.Номенклатура, Ложь);
		С.НомерПП = НомерПП;
		С.лЕИ = "шт.";
		С.лКоличество = _Табл.Количество;
		
		Если Тек.Сумма = 0 Тогда 
			С.лЦена = "";
			С.лСумма = "";
		Иначе 
			С.лЦена = гоСуммаЗн(_Табл.ЦенаЗакупки, ЧислоЗнаковЦена);
			С.лСумма = гоЦена2(_Табл.СуммаЗакупки);
		КонецЕсли; 
		
		глВывестиСекцию(Таб, М, "Строка", С);
	КонецЦикла;
	
	С.лКоличество = Табл.Итог("Количество");
	С.лСумма = гоЦена2(Тек.Сумма);
	С.СтрСНДС = гоСуммаПрописьюВал(Тек.Сумма, Тек.Валюта);
		
	глВывестиСекцию(Таб, М, "Подвал", С);
	
	глПараметрыСтраницы(Таб, 1);
	глПовторятьПриПечатиСтроки(Таб, Фикс, Фикс);
КонецПроцедуры
