&НаКлиенте
Процедура МояСформировать(Команда)
	клПроверитьУстановитьПараметрОтчета(Отчет, "ВалютаПересчета", гоРеквизит(гоФирма(), "Валюта"));
	//ВКД++
	Если гоМенеджер() и не ВКД_ПроверитьДоступностьРоли() Тогда
		ПоказатьПредупреждение(Неопределено, "Отчет по продажам Вам не доступен. Недостаточно прав для просмотра! Обратитесь к руководству компании и системному администратору.",10,"Внимание")
	КонецЕсли;
	Если НЕ ВКД_ПроверитьДоступностьРоли()Тогда
		Если ЭтаФорма.КлючТекущегоВарианта <> "НоменклатураПоМесяцам" Тогда 
			ПоказатьПредупреждение(Неопределено, "Вам доступен только вариант отчета ""НоменклатураПоМесяцам"", №04 в списке вариантов . Выберите разрешенный вариант или обратитесь руководству компании и системному администратору!",,"Внимание!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//ВКД--		
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто); 
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	МасАвт = Новый Массив;
	Если гоПользователь().НеВидетьЧужиеПродажиВОтчете Тогда МасАвт.Добавить(гоПользователь()) КонецЕсли;
	
	ЭтаФорма.Заголовок  = СтрШаблон("%1 (%2)", РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, ЭтотОбъект.ПредставлениеТекущегоВарианта);

	Если МасАвт.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Авторы", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Авторы", МасАвт);
	КонецЕсли; 
	
	//2017.03.20
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", Мас);
	КонецЕсли; 
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаСервере
Функция ВКД_ПроверитьДоступностьРоли()
	// © Primus1C  28.10.2023  НАЧАЛО ►
	//Возврат РольДоступна("МенеджерДоп");
	Возврат Истина;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецФункции






