
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка =  Ложь;
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если НЕ ПараметрПериод = Неопределено Тогда
		Идентификатор = ПараметрПериод.ИдентификаторПользовательскойНастройки;
		ПараметрПериод = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		Если НЕ ПараметрПериод = Неопределено Тогда
			ПараметрПериод.Значение = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
