// © Primus1C  25.06.2023  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	//Если Оплаты.Количество() = 0 Тогда
	//	ДатаОплаты = Дата(1,1,1);	
	//Иначе	
	//    ДатаОплаты = Оплаты[0].Дата;
	//КонецЕсли;
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПлатежныйКалендарьЗакупки.Записывать = Истина; 
	
	Движение = Движения.ПлатежныйКалендарьЗакупки.ДобавитьПриход();  
	Движение.Период				= Дата;
    Движение.Контрагент 		= Контрагент; 
	Движение.Инвойс				= Ссылка;
	Движение.Сумма				= Сумма;
	Движение.Валюта				= Валюта;
	Движение.ДатаОплаты			= ДатаОплаты;
	Движение.ДатаПрибытия		= ДатаНаСкладеОтправителя; 
	лСумма = ?(Валюта=Оплаты[0].Валюта, Оплаты.Итог("Сумма"), СуммаОплатыВВалютеИнвойса);
	Если лСумма > 0 Тогда	
		Движение = Движения.ПлатежныйКалендарьЗакупки.ДобавитьРасход();  
		Движение.Период			= Дата;
		Движение.Контрагент 	= Контрагент; 
		Движение.Инвойс			= Ссылка;
		Движение.Сумма			= лСумма;
		Движение.Валюта			= Валюта;
		Движение.ДатаОплаты		= ДатаОплаты;
		Движение.ДатаПрибытия	= ДатаНаСкладеОтправителя; 
	КонецЕсли;
	//ОбщегоНазначенияСервер.ЗаписатьСостояниеИнвойса(Ссылка);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	//ОбщегоНазначенияСервер.ЗаписатьСостояниеИнвойса(Ссылка);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма 		= гоФирма();
	КемСоздан 	= гоПользователь(); 
	Создан 		= ТекущаяДатаСеанса(); 

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		РаботаСИнвойсами.ЗаписатьРасхожденияИнвойса(Ссылка);
	//КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
