#Область ДействияФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	//Если ЭтаФорма.Параметры.Свойство("ВыбраннаяНоменклатура") Тогда
		
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ВыбраннаяНоменклатура;
		
		//Отб.Представление = "Выбрано";
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора2.Значение); 
		
	//КонецЕсли; 

	Если ЭтаФорма.Параметры.Свойство("НеактуальнаяНоменклатура") Тогда
		
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ЭтаФорма.Параметры.НеактуальнаяНоменклатура;
		
		//Отб.Представление = "Неактуально";
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение); 
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти


#Область ДействияСписка

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отказ = Ложь;
	Если Поле.Имя = "Ссылка" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка); 
	Иначе
		Если Этаформа.Параметры.РежимВыбора Тогда 
			ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Ссылка, Отказ);
			Если НЕ Отказ Тогда
				Элемент.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(Ключ, Отказ)
	
	Если НеактуальнаяНоменклатура.НайтиПоЗначению(Ключ) <> Неопределено Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	ВыбраннаяНоменклатура.Добавить(Ключ);
	
	Для каждого ЭлементУО Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементУО.Представление = "Выбрано" Тогда
			Список.УсловноеОформление.Элементы.Удалить(ЭлементУО);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
	
	Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование 	= Истина;
	Отб.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	Отб.ВидСравнения  	= ВидСравненияКомпоновкиДанных.ВСписке;
	Отб.ПравоеЗначение 	= ВыбраннаяНоменклатура;
	Отб.Представление 	= "Выбрано";
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора2.Значение); 
	
КонецПроцедуры


#КонецОбласти
