
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗАполнено(Объект.Ссылка) ТОгда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПользователиДенежныеСчета.ДенежныйСчет
		|ИЗ
		|	Справочник.Пользователи.ДенежныеСчета КАК ПользователиДенежныеСчета
		|ГДЕ
		|	ПользователиДенежныеСчета.Ссылка = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПользователиДенежныеСчета.НомерСтроки";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.Касса = Выборка.ДенежныйСчет;
		КонецЕСли;
	КонецЕсли;
КонецПроцедуры
