&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
ОстаткиДС = СтрокаОстатков();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
ОстаткиДС = СтрокаОстатков();

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаОстатков()
		
	Табл = РегистрыНакопления.ВКД_ПоступлениеСписаниеДС.Остатки(,,"Валюта","Сумма");
	Если Табл.Количество() = 0 Тогда Возврат "" КонецЕсли; 
	
	Рез = "";
	Для Каждого стрТабл Из Табл Цикл
		гоРезСоо(Рез, гоСуммаЗнВал(стрТабл.Сумма, стрТабл.Валюта, 2), ",   ");
	КонецЦикла; 
	
	Возврат Рез;
	
КонецФункции


&НаКлиенте
Процедура Подробно(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
	ОткрытьФорму("Отчет.ВКД_ОстаткиПоБанку.Форма",ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

