&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Объект.Стр = Параметры.Стр;
	Исключение
		Объект.Стр = "Нужно вызывать форму, передавая параметр ""Стр""!";
	КонецПопытки;
	
	Попытка
		НаНет = Параметры.Нет;
	Исключение
		НаНет = Ложь;
	КонецПопытки;
	
	Если НаНет Тогда
		
		ЭтаФорма.Элементы.КомандаНет.АктивизироватьПоУмолчанию = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	ОповеститьОВыборе(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНет(Команда)
	ОповеститьОВыборе(Ложь);
КонецПроцедуры

