// © Primus1C  20.11.2023  НАЧАЛО ►

Процедура ПроверкаЗаполнения(Отказ)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧОтправкаИнвойсы.Инвойс КАК Инвойс,
	             |	ТЧОтправкаИнвойсы.Поставка КАК Поставка,
	             |	ТЧОтправкаИнвойсы.НомерСтроки КАК НомерСтроки,
	             |	РСОтправкаИнвойсов.Регистратор КАК Регистратор
	             |ИЗ
	             |	Документ.Отправка.Инвойсы КАК ТЧОтправкаИнвойсы
	             |		левое СОЕДИНЕНИЕ РегистрНакопления.ОтправкаИнвойсов КАК РСОтправкаИнвойсов
	             |		ПО ТЧОтправкаИнвойсы.Инвойс = РСОтправкаИнвойсов.Инвойс
	             |			И ТЧОтправкаИнвойсы.Поставка = РСОтправкаИнвойсов.Поставка
	             |ГДЕ
	             |	ТЧОтправкаИнвойсы.Ссылка = &Ссылка
	             |	И РСОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |	И РСОтправкаИнвойсов.Регистратор <> &Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерСтроки,
	             |	Инвойс,
	             |	Поставка";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;	
		Сообщить(стрШаблон(НСтр("ru = 'Строка %1: поставка найдена в документе %2!'; en = 'Line %1: delivery found in document %2!'"), Выборка.НомерСтроки, Выборка.Регистратор));
	КонецЦикла;
	
	Если Затраты.Количество() > 0 И НЕ ЗначениеЗаполнено(ВалютаЗатрат) Тогда
		Сообщить("Не заполнена валюта затрат");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры
		
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ПредыдущиеСтатусыИнвойсов = ПредыдущиеСтатусыИнвойсов(Инвойсы.ВыгрузитьКолонку("Инвойс"));
	
	Движения.ОтправкаИнвойсов.Записывать = Истина;
	Для Каждого ТекСтрокаИнвойсы Из Инвойсы Цикл  
		
		// регистр ОтправкаИнвойсов Расход
		Движение = Движения.ОтправкаИнвойсов.Добавить();
		Движение.Период 			= Дата;
		Движение.Инвойс 			= ТекСтрокаИнвойсы.Инвойс;
		Движение.Поставка 			= ТекСтрокаИнвойсы.Поставка;
		Движение.ОжидаемыеПоставки  = -1; 
		
		// РС СостоянияИнвойсов - 
		ПредСтатус = ПредыдущиеСтатусыИнвойсов.Получить(ТекСтрокаИнвойсы.Инвойс);
		Если ПредСтатус.Статус <> Перечисления.СтатусыИнвойса.Прибыл И ПредСтатус.Статус <> Перечисления.СтатусыИнвойса.ЧастичноПрибыл Тогда
			РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(ТекСтрокаИнвойсы.Инвойс, Перечисления.СтатусыИнвойса.ВПути, , , , , , , Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	// РС СостоянияИнвойсов - в случае изменения провдеденного док-та
	// 						установим пустыми статусы инвойсов, имеющие статус "ВПути", и удаленные из проведенной тек.отправки 
	УдаленныеИзОтправкиИнвойсы = ИнвойсыУдаленныеИзОтправки(); 
	Для каждого текИнвойс Из УдаленныеИзОтправкиИнвойсы Цикл
		Если текИнвойс.Статус = Перечисления.СтатусыИнвойса.ВПути Тогда
			Если текИнвойс.БылиОтправки Тогда
				// оставляем ВПути
			Иначе
				//ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.НеОтправлен, , , Ссылка); 
				РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.ПустаяСсылка(), , , , , , , Ссылка); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	
	// РС Затраты
	
	ВалютаДоллар = ПараметрыСеанса.БазоваяВалюта;
	НаборЗаписей = Движения.Затраты;    
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.Документ КАК Инвойс,
	             |	ОприходНоменклатуры.Поставка КАК Поставка,
	             |	РаспрЗатрат.Затрата КАК Затрата,
	             |	РаспрЗатрат.Количество КАК Количество,
	             |	РаспрЗатрат.Цена КАК Цена
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	             |			ОтправкаРаспределениеЗатрат.Затрата КАК Затрата,
	             |			ОтправкаРаспределениеЗатрат.Количество КАК Количество,
	             |			ОтправкаРаспределениеЗатрат.Цена КАК Цена
	             |		ИЗ
	             |			Документ.Отправка.РаспределениеЗатрат КАК ОтправкаРаспределениеЗатрат
	             |		ГДЕ
	             |			ОтправкаРаспределениеЗатрат.Ссылка = &Ссылка) КАК РаспрЗатрат
	             |		ПО ОприходНоменклатуры.Номенклатура = РаспрЗатрат.Номенклатура
	             |ГДЕ
	             |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
	             |			(ВЫБРАТЬ
	             |				ИнвойсыОтправки.Инвойс,
	             |				ИнвойсыОтправки.Поставка
	             |			ИЗ
	             |				Документ.Отправка.Инвойсы КАК ИнвойсыОтправки
	             |			ГДЕ
	             |				ИнвойсыОтправки.Ссылка = &Ссылка)
	             |	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
	             |	И РаспрЗатрат.Цена > 0
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОприходНоменклатуры.Номенклатура,
	             |	ОприходНоменклатуры.Документ,
	             |	ОприходНоменклатуры.Поставка,
	             |	РаспрЗатрат.Затрата,
	             |	РаспрЗатрат.Количество,
	             |	РаспрЗатрат.Цена";   
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		
	Иначе	
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовЗапись = НаборЗаписей.Добавить(); 
			НовЗапись.Период		= Дата;
			НовЗапись.Источник 		= Ссылка;
			НовЗапись.Номенклатура 	= Выборка.Номенклатура;
			НовЗапись.Затрата		= Выборка.Затрата;
			НовЗапись.Инвойс		= Выборка.Инвойс;
			НовЗапись.Поставка		= Выборка.Поставка;
			НовЗапись.Сумма 		= Выборка.Цена;
			НовЗапись.Количество 	= Выборка.Количество;
			НовЗапись.Валюта 		= ВалютаЗатрат; 
			НовЗапись.СуммаВБазВалюте  = РаботаСВалютой.Пересчитать2025(Выборка.Цена, ВалютаЗатрат, ВалютаДоллар, Фирма, Дата); 
			НовЗапись.Зарегистрировано = ТекущаяДата();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// РС СостоянияИнвойсов - установим пустыми статусы инвойсов, имеющие статус "ВПути", и записанные тек.отправкой (если не существует др.отправок таких инвойсов)
	
	 ИнвойсыТекущейПроведеннойОтправки = ИнвойсыТекущейПроведеннойОтправки();
	 Для каждого текИнвойс Из ИнвойсыТекущейПроведеннойОтправки Цикл
		Если текИнвойс.Статус = Перечисления.СтатусыИнвойса.ВПути И НЕ текИнвойс.БылиОтправки Тогда
			РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.ПустаяСсылка(), , , , , , , Ссылка); 
			//ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(текИнвойс.Инвойс, Перечисления.СтатусыИнвойса.НеОтправлен, , , Ссылка); 
		КонецЕсли;
	 КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗатраты = РаспределениеЗатрат.Количество() > 0;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(ВалютаЗатрат) Тогда
		ВалютаЗатрат = ПараметрыСеанса.БазоваяВалюта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 

КонецПроцедуры


Функция ИнвойсыТекущейПроведеннойОтправки()

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Регистратор", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |	СостоянияИнвойсов.Статус КАК Статус,
	             |	ВЫБОР
	             |		КОГДА ПредыдущиеОтправки.Инвойс ЕСТЬ NULL
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК БылиОтправки
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО ОтправкаИнвойсов.Инвойс = СостоянияИнвойсов.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |			МИНИМУМ(ОтправкаИнвойсов.Поставка) КАК Поставка
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |			И ОтправкаИнвойсов.Регистратор <> &Регистратор
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ПредыдущиеОтправки
	             |		ПО ОтправкаИнвойсов.Инвойс = ПредыдущиеОтправки.Инвойс
	             |			И ОтправкаИнвойсов.Поставка = ПредыдущиеОтправки.Поставка
	             |ГДЕ
	             |	ОтправкаИнвойсов.Регистратор = &Регистратор";
    Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка;

КонецФункции 

Функция ИнвойсыУдаленныеИзОтправки()

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Регистратор", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |	СостоянияИнвойсов.Статус КАК Статус,
	             |	ВЫБОР
	             |		КОГДА ПредыдущиеОтправки.Инвойс ЕСТЬ NULL
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК БылиОтправки
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО ОтправкаИнвойсов.Инвойс = СостоянияИнвойсов.Инвойс
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс КАК Инвойс,
	             |			МИНИМУМ(ОтправкаИнвойсов.Поставка) КАК Поставка
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |			И ОтправкаИнвойсов.Регистратор <> &Регистратор
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ПредыдущиеОтправки
	             |		ПО ОтправкаИнвойсов.Инвойс = ПредыдущиеОтправки.Инвойс
	             |			И ОтправкаИнвойсов.Поставка = ПредыдущиеОтправки.Поставка
	             |ГДЕ
	             |	ОтправкаИнвойсов.Регистратор = &Регистратор
	             |	И НЕ ОтправкаИнвойсов.Инвойс В
	             |				(ВЫБРАТЬ
	             |					ТЧ.Инвойс
	             |				ИЗ
	             |					Документ.Отправка.Инвойсы КАК ТЧ
	             |				ГДЕ
	             |					ТЧ.Ссылка = &Регистратор)";
    Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка;

КонецФункции // УдаленныеИзОтправкиИнвойсы()

Функция ПредыдущиеСтатусыИнвойсов(Инвойсы) 
	
	Результат = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойсы", Инвойсы);
	Запр.Текст = "ВЫБРАТЬ
	             |	Инвойсы.Инвойс,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ОтправкиОприход.Оприходование, 0) = 0
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК ЕстьОприходование,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ОтправкиОприход.Отправки, 0) = 0
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ИСТИНА
	             |	КОНЕЦ КАК ЕстьОтправка,
	             |	СостоянияИнвойсов.Статус КАК Статус
	             |ИЗ
	             |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |		Инвойсы.Ссылка КАК Инвойс
	             |	ИЗ
	             |		Документ._Инвойс КАК Инвойсы
	             |	ГДЕ
	             |		Инвойсы.Ссылка В(&Инвойсы)) КАК Инвойсы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ КАК Инвойс,
	             |			СУММА(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток) КАК Оприходование,
	             |			0 КАК Отправки
	             |		ИЗ
	             |			РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки КАК ВКД_ОприходованиеНоменклатурыОстатки
	             |		ГДЕ
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ В(&Инвойсы)
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ВКД_ОприходованиеНоменклатурыОстатки.Документ
	             |		
	             |		ОБЪЕДИНИТЬ
	             |		
	             |		ВЫБРАТЬ
	             |			ОтправкаИнвойсов.Инвойс,
	             |			0,
	             |			СУММА(ОтправкаИнвойсов.ОжидаемыеПоставки)
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.ОжидаемыеПоставки < 0
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ОтправкаИнвойсов.Инвойс) КАК ОтправкиОприход
	             |		ПО (ОтправкиОприход.Инвойс = Инвойсы.Инвойс)
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |		ПО Инвойсы.Инвойс = СостоянияИнвойсов.Инвойс";
     Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	Результат.Вставить(Выборка.Инвойс, 
							Новый Структура("Статус, ЕстьОприходование, ЕстьОтправка",
											Выборка.Статус, Выборка.ЕстьОприходование, Выборка.ЕстьОтправка));
	 КонецЦикла;  
	 Возврат Результат; 
	 
КонецФункции 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма 		= гоФирма();
	КемСоздан 	= гоПользователь(); 
	Создан 		= ТекущаяДатаСеанса(); 
	ВалютаЗатрат = ПараметрыСеанса.БазоваяВалюта;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
