
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяЖурнала = "РасчетыПоКомиссии"; 
	ИмяДокумента = "ДвижениеДенег";
	
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхКасс();
	Если Мас.Количество() <> 0 Тогда 
		гоСтандартныйОтбор(Список, 2, Истина, Мас);
		СпиКас.ЗагрузитьЗначения(Мас);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	УстановитьФирму();
	УстановитьКассу();
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаСервере
Процедура УстановитьКассу(Принудительно = 0)
	Если НЕ (Принудительно = 0) Тогда ФильтрДСчет = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 1, ЗначениеЗаполнено(ФильтрДСчет), ФильтрДСчет);
	
	ПараметрыСеанса.ДСчет = ФильтрДСчет;
	
	Если СпиКас.Количество() <> 0 Тогда
		Если СпиКас.НайтиПоЗначению(ФильтрДСчет) = Неопределено Тогда ОстаткиПоСчету = "?"; Возврат; КонецЕсли; 
	КонецЕсли;
	
	//СтруктураОстатков = СтруктураОстатков(ФильтрДСчет); 
	//ОстаткиПоСчету = СтруктураОстатков.Строка; 
	//Элементы.ДекорацияОстаткиПоСчету.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураОстатков.ФмтСтрока)); 
	//Элементы.ОтчетПартииВалюты.Видимость = ФильтрДСчет.ВестиПартионныйУчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДСчетПриИзменении(Элемент)

	УстановитьКассу(); 
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);

КонецПроцедуры

