// Крылович С.Н. 2012-03-06 trim_@mail.ru анализ доступных ролей пользователей конфигурации информационной базы (тонкая форма, управляемое приложение)

Перем текущиеДанные Экспорт;
Перем кореньВнешниеДанные Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#Если Сервер или ТолстыйКлиентОбычноеПриложение Тогда
Процедура ВывестиОтчет(тДанные, ДокументРезультат, ДанныеРасшифровки = Неопределено) Экспорт
	
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	
	Результат = ДокументРезультат;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	// очистим результирующий табличный документ
	Результат.Очистить();
	
	// получим макет компоновки данных
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, );
	
	//заполнитьВнешнийНаборДанных(дрРоли, дрОсновныеОбъекты, Данные);
	
	//дополнитьВнешнимиДанными(Данные, ВнешнийНабор);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Данные", тДанные);
	
	// создадим и инициализируем процессор компоновки данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, );
	
	// если используем простой вывод
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
#КонецЕсли


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если не текущиеДанные = Неопределено Тогда
			тДанные = текущиеДанные.заполнитьДанные();
			
			вывестиОтчет(тДанные, текущиеДанные.ЭлементыФормы.Результат);
			
			Отказ = Истина;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

