&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Объект.Стр = Параметры.Стр;
	Исключение
		Объект.Стр = "Нужно вызывать форму, передавая параметр ""Стр""!";
	КонецПопытки;
	
	// © Primus1C  28.10.2023  НАЧАЛО ►
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
	Иначе
		Заголовок = "Предупреждение";
	КонецЕсли;	
	Таймаут = Параметры.Время;
	ЗаголовокДляТаймера = Заголовок; 
	Если Таймаут > 0 Тогда
		Заголовок = СтрШаблон("%1 (%2)", ЗаголовокДляТаймера, Таймаут);	
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры    


// © Primus1C  28.10.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Таймаут > 0 Тогда
		ПодключитьОбработчикОжидания("ОтобразитьТаймер", 1, Ложь); 
		ПодключитьОбработчикОжидания("ЗакрытиеФормыпоТаймеру", Таймаут, Истина); 
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура ОтобразитьТаймер()
	Таймаут = Макс(Таймаут-1, 0);
	Заголовок = СтрШаблон("%1 (%2)", ЗаголовокДляТаймера, Таймаут);	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПоТаймеру()
	Закрыть();	
КонецПроцедуры	

// © Primus1C  ОКОНЧАНИЕ ◄
