Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура("Инвентаризация,ИнвентаризацииДня", 
							НСтр("ru='Инвентаризация';en='Inventory'"),
							НСтр("ru='Инвентаризации за день';en='Inventories per day'")
							);		

КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт

	ТабДокумент.Очистить();
		Макет = Документы.Инвентаризация.ПолучитьМакет(ВариантПечатнойФормы);
	
	Если ВариантПечатнойФормы = "Инвентаризация" Тогда
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Ссылка", ДокСсылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		             |	СУММА(ИнвентаризацияТовары.Количество) КАК Количество
		             |ИЗ
		             |	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		             |ГДЕ
		             |	ИнвентаризацияТовары.Ссылка = &Ссылка
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ИнвентаризацияТовары.Номенклатура
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ИнвентаризацияСклады.Склад КАК Склад
		             |ИЗ
		             |	Документ.Инвентаризация.Склады КАК ИнвентаризацияСклады
		             |ГДЕ
		             |	ИнвентаризацияСклады.Ссылка = &Ссылка
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	Инв.Склад
		             |ИЗ
		             |	Документ.Инвентаризация КАК Инв
		             |ГДЕ
		             |	Инв.Ссылка = &Ссылка";  
		Пакет = Запр.ВыполнитьПакет();
		ВыборкаС = Пакет[1].Выбрать();
		СкладыПечати = "";
		Пока ВыборкаС.Следующий() Цикл
		 	СкладыПечати = СкладыПечати + ВыборкаС.Склад + "; ";	 	
		КонецЦикла;

		Шапка = Новый Структура("ПредставлениеДокумента, Склады", 
		   						ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка),
		                        СкладыПечати
								);
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
		
		ВыборкаТ =  Пакет[0].Выбрать();
		Пока ВыборкаТ.Следующий() Цикл
			глВывестиСекцию(ТабДокумент, Макет, "Строка", ВыборкаТ);
		КонецЦикла; 
		
		Дно = Новый Структура("КемСоздан", ДокСсылка.КемСоздан);
		глВывестиСекцию(ТабДокумент, Макет, "Дно", Дно);
		
	ИначеЕсли ВариантПечатнойФормы = "ИнвентаризацииДня" Тогда
	
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("ДатаНач", НачалоДня(ДокСсылка.Дата));
		Запр.УстановитьПараметр("ДатаКон", КонецДня(ДокСсылка.Дата));
		Запр.Текст = "ВЫБРАТЬ
		             |	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		             |	СУММА(ИнвентаризацияТовары.Количество) КАК Количество,
		             |	ИнвентаризацияТовары.Серия КАК Серия
		             |ИЗ
		             |	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		             |ГДЕ
		             |	ИнвентаризацияТовары.Ссылка.Проведен
		             |	И ИнвентаризацияТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		             |	И ИнвентаризацияТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.Пустаяссылка)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ИнвентаризацияТовары.Номенклатура,
		             |	ИнвентаризацияТовары.Серия
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Номенклатура,
		             |	Серия
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ИнвентаризацияСклады.Склад КАК Склад
		             |ИЗ
		             |	Документ.Инвентаризация.Склады КАК ИнвентаризацияСклады
		             |ГДЕ
		             |	ИнвентаризацияСклады.Ссылка.Проведен
		             |	И ИнвентаризацияСклады.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		             |	И ИнвентаризацияСклады.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		             |
		             |ОБЪЕДИНИТЬ
		             |
		             |ВЫБРАТЬ
		             |	Инв.Склад
		             |ИЗ
		             |	Документ.Инвентаризация КАК Инв
		             |ГДЕ
		             |	Инв.Ссылка.Проведен
		             |	И Инв.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.Пустаяссылка)
		             |	И Инв.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон";  
		Пакет = Запр.ВыполнитьПакет();
		ВыборкаС = Пакет[1].Выбрать();
		СкладыПечати = "";
		Пока ВыборкаС.Следующий() Цикл
		 	СкладыПечати = СкладыПечати + ВыборкаС.Склад + "; ";	 	
		КонецЦикла;

		Шапка = Новый Структура("ПредставлениеДокумента, Склады", 
		   						СтрШаблон("Инвентаризации за день %1", Формат(ДокСсылка.Дата,"ДФ=dd.MM.yyyy")),
		                        СкладыПечати
								);
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
		
		ВыборкаТ =  Пакет[0].Выбрать();
		Пока ВыборкаТ.Следующий() Цикл
			глВывестиСекцию(ТабДокумент, Макет, "Строка", ВыборкаТ);
		КонецЦикла; 
		
		//Дно = Новый Структура("КемСоздан", ДокСсылка.КемСоздан);
		//глВывестиСекцию(ТабДокумент, Макет, "Дно", Дно);

	Иначе
		
	КонецЕсли;
	
КонецПроцедуры	