
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СоздатьЭлементыФормыПользовательскихНастроек(Элементы.КомпоновщикНастроекПользовательскиеНастройки, РежимОтображенияНастроекКомпоновкиДанных.БыстрыйДоступ );
	
	
	////	Очищаем все созданные элементы с отборами, через удаление главной группы
	//Для Каждого Эл Из Элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы Цикл
	//	Элементы.Удалить(Эл);
	//КонецЦикла;
		
	//	Получаем настройки, смотрим количество настроек
	//Настройки = Список.КомпоновщикНастроек.ПолучитьНастройки();	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;	
	КоличествоОтборов = Настройки.Отбор.Элементы.Количество();
	
	//// Создаём главную группу
	//ПолеОтборы 		= ЭтаФорма.Элементы.Добавить("ПолеОтборы", Тип("ГруппаФормы"), Элементы.КомпоновщикНастроекПользовательскиеНастройки);
	//ПолеОтборы.Вид 	= ВидГруппыФормы.ОбычнаяГруппа;
	//ПолеОтборы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	////ПолеОтборы.ОтображатьЗаголовок = Ложь;
	//
	////	Разделяем главную группу на 2 подгруппы, чтобы хватало места всем отборам
	//ОтборыКолонка1 		= ЭтаФорма.Элементы.Добавить("ОтборыКолонка1", Тип("ГруппаФормы"), ПолеОтборы);
	//ОтборыКолонка1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ОтборыКолонка1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	////ОтборыКолонка1.ОтображатьЗаголовок 	= Ложь;
	//ОтборыКолонка1.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//
	//ОтборыКолонка2		= ЭтаФорма.Элементы.Добавить("ОтборыКолонка2", Тип("ГруппаФормы"), ПолеОтборы);
	//ОтборыКолонка2.Вид	= ВидГруппыФормы.ОбычнаяГруппа;
	//ОтборыКолонка2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	////ОтборыКолонка2.ОтображатьЗаголовок	= Ложь;
	//ОтборыКолонка2.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	//
	////	Разделяем имеющиеся отборы по колонкам, заполнение начнём с первой
	//НастроекНаКолонку = Окр(КоличествоОтборов/2, 0, РежимОкругления.Окр15как20);	
	//Колонка = ОтборыКолонка1;
	
	//	Начинаем добавлять настройки на форму
	НомерЭлемента = 1;
	Для каждого ЭлОтбора из Настройки.Отбор.Элементы Цикл
		
		////  Проверяем, не пора ли менять колонку
		//Если НомерЭлемента = НастроекНаКолонку Тогда
		//	Колонка = ОтборыКолонка2;	
		//КонецЕсли;
		
		//	Создаём группу под каждую настройку
		//ПолеГруппыОтбора = ЭтаФорма.Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент"+НомерЭлемента, Тип("ГруппаФормы"), Колонка);
		//ПолеГруппыОтбора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		//ПолеГруппыОтбора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//ПолеГруппыОтбора.ОтображатьЗаголовок = Ложь;
		//ПолеГруппыОтбора.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;  
		ПолеГруппыОтбора = Элементы.КомпоновщикНастроекПользовательскиеНастройки; 
		
		//	Создаём элементы с привязкой к настройкам компоновщика данных
		ПолеИспользование = ЭтаФорма.Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент"+НомерЭлемента+"Использование", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеИспользование.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеИспользование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		ПолеИспользование.Заголовок = ?(ЗначениеЗаполнено(ЭлОтбора.ПредставлениеПользовательскойНастройки), ЭлОтбора.ПредставлениеПользовательскойНастройки, ЭлОтбора.ЛевоеЗначение);
		ПолеИспользование.ПутьКДанным = "Отчет.КомпоновщикНастроек.ПользовательскиеНастройки["+НомерЭлемента+"].Использование";
		
		ПолеВидСравнения = ЭтаФорма.Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент"+НомерЭлемента+"ВидСравненияЭлементаОтбора", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеВидСравнения.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВидСравнения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеВидСравнения.РастягиватьПоГоризонтали = Ложь;
		ПолеВидСравнения.ПутьКДанным = "Отчет.КомпоновщикНастроек.ПользовательскиеНастройки["+НомерЭлемента+"].ВидСравнения";
				
		ПолеЗначение = ЭтаФорма.Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент"+НомерЭлемента+"Значение", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеЗначение.Вид = ВидПоляФормы.ПолеВвода;
		ПолеЗначение.ВыбиратьТип = Ложь;
		ПолеЗначение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеЗначение.ПутьКДанным = "Отчет.КомпоновщикНастроек.ПользовательскиеНастройки["+НомерЭлемента+"].Значение";
		ПолеЗначение.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить( Новый ПараметрВыбора("Отбор.Отправитель", Истина) );
		Элементы["КомпоновщикНастроекПользовательскиеНастройкиЭлемент"+1+"Значение"].ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
		НомерЭлемента = НомерЭлемента+1;
	КонецЦикла;

КонецПроцедуры
