&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоТовару = Справочники.Номенклатура.ПустаяСсылка();
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда
			ПоТовару = Параметры.Отбор.Номенклатура;
			//Элементы.ПоТовару.Видимость = Истина;
			Элементы.ФормаПоПартиям.Видимость = Истина; 
		КонецЕсли;       
		
		// © Primus1C  26.04.2024  НАЧАЛО ►     
		
    	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию; 

		Если Параметры.Отбор.Свойство("Склад") Тогда 
			Параметр = Настройки.ПараметрыДанных.Элементы.Найти("Склад");   
			Если Параметр <> Неопределено Тогда
				Параметр.Значение =  Параметры.Отбор.Склад;
				Параметр.Использование = Истина; 
			КонецЕсли;
		КонецЕсли; 
		
		Для каждого Эл Из Настройки.ПараметрыДанных.Элементы Цикл
			Если Строка(Эл.Параметр) = "Период" Тогда
				Если Параметры.Отбор.Свойство("ПериодОтчета") Тогда
					Эл.Значение = Параметры.Отбор.ПериодОтчета;
					Эл.Использование = Истина; 
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;

		// © Primus1C  ОКОНЧАНИЕ ◄  
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПартиям(Команда)   
	
	Отбор = Новый Структура("Номенклатура, Фирма", ПоТовару, гоФирма());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ОткрытьФорму("Отчет.ОборотыОднойНоменклатурыПоПартиям.Форма", ПараметрыФормы, ЭтаФорма, Истина, );  
	
КонецПроцедуры
