// © Primus1C  02.12.2023  НАЧАЛО ►

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Поля.Добавить("Наименование");
    Поля.Добавить("НаименованиеАнгл");
    
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    
	СтандартнаяОбработка = Ложь; 
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Язык = Неопределено Тогда
		Представление = Данные.Наименование;
	Иначе
		Если ПользователиИнформационнойБазы.ТекущийПользователь().Язык.КодЯзыка = "en" Тогда
			Представление = Данные.НаименованиеАнгл;
		Иначе
			Представление = Данные.Наименование;
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄