// © Primus1C  17.12.2024  НАЧАЛО ►    

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаЗатрат = Затраты.Итог("Сумма");
	ЕстьЗатраты = РаспределениеЗатрат.Количество() > 0; 
	
	//Запр = Новый Запрос;
	//Запр.Текст = "ВЫБРАТЬ
	//             |	СУММА(_ИнвойсВКД_Товары.Количество) КАК Количество
	//             |ИЗ
	//             |	Документ._Инвойс.ВКД_Товары КАК _ИнвойсВКД_Товары
	//             |ГДЕ
	//             |	_ИнвойсВКД_Товары.Ссылка В
	//             |			(ВЫБРАТЬ
	//             |				ОтправкаAWBИнвойсы.Инвойс КАК Инвойс , ОтправкаAWBИнвойсы.Поставка КАК Поставка
	//             |			ИЗ
	//             |				Документ.ОтправкаAWB.Инвойсы КАК ОтправкаAWBИнвойсы
	//             |			ГДЕ
	//             |				ОтправкаAWBИнвойсы.Ссылка = &Ссылка)";
	//Запр.УстановитьПараметр("Ссылка", Ссылка); 
	//Выборка = Запр.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Количество = Выборка.Количество;
	//Иначе
	//	Количество = 0;
	//КонецЕсли;
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма 		= гоФирма();
	КемСоздан 	= гоПользователь(); 
	Создан 		= ТекущаяДатаСеанса(); 
    ВалютаЗатрат= ПараметрыСеанса.БазоваяВалюта;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	// РС Затраты    
	
	ВалютаДоллар = ПараметрыСеанса.БазоваяВалюта;
    Фирма = ПараметрыСеанса.Фирма;
	
	//НаборЗаписей = Движения.Затраты;    
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	////Запр.Текст = "ВЫБРАТЬ
	////             |	свод.Номенклатура КАК Номенклатура,
	////             |	свод.Партия КАК Партия,
	////             |	СУММА(свод.Количество) КАК Количество,
	////             |	РаспрЗатрат.Количество КАК КоличествоЗатрат,
	////             |	РаспрЗатрат.Сумма КАК СуммаЗатрат
	////             |ИЗ
	////             |	(ВЫБРАТЬ
	////             |		РасходнаяНакладнаяТовары.Ссылка КАК Ссылка,
	////             |		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	////             |		РасходнаяНакладнаяТовары.Партия КАК Партия,
	////             |		РасходнаяНакладнаяТовары.Количество КАК Количество
	////             |	ИЗ
	////             |		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	////             |	ГДЕ
	////             |		РасходнаяНакладнаяТовары.Ссылка В
	////             |				(ВЫБРАТЬ
	////             |					документ.ОтправкаПеремещений.Перемещения.Перемещение
	////             |				ИЗ
	////             |					документ.ОтправкаПеремещений.Перемещения
	////             |				ГДЕ
	////             |					документ.ОтправкаПеремещений.Перемещения.Ссылка = &Ссылка)
	////             |	
	////             |	ОБЪЕДИНИТЬ
	////             |	
	////             |	ВЫБРАТЬ
	////             |		ПеремещениеТовары.Ссылка,
	////             |		ПеремещениеТовары.Номенклатура,
	////             |		ПеремещениеТовары.Партия,
	////             |		ПеремещениеТовары.Количество
	////             |	ИЗ
	////             |		Документ.Перемещение.Товары КАК ПеремещениеТовары
	////             |	ГДЕ
	////             |		ПеремещениеТовары.Ссылка В
	////             |				(ВЫБРАТЬ
	////             |					документ.ОтправкаПеремещений.Перемещения.Перемещение
	////             |				ИЗ
	////             |					документ.ОтправкаПеремещений.Перемещения
	////             |				ГДЕ
	////             |					документ.ОтправкаПеремещений.Перемещения.Ссылка = &Ссылка)) КАК свод
	////             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтправкаAWB.РаспределениеЗатрат КАК РаспрЗатрат
	////             |		ПО свод.Номенклатура = РаспрЗатрат.Номенклатура
	////             |			И свод.Ссылка = РаспрЗатрат.Ссылка
	////             |
	////             |СГРУППИРОВАТЬ ПО
	////             |	свод.Номенклатура,
	////             |	свод.Партия,
	////             |	РаспрЗатрат.Количество,
	////             |	РаспрЗатрат.Сумма"; 
	////Выборка = Запр.Выполнить().Выбрать();
	////Пока Выборка.Следующий() Цикл
	////	НовЗапись = НаборЗаписей.Добавить(); 
	////	НовЗапись.Период		= Дата;
	////	НовЗапись.Источник 		= Ссылка;
	////	НовЗапись.Номенклатура 	= Выборка.Номенклатура;	
	////	НовЗапись.Сумма 		= Выборка.СуммаЗатрат / Выборка.КоличествоЗатрат;
	////	НовЗапись.Валюта 		= ВалютаЗатрат;  
	////КонецЦикла;
	////НаборЗаписей.Записать(Истина);

	
	// в разработке
	//
	//Запр.Текст = "ВЫБРАТЬ
	//             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	//             |	СУММА(ОприходНоменклатуры.Количество) КАК Количество,
	//             |	СУММА(ОприходНоменклатуры.Количество * ОприходНоменклатуры.Номенклатура.Вес) / 1000 КАК Вес,
	//             |	ОприходНоменклатуры.Поставка КАК Поставка,
	//             |	ОприходНоменклатуры.Документ КАК Инвойс
	//             |ИЗ
	//             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
	//             |ГДЕ
	//             |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
	//             |			(ВЫБРАТЬ
	//             |				ИнвойсыОтправки.Инвойс,
	//             |				ИнвойсыОтправки.Поставка
	//             |			ИЗ
	//             |				Документ.ОтправкаAWB.Инвойсы КАК ИнвойсыОтправки
	//             |			ГДЕ
	//             |				ИнвойсыОтправки.Ссылка = &Ссылка)
	//             |	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
	//             |
	//             |СГРУППИРОВАТЬ ПО
	//             |	ОприходНоменклатуры.Номенклатура,
	//             |	ОприходНоменклатуры.Поставка,
	//             |	ОприходНоменклатуры.Документ" ;

	//Выборка = Запр.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НовЗапись = НаборЗаписей.Добавить(); 
	//	НовЗапись.Период		= Дата;
	//	НовЗапись.Источник 		= Ссылка;
	//	НовЗапись.Номенклатура 	= Выборка.Номенклатура;	
	//	НовЗапись.Инвойс		= Выборка.Инвойс;
	//	НовЗапись.Поставка		= Выборка.Поставка;
	//	НовЗапись.Сумма 		= Выборка.Цена;
	//	НовЗапись.Валюта 		= ВалютаЗатрат;  
	//КонецЦикла;
	//НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = Движения.Затраты;    
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.Поставка КАК Поставка,
	             |	ОприходНоменклатуры.Документ КАК Инвойс,
	             |	РаспрЗатрат.Затрата КАК Затрата,
	             |	РаспрЗатрат.Количество КАК Количество,
	             |	РаспрЗатрат.Цена КАК Цена
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ОприходНоменклатуры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	             |			ОтправкаРаспределениеЗатрат.Затрата КАК Затрата,
	             |			ОтправкаРаспределениеЗатрат.Количество КАК Количество,
	             |			ОтправкаРаспределениеЗатрат.Цена КАК Цена
	             |		ИЗ
	             |			Документ.ОтправкаAWB.РаспределениеЗатрат КАК ОтправкаРаспределениеЗатрат
	             |		ГДЕ
	             |			ОтправкаРаспределениеЗатрат.Ссылка = &Ссылка) КАК РаспрЗатрат
	             |		ПО ОприходНоменклатуры.Номенклатура = РаспрЗатрат.Номенклатура
	             |ГДЕ
	             |	(ОприходНоменклатуры.Документ, ОприходНоменклатуры.Поставка) В
	             |			(ВЫБРАТЬ
	             |				ИнвойсыОтправки.Инвойс,
	             |				ИнвойсыОтправки.Поставка
	             |			ИЗ
	             |				Документ.ОтправкаAWB.Инвойсы КАК ИнвойсыОтправки
	             |			ГДЕ
	             |				ИнвойсыОтправки.Ссылка = &Ссылка)
	             |	И ОприходНоменклатуры.Регистратор ССЫЛКА Документ._Инвойс
	             |	И РаспрЗатрат.Цена > 0
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОприходНоменклатуры.Номенклатура,
	             |	ОприходНоменклатуры.Документ,
	             |	ОприходНоменклатуры.Поставка,
	             |	РаспрЗатрат.Затрата,
	             |	РаспрЗатрат.Количество,
	             |	РаспрЗатрат.Цена"; 
	 РезультатЗапроса = Запр.Выполнить();
	 Если РезультатЗапроса.Пустой() Тогда
		 
		 НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		 НаборЗаписей.Записать(Истина);
		 
	 Иначе	
		 
		 Выборка = РезультатЗапроса.Выбрать();
		 Пока Выборка.Следующий() Цикл
			 НовЗапись = НаборЗаписей.Добавить(); 
			 НовЗапись.Период		= Дата;
			 НовЗапись.Источник 	= Ссылка;
			 НовЗапись.Номенклатура = Выборка.Номенклатура;	
			 НовЗапись.Затрата		= Выборка.Затрата;
			 НовЗапись.Инвойс		= Выборка.Инвойс;
			 НовЗапись.Поставка		= Выборка.Поставка;
			 НовЗапись.Количество 	= Выборка.Количество;
			 НовЗапись.Сумма 		= Выборка.Цена;
			 НовЗапись.Валюта 		= ВалютаЗатрат;  
			 НовЗапись.СуммаВБазВалюте  = РаботаСВалютой.Пересчитать2025(Выборка.Цена, ВалютаЗатрат, ВалютаДоллар, Фирма, Дата); 
			 НовЗапись.Зарегистрировано = ТекущаяДата();
		 КонецЦикла;
		 НаборЗаписей.Записать(Истина);
	 КонецЕсли;

КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Если Затраты.Количество() > 0 И НЕ ЗначениеЗаполнено(ВалютаЗатрат) Тогда
		Сообщить("Не заполнена валюта затрат");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄