Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Сообщить("Не заполнен вид операции");
		Отказ = Истина;
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из Товары Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Сообщить("Не заполнена номенклатура в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
			Сообщить("Не заполнена партия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			Сообщить("Не заполнена серия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		
		Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураНовая) Тогда
				Сообщить("Не заполнена новая номенклатура в строке " + СтрокаТЧ.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;	
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СерияНовая) Тогда
				Сообщить("Не заполнена новая серия в строке " + СтрокаТЧ.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли; 
		
	КонецЦикла;	

КонецПроцедуры
  
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьВозможностьПроведения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Рег.Партия КАК Партия,
		             |	Рег.Партия.Серия КАК Серия,
		             |	ТЧТовары.СерияНовая КАК СерияНовая,
		             |	isnull(Рег.ОстатокОстаток, 0) КАК Остаток,
		             |	ТЧТовары.Партия.Владелец КАК Номенклатура
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		Товары.Партия КАК Партия,
		             |		Товары.Серия КАК Серия,
		             |		Товары.СерияНовая КАК СерияНовая
		             |	ИЗ
		             |		Документ.ЗаменаСерий.Товары КАК Товары
		             |	ГДЕ
		             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
		             |		ПО ТЧТовары.Партия = Рег.Партия
		             |			И ТЧТовары.Серия = Рег.Партия.Серия";
		Выборка = Запр.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.Остаток <= 0 Тогда 
				Сообщить("Нет остатков серии " + Выборка.Серия);
			 	Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		НачатьТранзакцию();
		Попытка
			
			Если НЕ Отказ Тогда 
				Выборка.Сбросить();
				Пока Выборка.Следующий() Цикл	
					
					НовЗапись = Движения.Замены.Добавить();
					НовЗапись.Источник 			= Ссылка;
					НовЗапись.ОбъектЗамены 		= Выборка.Партия;
					НовЗапись.СтароеЗначение 	= Выборка.Серия;   
					НовЗапись.НовоеЗначение		= Выборка.СерияНовая;   
					НовЗапись.Автор				= гоПользователь();
					НовЗапись.Дата				= ТекущаяДатаСеанса();
					
					ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
					ПартияОбъект.Серия = Выборка.СерияНовая;
					Коммент = СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая);
					гоЗаписьЖурналаРегистрации(Коммент, , "Запись", Выборка.Партия, ); 
					ПартияОбъект.Записать();  
					
				КонецЦикла; 
				Если НЕ Отказ Тогда  
					Движения.Замены.Записать();
				КонецЕсли;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();  
			
		Исключение   
			
			Отказ = Истина;
		    ОтменитьТранзакцию();
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;

	Иначе // замена номенклатры
		
		Запр = Новый Запрос;		
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Партии.Ссылка КАК Партия,
		             |	Партии.Владелец КАК Номенклатура,
		             |	ЗаменаСерийТовары.НоменклатураНовая КАК НоменклатураНовая,
		             |	ЗаменаСерийТовары.Серия КАК Серия
		             |ПОМЕСТИТЬ ВТ_Партии
		             |ИЗ
		             |	Документ.ЗаменаСерий.Товары КАК ЗаменаСерийТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
		             |		ПО ЗаменаСерийТовары.Номенклатура = Партии.Владелец
		             |			И ЗаменаСерийТовары.Серия = Партии.Серия
		             |ГДЕ
		             |	(Партии.Владелец, Партии.Серия) В
		             |			(ВЫБРАТЬ
		             |				Товары.Номенклатура,
		             |				Товары.Серия КАК Серия
		             |			ИЗ
		             |				Документ.ЗаменаСерий.Товары КАК Товары
		             |			ГДЕ
		             |				Товары.Ссылка = &Ссылка)
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	Партии.Партия КАК Партия,
		             |	Партии.Номенклатура КАК Номенклатура,
		             |	Партии.НоменклатураНовая КАК НоменклатураНовая,
		             |	Партии.Серия КАК Серия
		             |ИЗ
		             |	ВТ_Партии КАК Партии
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ПН_Товары.Ссылка КАК Ссылка,
		             |	ПН_Товары.Серия КАК Серия
		             |ИЗ
		             |	Документ.ПриходнаяНакладная.Товары КАК ПН_Товары
		             |ГДЕ
		             |	ПН_Товары.Партия В
		             |			(ВЫБРАТЬ
		             |				ВТ_Партии.Партия
		             |			ИЗ
		             |				ВТ_Партии КАК ВТ_Партии)
		             |ИТОГИ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	П_Товары.Ссылка КАК Ссылка,
		             |	П_Товары.Серия КАК Серия
		             |ИЗ
		             |	Документ.Перемещение.Товары КАК П_Товары
		             |ГДЕ
		             |	П_Товары.Партия В
		             |			(ВЫБРАТЬ
		             |				ВТ_Партии.Партия
		             |			ИЗ
		             |				ВТ_Партии КАК ВТ_Партии)
		             |ИТОГИ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	РН_Товары.Ссылка КАК Ссылка,
		             |	РН_Товары.Серия КАК Серия
		             |ИЗ
		             |	Документ.РасходнаяНакладная.Товары КАК РН_Товары
		             |ГДЕ
		             |	РН_Товары.Партия В
		             |			(ВЫБРАТЬ
		             |				ВТ_Партии.Партия
		             |			ИЗ
		             |				ВТ_Партии КАК ВТ_Партии)
		             |ИТОГИ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	В_Товары.Ссылка КАК Ссылка,
		             |	В_Товары.Серия КАК Серия
		             |ИЗ
		             |	Документ._ВозвратОтПокупателя.Товары КАК В_Товары
		             |ГДЕ
		             |	В_Товары.Партия В
		             |			(ВЫБРАТЬ
		             |				ВТ_Партии.Партия
		             |			ИЗ
		             |				ВТ_Партии КАК ВТ_Партии)
		             |ИТОГИ ПО
		             |	Ссылка";
		Пакет = Запр.ВыполнитьПакет();
		
		ПараметрыСеанса.БезусловноеПроведениеДокументов = Истина; 
		НачатьТранзакцию();
		Попытка
		
			// партии
			
			Соотв = Новый Соответствие;
	        ВыборкаП = Пакет[1].Выбрать();
			Пока ВыборкаП.Следующий() Цикл
				
				Соотв.Вставить(ВыборкаП.Серия, ВыборкаП.НоменклатураНовая);
				НовЗапись = Движения.Замены.Добавить();
				НовЗапись.Источник 			= Ссылка;
				НовЗапись.ОбъектЗамены 		= ВыборкаП.Партия;
				НовЗапись.СтароеЗначение 	= ВыборкаП.Номенклатура;   
				НовЗапись.НовоеЗначение		= ВыборкаП.НоменклатураНовая;   
				НовЗапись.Автор				= гоПользователь();
				НовЗапись.Дата				= ТекущаяДатаСеанса();
				
				ПартияОбъект = ВыборкаП.Партия.ПолучитьОбъект(); 
				ПартияОбъект.Владелец = ВыборкаП.НоменклатураНовая;
				Коммент = СтрШаблон("Замена номенклатуры в партии %1: %2 -> %3", ВыборкаП.Партия, ВыборкаП.Номенклатура, ВыборкаП.НоменклатураНовая);
				гоЗаписьЖурналаРегистрации(Коммент, , "Запись", ВыборкаП.Партия, ); 
				ПартияОбъект.Записать();  
				
			КонецЦикла;
			
			// документы
			
			Для Инд = 2 По 5 Цикл
				
				ВыборкаДок = Пакет[Инд].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДок.Следующий() Цикл  
					
					ДокОбъект = ВыборкаДок.Ссылка.ПолучитьОбъект();          
					
					ВыборкаП = ВыборкаДок.Выбрать();
					Пока ВыборкаП.Следующий() Цикл
						
						НайдСтроки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Серия", ВыборкаП.Серия));
						Для каждого СтрокаТЧ Из НайдСтроки Цикл
							
							НовНоменклатура = Соотв.Получить(ВыборкаП.Серия);
							Коммент = СтрШаблон("Замена номенклатуры (строка %1) в партии %2: %3 -> %4", СтрокаТЧ.НомерСТроки, СтрокаТЧ.Партия, СтрокаТЧ.Номенклатура, НовНоменклатура);
							гоЗаписьЖурналаРегистрации(Коммент, , "Запись", ВыборкаДок.Ссылка, ); 
							
							НовЗапись = Движения.Замены.Добавить();
							НовЗапись.Источник 			= Ссылка;
							НовЗапись.ОбъектЗамены 		= ВыборкаДок.Ссылка;
							НовЗапись.СтароеЗначение 	= СтрокаТЧ.Номенклатура;   
							НовЗапись.НовоеЗначение		= НовНоменклатура;   
							НовЗапись.Автор				= гоПользователь();
							НовЗапись.Дата				= ТекущаяДатаСеанса();     
							НовЗапись.СтрокаТЧ 			= СтрокаТЧ.НомерСТроки;  
							
							СтрокаТЧ.Номенклатура = НовНоменклатура;
							
						КонецЦикла;	
					КонецЦикла;	
					
					Если ДокОбъект.Проведен Тогда
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;   
					
				КонецЦикла; 
				
			КонецЦикла;			

			Если НЕ Отказ Тогда
				Движения.Замены.Записать();
			КонецЕсли;
		
			ЗафиксироватьТранзакцию();  
			
		Исключение   
			
			Отказ = Истина;
		    ОтменитьТранзакцию();
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
		ПараметрыСеанса.БезусловноеПроведениеДокументов = Ложь;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = Истина;
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда       
		
	//	Запр = Новый Запрос;
	//	Запр.УстановитьПараметр("Дата", Дата);
	//	Запр.УстановитьПараметр("Ссылка", Ссылка);
	//	Запр.Текст = "ВЫБРАТЬ
	//	             |	Рег.Партия КАК Партия,
	//	             |	Рег.Партия.Серия КАК Серия,
	//	             |	ТЧТовары.СерияНовая КАК СерияНовая,
	//	             |	Рег.ОстатокОстаток КАК Остаток,
	//	             |	ТЧТовары.Партия.Владелец КАК Номенклатура
	//	             |ИЗ
	//	             |	(ВЫБРАТЬ
	//	             |		Товары.Партия КАК Партия,
	//	             |		Товары.Серия КАК Серия,
	//	             |		Товары.СерияНовая КАК СерияНовая
	//	             |	ИЗ
	//	             |		Документ.ЗаменаСерий.Товары КАК Товары
	//	             |	ГДЕ
	//	             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
	//	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
	//	             |		ПО ТЧТовары.Партия = Рег.Партия
	//	             |			И ТЧТовары.СерияНовая = Рег.Партия.Серия";
	//	Выборка = Запр.Выполнить().Выбрать();	
	//	Пока Выборка.Следующий() Цикл
	//		Если Выборка.Остаток <= 0 Тогда 
	//			Сообщить("Нет остатков серии " + Выборка.СерияНовая);
	//		 	Отказ = Истина;
	//		КонецЕсли;
	//	КонецЦикла;

	//	Если НЕ Отказ Тогда
	//		Выборка.Сбросить();
	//		Пока Выборка.Следующий() Цикл	
	//			ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
	//			ПартияОбъект.Серия = Выборка.Серия;  
	//			Коммент = СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая);
	//			гоЗаписьЖурналаРегистрации(Коммент, , "Отмена проведения", Выборка.Партия, ); 
	//			ДобавитьКомментарий(Коммент);
	//			ПартияОбъект.Записать(); 
	//		КонецЦикла;
	//	КонецЕсли;
		
	Иначе
	
		
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаменаПроведена Тогда 
		Сообщить("Невозможно изменить проведенный документ!");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ЗаменаПроведена = Истина;
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗаменаПроведена Тогда
	
		
	
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования) 
	
	ЗаменаПроведена = Ложь;
	КемСоздан = Справочники.Пользователи.ПустаяСсылка();
	Создан = Дата(1,1,1);
	КемСохранен = Справочники.Пользователи.ПустаяСсылка();
	Сохранен = Дата(1,1,1);  
	
КонецПроцедуры     

