&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоКонтрагенту = Справочники.Контрагенты.ПустаяСсылка();
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Контрагент") Тогда ПоКонтрагенту = Параметры.Отбор.Контрагент КонецЕсли; КонецЕсли;
	
	Элементы.ПоКонтрагенту.Видимость = гоНПЗ(ПоКонтрагенту);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МояСформировать(0);
КонецПроцедуры

&НаКлиенте
Процедура МояСформировать(Команда)
	клПроверитьУстановитьПараметрОтчета(Отчет, "ВалютаПересчета", гоРеквизит(гоФирма(), "Валюта"));
	
	Период = клПолучитьПараметрОтчета(Отчет, Период);
	клПроверитьУстановитьПараметрОтчета(Отчет, "ДатаПересчета", ?(гоПЗ(Период), гоТекущаяДата(), Период));
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ЭтаФорма.Заголовок  = СтрШаблон("%1 (%2)", РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, ЭтотОбъект.ПредставлениеТекущегоВарианта);

КонецПроцедуры
