&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧислоЗнаковКоличество = гоФирма().ЧислоЗнаковКоличество;
КонецПроцедуры
 
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//отдельно хочется показать карточку на продаже и остатки на остатках
	//но сначала нужно убедиться, что есть товар
	естьНом = РасшифровкаПолучитьТовар(ДанныеРасшифровки, Расшифровка);
	Если естьНом = 0 Тогда Возврат КонецЕсли; 
	
	естьКол = РасшифровкаПолучитьКолонку(ДанныеРасшифровки, Расшифровка);
	
	Если естьКол = "Остаток" Тогда
		Отбор = Новый Структура("Товар", естьНом);
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, "ОстаткиОднойНоменклатуры");
		ОткрытьФорму("Отчет.ОстаткиТовара.Форма", ПараметрыФормы);
	ИначеЕсли естьКол = "Продажа" Тогда
		Отбор = Новый Структура("Номенклатура, Фирма", естьНом, гоФирма());
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
		ОткрытьФорму("Отчет.ОборотыОднойНоменклатуры.Форма", ПараметрыФормы);
	ИначеЕсли естьКол = "Заказ" Тогда
		//а вот тут самое интересное
		//нужно как-то узнать, есть заказ или нет, потому что работать нужно именно с ним
		//параметр используется всегда, нужно просто получить его значение
		докЗаказ = клПолучитьПараметрОтчета(Отчет, "ЗаказТовара");
		Если гоПЗ(докЗаказ) Тогда клОшибка("Не выбран документ заказа!"); Возврат; КонецЕсли;
		Если гоРеквизит(докЗаказ, "Окончательно") Тогда клОшибка("Документ заказа уже закрыт {Окончательно}!"); Возврат; КонецЕсли;
		
		Попытка
			Колво = Число(Элемент.ТекущаяОбласть.Текст);
		Исключение
		    Колво = 0;
		КонецПопытки;
		Было = Колво;
		Цена = ЦенаЗаказа(докЗаказ, естьНом);
		БылоЦена = Цена;
		
		Пар = Новый Структура;
		Пар.Вставить("Фирма", гоРеквизит(докЗаказ, "Фирма"));
		Пар.Вставить("Номенклатура", естьНом);
		Пар.Вставить("Валюта", гоРеквизит(докЗаказ, "Валюта"));
		Пар.Вставить("Поставщик", гоРеквизит(докЗаказ, "Контрагент"));
		Пар.Вставить("Количество", Колво);
		Пар.Вставить("Цена", Цена);
		
		НовПар = ОткрытьФормуМодально("ОбщаяФорма.ВводСтрокиЗТ", Пар);
		Если гоПЗ(НовПар) Тогда Возврат КонецЕсли; 
		
		Цена = НовПар.Цена;
		Колво = НовПар.Количество;
		Если (Было = Колво) И (Цена = БылоЦена) Тогда Возврат КонецЕсли;
		
		Р = "";
		ЗаписатьЗаказ(докЗаказ, естьНом, Колво, Цена, Р);
		Если клЕстьОшибка(Р) Тогда Возврат КонецЕсли;
		
		Элемент.ТекущаяОбласть.Текст = ?(Колво = 0, "", Строка(Колво));
	Иначе	
		Если гоАдминистратор() Тогда Возврат КонецЕсли;
		клВнимание(Строка(естьНом) + гоРС() + естьКол);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаЗаказа(докЗаказ, естьНом)
	Стр = докЗаказ.Товары.Найти(естьНом, "Номенклатура");
	Если Стр = Неопределено Тогда Возврат 0 КонецЕсли;
	Возврат Стр.ЦенаЗакупки;
КонецФункции
 
&НаСервереБезКонтекста
Процедура ЗаписатьЗаказ(докЗаказ, естьНом, Колво, Цена, Р);
	Док = докЗаказ.ПолучитьОбъект();
	
	Стр = Док.Товары.Найти(естьНом, "Номенклатура");
	Если Стр = Неопределено Тогда 
		Стр = Док.Товары.Добавить();
		Стр.Номенклатура = естьНом;
	КонецЕсли; 
	Стр.Количество = Колво;
	Стр.ЦенаЗакупки = Цена;
	Если Колво = 0 Тогда Док.Товары.Удалить(Стр) КонецЕсли; 
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	    гоРезСоо(Р, ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры 

&НаСервереБезКонтекста
Функция РасшифровкаПолучитьТовар(ДанныеРасшифровки, Расшифровка)
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Данное = Данные.Элементы.Получить(Расшифровка);
	
	естьНом = 0;
	МассивРодителей = Данное.ПолучитьРодителей();	
	Для Каждого Родитель Из МассивРодителей Цикл
		Данное = Данные.Элементы.Получить(Родитель.Идентификатор);
		Попытка
			Поля = Данное.ПолучитьПоля();
		Исключение
		    Возврат 0;
		КонецПопытки; 
		Поле = Поля.Найти("Товар");
		Если НЕ (Поле = Неопределено) Тогда естьНом = Поле.Значение; Прервать; КонецЕсли;
	КонецЦикла; 
	Если естьНом = 0 Тогда Возврат 0 КонецЕсли; 
	Если естьНом.ЭтоГруппа Тогда Возврат 0 КонецЕсли; 
	
	Возврат естьНом;
КонецФункции
 
&НаСервереБезКонтекста
Функция РасшифровкаПолучитьКолонку(ДанныеРасшифровки, Расшифровка)
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Данное = Данные.Элементы.Получить(Расшифровка);
	
	Попытка
		Поля = Данное.ПолучитьПоля();
	Исключение
	    Возврат "";
	КонецПопытки; 
	
	Поле = Поля.Найти("Продажа");
	Если Поле <> Неопределено Тогда Возврат "Продажа" КонецЕсли;
	
	Поле = Поля.Найти("Остаток");
	Если Поле <> Неопределено Тогда Возврат "Остаток" КонецЕсли;
	
	Поле = Поля.Найти("Заказ");
	Если Поле <> Неопределено Тогда Возврат "Заказ" КонецЕсли;
	
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ПерейтиВЗаказ(Команда)
	докЗаказ = клПолучитьПараметрОтчета(Отчет, "ЗаказТовара");
	Если гоПЗ(докЗаказ) Тогда клОшибка("Не выбран документ заказа!"); Возврат; КонецЕсли;
	ОткрытьЗначение(докЗаказ);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаказа(Команда)
	докЗаказ = клПолучитьПараметрОтчета(Отчет, "ЗаказТовара");
	Если гоПЗ(докЗаказ) Тогда клОшибка("Не выбран документ заказа!"); Возврат; КонецЕсли;
	клПечатьДокумента(докЗаказ, 0);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
//2017.03.24
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", Мас);
	КонецЕсли; 
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры
