// © Primus1C  10.12.2023  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОплатить.Видимость = Ложь;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОтменитьОплату.Видимость = Ложь;

	глПокраситьВалюты(ЭтаФорма, "Валюта"); 
	//глПокраситьСтатусы(ЭтаФорма, "Список", Истина, Истина, Ложь);  
    глПокраситьПомеченныеНаУдаление(ЭтаФорма);

КонецПроцедуры      

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//Если Элемент.ТекущиеДанные <> Неопределено Тогда
	//	Если Элемент.ТекущиеДанные.Свойство("СтатусОплаты") Тогда
	//		Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОплатить") <> Неопределено Тогда
	//			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОплатить.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Paid");
	//		КонецЕсли;
	//		Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОтменитьОплату") <> Неопределено Тогда
	//			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОтменитьОплату.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
