&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Пар = Новый Структура("ВыбраннаяСтрока,ВыбранноеЗначение", ВыбраннаяСтрока, Элемент.ТекущиеДанные.Значение);
	ОповеститьОВыборе(Пар);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список = Параметры.Список;
	Заголовок = Параметры.Заголовок; 
	Если Параметры.Свойство("Старт") Тогда
		ТекущийСтарт = Параметры.Старт - 1;
	Иначе
		ТекущийСтарт = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	Элементы.Список.ТекущаяСтрока = ТекущийСтарт;
	
КонецПроцедуры

// © Primus1C  25.07.2023  НАЧАЛО ►

&НаКлиенте
Процедура ВыбратьЭлементСписка(Команда) 
	
	Пар = Новый Структура("ВыбраннаяСтрока,ВыбранноеЗначение", Элементы.Список.ТекущаяСтрока, Элементы.Список.ТекущиеДанные.Значение);
	ОповеститьОВыборе(Пар);  
	
КонецПроцедуры    

// © Primus1C  ОКОНЧАНИЕ ◄
