
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ДокументОснование,ВидОперации", ПараметрКоманды, ПредопределенноеЗначение("Перечисление.ВидыОперацииИнвойс.Скидка")));
	ОткрытьФорму("Документ._Инвойс.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
