
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого ТекСтрока Из ТаблицаКорректировки Цикл
		Движение						 = Движения.Долги.ДобавитьПриход();
		Движение.Период					 = Дата;
		Движение.Фирма					 = Фирма;
		Движение.Док					 = ТекСтрока.Док;
		Движение.Валюта					 = ТекСтрока.Валюта;
		Движение.Контрагент				 = ТекСтрока.Контрагент;
		Движение.ПредоплатаПокупателя	 = -ТекСтрока.ПредоплатаПокупателя;
		Движение.Покупатель				 = -ТекСтрока.Предоплата;
	КонецЦикла;
	
	Движения.Долги.Записывать = Истина;
	
КонецПроцедуры
