&НаКлиенте
Процедура МояСформировать(Команда)
	клПроверитьУстановитьПараметрОтчета(Отчет, "ВалютаПересчета", гоРеквизит(гоФирма(), "Валюта"));
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
//2017.04.02
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	МасКас = ОбщегоНазначенияПовтИсп.МассивДоступныхКасс();
	Если МасКас.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Кассы", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Кассы", МасКас);
	КонецЕсли; 
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры

// © Primus1C  01.05.2025  НАЧАЛО ►

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	возврат;
	//
	//СтандартнаяОбработка = ложь;
	//
	//	Для Каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	//Если Эл.Использование Тогда
	//		Если Строка(Эл.Параметр) = "Период" Тогда
	//			естьПериод = Эл.Значение;	
	//		ИначеЕсли Строка(Эл.Параметр) = "Касса" Тогда
	//			естьКасса = Эл.Значение;	
	//		КонецЕсли;	
	//	//КонецЕсли;	
	//КонецЦикла;	
	//
	//Отбор = Новый Структура("Касса,Расход,ПериодОтчета", естьКасса, Истина, естьПериод);
	//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//ОткрытьФорму("Отчет.ОборотыРасходыДоходы.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄