Функция гоФирмаИмя() Экспорт
	Возврат гоРеквизит(гоПараметрСеанса("Фирма"), "Наименование");
КонецФункции

Функция гоФирма() Экспорт
	Возврат гоПараметрСеанса("Фирма");
КонецФункции

Функция гоСкобки(Стр, Скобки = Истина) Экспорт
	Возврат ?(Скобки, "[", "") + Стр + ?(Скобки, "]", "");
КонецФункции

//Функция гоИмяМесяц(Дат) Экспорт
//	Попытка
//		Месяц = Месяц(Дат);
//	Исключение
//	    Возврат "?!?";
//	КонецПопытки; 
//	
//	Если Месяц = 1 Тогда Возврат "Январь"
//	ИначеЕсли Месяц = 2 Тогда Возврат "Февраль"
//	ИначеЕсли Месяц = 3 Тогда Возврат "Март"
//	ИначеЕсли Месяц = 4 Тогда Возврат "Апрель"
//	ИначеЕсли Месяц = 5 Тогда Возврат "Май"
//	ИначеЕсли Месяц = 6 Тогда Возврат "Июнь"
//	ИначеЕсли Месяц = 7 Тогда Возврат "Июль"
//	ИначеЕсли Месяц = 8 Тогда Возврат "Август"
//	ИначеЕсли Месяц = 9 Тогда Возврат "Сентябрь"
//	ИначеЕсли Месяц = 10 Тогда Возврат "Октябрь"
//	ИначеЕсли Месяц = 11 Тогда Возврат "Ноябрь"
//	ИначеЕсли Месяц = 12 Тогда Возврат "Декабрь"
//	Иначе
//		Возврат "???";
//	КонецЕсли; 
//КонецФункции

Функция гоДокВид(Тек, Кратко = Ложь) Экспорт
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда Возврат ?(Кратко, "ПН", "Прих.накл.") КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда Возврат ?(Кратко, "РН", "Расх.накл.") КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка._ВозвратОтПокупателя") Тогда Возврат ?(Кратко, "Возв", "Возв. от покуп.") КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ДвижениеДенег") Тогда
		Если гоРеквизит(Тек, "ВидДвиженияДенег") = гоПеречисление("ВидДвиженияДенег.Перемещение") Тогда
			Возврат ?(Кратко, "РД", "Перемещ.денег");   
		ИначеЕсли гоРеквизит(Тек, "ВидДвиженияДенег") = гоПеречисление("ВидДвиженияДенег.ОбменВалюты") Тогда
			Возврат ?(Кратко, "РД", "Обмен валют");   
		ИначеЕсли гоРеквизит(Тек, "ПриходРасход") = гоПеречисление("ПриходРасход.Приход") Тогда  
			Возврат ?(Кратко, "ПД", "Прих.денег"); 
		Иначе
			Возврат ?(Кратко, "РД", "Расх.денег"); 
		КонецЕсли; 
	КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ЗаказТовара") Тогда Возврат ?(Кратко, "ЗТ", "Заказ") КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.Перемещение") Тогда Возврат ?(Кратко, "ПМ", "Перемещение") КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда Возврат ?(Кратко, "ВП", "Возв.пост.") КонецЕсли;

	Если ТипЗнч(Тек) = Тип("ДокументСсылка._Инвойс") Тогда Возврат ?(Кратко, "Инв", "Инвойс") КонецЕсли; 
	
	//ВКД++
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВКД_ПлатежноеПоручениеВходящее") Тогда Возврат ?(Кратко, "ППВх", "Вх. ПП") КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВКД_ПлатежноеПоручениеИсходящее") Тогда Возврат ?(Кратко, "ППИсх.", "Исх. ПП") КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда Возврат ?(Кратко,"Нач.ЗП","Нач. зарплаты") КонецЕсли;
	//ВКД--
	// © Primus1C  10.06.2026  НАЧАЛО ►
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПередачаНаКомиссию") Тогда Возврат ?(Кратко, "ПКом", "Передача на ком.") КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПереоценкаТовараНаКомиссии") Тогда Возврат ?(Кратко, "ЦенКом", "Переоценка ком.") КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратСКомиссии") Тогда Возврат ?(Кратко, "ВоврКом", "Возв.с ком.") КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда Возврат ?(Кратко, "ОтчКом", "Отч.ком.") КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Возврат "??";
КонецФункции
 
Функция гоДокИмя(Тек) Экспорт
	
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда Возврат "ПриходнаяНакладная" КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда Возврат "РасходнаяНакладная" КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ДвижениеДенег") Тогда Возврат "ДвижениеДенег" КонецЕсли; 
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ЗаказТовара") Тогда Возврат "ЗаказТовара" КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.Перемещение") Тогда Возврат "Перемещение" КонецЕсли;
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда Возврат "ВозвратПоставщику" КонецЕсли;
	//Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВКД_НачислениеЗарплаты") Тогда Возврат "НачислениеЗарплаты" КонецЕсли;
	Возврат "??";
КонецФункции
 
Функция гоДокКраткоНомер(Тек) Экспорт
	Возврат гоДокВид(Тек, Истина) + " " + гоБезНПП(Тек.Номер);
КонецФункции

Функция гоДокКраткоНомерДата(Тек) Экспорт
	Возврат гоДокВид(Тек, Истина) + " " + гоБезНПП(гоРеквизит(Тек, "Номер")) + " от " + гоДата2(гоРеквизит(Тек, "Дата"));
КонецФункции

Функция гоДокКраткоДатаНомер(Тек) Экспорт
	Возврат гоДата2(Тек.Дата) + "    " + гоДокВид(Тек, Истина) + " " + гоБезНПП(Тек.Номер);
КонецФункции

Функция гоИмяДок(Тек) Экспорт
	Если НЕ ЗначениеЗаполнено(Тек) Тогда Возврат "" КонецЕсли; 
	
	Возврат гоДокВид(Тек) + " " + гоБезНПП(Тек.Номер) + " от " + гоДата2(Тек.Дата);
КонецФункции

Функция гоИмяНом(Стр, Скобки = Истина) Экспорт
	//Гру = гоРеквизит(Стр, "Родитель");
	//Имя = СокрЛП(гоРеквизит(Гру, "ГруппаДляПечати"));
	//Если Имя <> "" Тогда Имя = Имя + " " КонецЕсли; 
	Имя = "";
	Про = "";
	
	Возврат гоСкобки(Имя + СокрЛП(Стр) + Про, Скобки);
КонецФункции

Функция гоИмяПар(Стр, Пар, Скобки = Истина) Экспорт
	Возврат гоСкобки(СокрЛП(Стр) + " - " + СокрЛП(гоРеквизит(Пар, "Серия")), Скобки);
КонецФункции

Функция гоИмяПарСерНом(Пар, Скобки = Ложь) Экспорт
	Возврат гоСкобки(СокрЛП(Пар) + " [" + СокрЛП(гоРеквизит(Пар, "Серия")) + "] " + гоИмяНом(гоРеквизит(Пар, "Владелец")), Скобки);
КонецФункции

Функция гоИмя(Знач Стр, Скобки = Истина) Экспорт
	Если ТипЗнч(Стр) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат гоИмяНом(Стр, Скобки);
	КонецЕсли; 
	
	Если ТипЗнч(Стр) = Тип("СправочникСсылка.Партии") Тогда
		Ном = гоРеквизит(Стр, "Владелец");
		Возврат гоИмяПар(Ном, Стр, Скобки);
	КонецЕсли; 
	
	локВид = гоДокИмя(Стр);
	Если НЕ (локВид = "??") Тогда 
		Стр = гоДокВид(Стр, Ложь) + " " + СокрЛП(гоРеквизит(Стр, "Номер")) + " от " + гоДата(гоРеквизит(Стр, "Дата")) 
	КонецЕсли; 
	
	Возврат гоСкобки(СокрЛП(Стр), Скобки);
КонецФункции

Функция гоДополнитьСтроку(Стр, Чем, Длина, Режим = 1) Экспорт
	Добавить = Длина - СтрДлина(Стр);
	
	Если Добавить <= 0 Тогда Возврат Стр КонецЕсли;
	
	Добавок = "";
	Для Сч = 1 По Добавить Цикл
		Добавок = Добавок + Чем
	КонецЦикла;
	
	Возврат ?(Режим = 1, Добавок + Стр, Стр + Добавок);
КонецФункции

Функция гоДополнитьСлева(Стр, Длина, Чем = " ") Экспорт
	Возврат гоДополнитьСтроку(Стр, Чем, Длина, 1);
КонецФункции
 
Функция гоДополнитьСправа(Стр, Длина, Чем = " ") Экспорт
	Возврат гоДополнитьСтроку(Стр, Чем, Длина, 2);
КонецФункции

Функция гоСформироватьЕАН13(лШтрКод) Экспорт
	ШтрКод = гоДополнитьСтроку(Лев(СокрЛП(лШтрКод), 12), "0", 12, 1);
	
	Четн = 0;
	Нечетн = 0;
	
	Для Индекс = 1 По 6 Цикл
		Четн = Четн + Сред(ШтрКод, 2 * Индекс, 1);
	КонецЦикла;
	Четн = Четн * 3;

	Для Индекс = 1 По 6 Цикл
		Нечетн = Нечетн + Сред(ШтрКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	КонтЦифра = (Четн + Нечетн) / 10 - Цел((Четн + Нечетн) / 10);
	КонтЦифра = 10 - Цел(КонтЦифра * 10);
	
	Если КонтЦифра = 10 Тогда КонтЦифра = 0 КонецЕсли;
	
	Возврат ШтрКод + Строка(КонтЦифра);
КонецФункции 

Функция гоТБ() Экспорт
	Возврат Символы.Таб;
КонецФункции

Функция гоРС(Сколько = 1) Экспорт
	Рез = "";
	Для Н = 1 По Сколько Цикл
		Рез = Рез + Символы.ПС;
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции

Функция гоПараметрСеанса(Имя) Экспорт
	Возврат омСервер.ПолучитьПараметрСеанса(Имя);
КонецФункции
 
Функция гоРеквизит(Ссылка, Имя) Экспорт
	Возврат омСервер.ПолучитьРеквизит(Ссылка, Имя);
КонецФункции

Процедура гоЗаписатьРеквизит(Ссылка, Имя, НовЗна, РезСоо = "", Провести = Ложь) Экспорт
	омСервер.ЗаписатьРеквизит(Ссылка, Имя, НовЗна, РезСоо, Провести);
КонецПроцедуры

Функция гоПЗ(Тек) Экспорт
	Если Тек = Неопределено Тогда Возврат Истина КонецЕсли;
	Возврат НЕ ЗначениеЗаполнено(Тек);
КонецФункции

Функция гоНео(Тек) Экспорт
	Если Тек = Неопределено Тогда Возврат Истина КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция гоНеНео(Тек) Экспорт
	Возврат НЕ гоНео(Тек);
КонецФункции

Функция гоНПЗ(Тек) Экспорт
	Возврат НЕ гоПЗ(Тек);
КонецФункции

Функция гоКонстанта(Имя) Экспорт
	Возврат омСервер.ПолучитьКонстанту(Имя);
КонецФункции

Функция гоПеречисление(Имя) Экспорт
	Возврат омСервер.ПолучитьПеречисление(Имя);
КонецФункции

Функция гоПользователь() Экспорт
	Возврат омСервер.ПолучитьПараметрСеанса("Пользователь");
КонецФункции

Функция гоПользовательКод() Экспорт
	//с другой стороны, есть глобальная функция, возвращающая имя
	//и она доступна везде!!!
	//Возврат СокрЛП(омСервер.ПолучитьРеквизит(омСервер.ПолучитьПараметрСеанса("Пользователь"), "Код"));
	//это как раз и будет нужный нам код пользователя!!!
	
	Возврат ИмяПользователя();
КонецФункции

Функция гоАдминистратор() Экспорт
	Возврат гоПараметрСеанса("Администратор");
КонецФункции

//2015.12.08
Функция гоМенеджер() Экспорт
	Возврат гоЕстьРоль("Менеджер");
КонецФункции

Функция гоДобавитьДень(Дат, Дней = 1) Экспорт
	Возврат Дат + Дней * 86400;
КонецФункции
 
Функция гоТекущееВремя() Экспорт
	Возврат Формат(ТекущаяДата(), "ДФ=ЧЧ:мм:сс");
КонецФункции

Функция гоТекущаяДата() Экспорт
	Возврат НачалоДня(ТекущаяДата());
КонецФункции

Функция гоЕстьРоль(Имя, ДругойПользователь = 0) Экспорт
//2016.08.26 + ДругойПользователь = 0
	Возврат омСервер.ЕстьРоль(Имя, ДругойПользователь);
КонецФункции

//Функция гоЧужойДокумент(Автор) Экспорт
////2016.08.26
////не так все просто, но нужно что-то делать
////итак, есть автор документа, проверим, не оператор ли он
////если нет, то нам все равно
////а вот если это оператор, то редактировать может только оператор
////вроде так

//	Если НЕ гоЕстьРоль("Оператор", Автор) Тогда Возврат Ложь КонецЕсли; 
//	Если гоЕстьРоль("Оператор") Тогда Возврат Ложь КонецЕсли; 
//	Возврат Истина;
//КонецФункции

Функция гоНетРоли(Имя) Экспорт
	Возврат НЕ омСервер.ЕстьРоль(Имя);
КонецФункции
 
Функция гоВремя(СохВремя = 0, Стр = "", Уро = 1, Обновить = Истина, ТолькоВернуть = Ложь) Экспорт
	Если СохВремя = 0 Тогда Возврат "" КонецЕсли; 
	Если НЕ ТипЗнч(СохВремя) = Тип("Дата") Тогда Возврат "" КонецЕсли; 
	
	Отступ = ?(Уро <= 1, "", гоДополнитьСправа("", 4 * (Уро - 1)));
	
	ТекВремя = ТекущаяДата();
	БылоВремя = СохВремя;
	Если Обновить Тогда СохВремя = ТекВремя КонецЕсли; 
	
	ОтлСек = ТекВремя - БылоВремя;
	Если ОтлСек > 60 Тогда
		ОтлМин = Окр(ОтлСек / 60, 2);
		Рез = Отступ + ОтлМин + НСтр("ru = ' мин  ->  '; en = ' min  ->  '") + Стр; 
	Иначе
		Рез = Отступ + ОтлСек + НСтр("ru = ' сек  ->  '; en = ' sec  ->  '") + Стр; 
	КонецЕсли;
	
	Если НЕ ТолькоВернуть Тогда Сообщить(Рез) КонецЕсли; 
	Возврат Рез;
КонецФункции     

Процедура гоПлюс(Что, Сколько = 1) Экспорт
	Что = Что + Сколько;
КонецПроцедуры

Функция гоНеПусто(Чис) Экспорт
    Если Чис = 0 Тогда Возврат "0" КонецЕсли;
	Возврат Строка(Чис);
КонецФункции

Процедура гоМинус(Что, Сколько = 1) Экспорт
	Что = Что - Сколько;
КонецПроцедуры

Функция гоЧетное(Чис) Экспорт
	Ост = Чис % 2;
	Возврат (Ост = 0);
	
	//Дел=Чис/2;
	//Возврат ?(Дел=Цел(Дел),1,0);
КонецФункции

Функция гоНеЧетное(Чис) Экспорт
	Возврат НЕ гоЧетное(Чис);
КонецФункции
            
Процедура гоСЗН(Вид, Имя, Зна) Экспорт
	омСервер.СЗН(Вид, Имя, Зна);			
КонецПроцедуры
			
Процедура гоВЗН(Вид, Имя, Зна, Тип = "") Экспорт
	омСервер.ВЗН(Вид, Имя, Зна);			
	
	Если Зна = Неопределено Тогда  
		Если Тип = "Строка" Тогда Зна = ""
		ИначеЕсли Тип = "Число" Тогда Зна = 0
		ИначеЕсли Тип = "Дата" Тогда Зна = гоПустаяДата()
		ИначеЕсли Тип = "Булево" Тогда Зна = Ложь
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Функция гоПустаяДата() Экспорт
	Возврат Дата('00010101000000');
КонецФункции

Функция гоНачинаетсяС(Что, СЧего) Экспорт
	Дли = СтрДлина(СЧего);
	Возврат (Лев(Что, Дли) = СЧего);
КонецФункции

Функция гоЗаканчиваетсяНа(Что, СЧего) Экспорт
	Дли = СтрДлина(СЧего);
	Возврат (Прав(Что, Дли) = СЧего);
КонецФункции

Процедура гоРезСоо(РезСоо, Стр, локДоб = "") Экспорт
	//2013.12.02
	//зачем добавлять пустую строку?
	Если СокрЛП(Стр) = "" Тогда Возврат КонецЕсли; 
	
	Доб = ?(локДоб = "", гоРС(), локДоб);
	
	РезСоо = РезСоо + ?(РезСоо = "", "", Доб) + Стр;
КонецПроцедуры

Процедура гоРез(РезСоо, Стр, Доб = ", ") Экспорт
	РезСоо = РезСоо + ?(РезСоо = "", "", Доб) + Стр;
КонецПроцедуры

Процедура гоРезСооВре(РезСоо, СохВремя, Стр, локДоб = "") Экспорт
	гоРезСоо(РезСоо, гоВремя(СохВремя, Стр, , Истина, Истина));
КонецПроцедуры
 
Функция гоЭто(ллСтр, ллВид, ллСим = ",") Экспорт
	
	//2014.02.14
	//вот такое вот исправление позволит перечислять варианты через пробел после запятой, а то некрасиво получается
	//лСтр = СокрЛП(ллСтр);
	лСтр = СтрЗаменить(СокрЛП(ллСтр), ллСим + " ", ллСим);
	
	лВид = СокрЛП(ллВид);
	
	Если Лев(лСтр, 1) <> ллСим Тогда лСтр = ллСим + лСтр КонецЕсли;
	Если Лев(лВид, 1) <> ллСим Тогда лВид = ллСим + лВид КонецЕсли;
	Если Прав(лСтр, 1) <> ллСим Тогда лСтр = лСтр + ллСим КонецЕсли;
	Если Прав(лВид, 1) <> ллСим Тогда лВид = лВид + ллСим КонецЕсли;
	
	Возврат ?(Найти(лСтр, лВид) = 0, Ложь, Истина);
КонецФункции

Функция гоЭтоНе(ллСтр, ллВид, ллСим = ",") Экспорт
	Возврат НЕ гоЭто(ллСтр, ллВид, ллСим);
КонецФункции

Функция гоБезНПП(Стр) Экспорт
	Возврат СтрЗаменить(Стр, Символы.НПП, "");
КонецФункции

Функция гоБезПС(Стр) Экспорт
	Возврат СтрЗаменить(Стр, Символы.ПС, "");
КонецФункции
 
Функция гоЧислоНулиСлева(Чис, Зн) Экспорт
	Возврат гоБезНПП(Формат(Чис, "ЧЦ=" + Зн + "; ЧН=; ЧВН="));
КонецФункции
 
Функция гоЧисло7(Чис) Экспорт
	Возврат гоЧислоНулиСлева(Чис, 7);
КонецФункции

Функция гоСтрокаСимволов(Сим, Дли) Экспорт
	Рез = "";
	Для Н = 1 По Дли Цикл гоПлюс(Рез, Сим) КонецЦикла; 
	Возврат Рез;
КонецФункции
 
Функция гоСтрокаПробелов(Дли) Экспорт
	Возврат гоСтрокаСимволов(" ", Дли);
КонецФункции

Функция гоЛП(Стр, Сим) Экспорт
	лСтр = Лев(СокрЛП(Стр), Сим);
	лЛен = СтрДлина(лСтр);
	лЕще = Сим - лЛен;
	Если лЕще > 0 Тогда лСтр = гоСтрокаПробелов(лЕще) + лСтр КонецЕсли;
	Возврат лСтр;
КонецФункции

Процедура гоСтандартныйОтбор(Список, Н, Исп = "пусто", Зна = "пусто") Экспорт
	Если НЕ (Исп = "пусто") Тогда
		//Если это83() Тогда 
			Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[Н].Использование = Исп;
		//Иначе 
		//	Список.Отбор.Элементы[Н].Использование = Исп;
		//КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ (Зна = "пусто") Тогда
		//Если это83() Тогда 
			Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[Н].ПравоеЗначение = Зна;
		//Иначе 
		//	Список.Отбор.Элементы[Н].ПравоеЗначение = Зна;
		//КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура гоСвернутьСписокЗначений(Список, Сорт = "") Экспорт
    Копия = Список.Скопировать();
	Список.Очистить();
	
	Для Каждого Стр Из Копия Цикл
		Тек = Стр.Значение;
		Если гоПЗ(Тек) Тогда Продолжить КонецЕсли; 
		
		Если НЕ (Список.НайтиПоЗначению(Тек) = Неопределено) Тогда Продолжить КонецЕсли; 
		
		Список.Добавить(Тек);
	КонецЦикла; 
	
	Если Список.Количество() = 0 Тогда Возврат КонецЕсли; 
	Если Сорт = "" Тогда Возврат КонецЕсли; 
	
	Список.СортироватьПоЗначению(?(Сорт = "Возр", НаправлениеСортировки.Возр, НаправлениеСортировки.Убыв));
КонецПроцедуры 

Процедура гоСвернутьМассив(Мас) Экспорт
    Копия = Новый СписокЗначений;
	Копия.ЗагрузитьЗначения(Мас);
	Мас.Очистить();
	
	Для Каждого Стр Из Копия Цикл
		Тек = Стр.Значение;
		Если гоПЗ(Тек) Тогда Продолжить КонецЕсли; 
		Если НЕ (Мас.Найти(Тек) = Неопределено) Тогда Продолжить КонецЕсли; 
		Мас.Добавить(Тек);
	КонецЦикла; 
КонецПроцедуры 

Процедура гоЗаписьЖурналаРегистрации(Коммент = "", ТипСобытия = "Дополнительные", Событие = "", Объект = "", Категория = 1) Экспорт
	омСервер.ЗаписьЖурналаРегистрации1с77(Коммент, ТипСобытия, Событие, Объект, Категория);
КонецПроцедуры

Функция гоМгновение(ТекВсе = 0, ТекДат = 0, ТекВре = 0) Экспорт
	Если НЕ ТекВсе = 0 Тогда Возврат Формат(ТекВсе, "ДФ=yyyyMMddHHmmss") КонецЕсли; 
	
	Если (ТекДат = 0) ИЛИ (ТекВре = 0) Тогда Возврат Формат(ТекущаяДата(), "ДФ=yyyyMMddHHmmss") КонецЕсли; 
	Возврат Формат(ТекДат, "ДФ=yyyyMMdd") + СтрЗаменить(ТекВре, ":", "");
КонецФункции

Функция гоИмяИнтервала(НачДата, КонДата) Экспорт
	Рез = НСтр("ru = 'все'; en = 'all'");
	
	Если НачалоДня(НачДата) = НачалоДня(КонДата) Тогда
		Если ЗначениеЗаполнено(НачДата) Тогда
			Рез = "за " + гоДата(НачДата);
		КонецЕсли; 
	Иначе
		Рез = "с " + гоДата(НачДата) + " по " + гоДата(КонДата);
	КонецЕсли; 
	
	Возврат Рез;
КонецФункции

Процедура гоЗаголовокИнтервал(Форма, Обновить = Истина, ПриОткрытии = Ложь) Экспорт
	
	Если ПриОткрытии Тогда
		//Если НЕ гоАдминистратор() Тогда
		//	Форма.НачДата = НачалоДня(ТекущаяДата());
		//	Форма.КонДата = КонецДня(Форма.НачДата);
		//	
		//	//Если гоЧеткоМенеджер() И гоЭто("Накладная, ОплатаПокупателя", Форма.ИмяДокумента) Тогда
		//	//	Форма.Элементы.ИнтервалНаш.Доступность = Ложь;
		//	//	Форма.Элементы.ИнтервалМесяц.Доступность = Ложь;
		//	//	Форма.Элементы.ИнтервалДень.Доступность = Ложь;
		//	//КонецЕсли;
		//КонецЕсли; 
		
		Если Форма.Элементы.Найти("СохНачДата") <> Неопределено Тогда
			Форма.СохНачДата = Форма.Элементы.Список.Период.ДатаНачала;
			Форма.СохКонДата = Форма.Элементы.Список.Период.ДатаОкончания;
		КонецЕсли;
	КонецЕсли; 
	
	
	// © Primus1C  28.10.2023  НАЧАЛО ►
	Если Форма.ИмяЖурнала = "ПоставкиИнвойсов" Тогда
		
		Отборы = Форма.Список.Отбор.Элементы;
		лЕстьНачДата = Ложь;
		лЕстьКонДата = Ложь;
		Для каждого Отбор ИЗ Отборы Цикл
			Если Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата") Тогда
				Если Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
					Отбор.ПравоеЗначение = Форма.НачДата;
					Отбор.Использование = Форма.НачДата <> Дата(1,1,1); 
					лЕстьНачДата = Истина;
				ИначеЕсли Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
					Отбор.ПравоеЗначение = КонецДня(Форма.КонДата);
					Отбор.Использование = Форма.КонДата <> Дата(1,1,1);
					лЕстьКонДата = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ лЕстьНачДата Тогда
			Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
			Отбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			Отбор.ПравоеЗначение= Форма.НачДата;
			Отбор.Использование = Форма.НачДата <> Дата(1,1,1);
		КонецЕсли;
		Если НЕ лЕстьКонДата Тогда
			Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
			Отбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			Отбор.ПравоеЗначение= КонецДня(Форма.КонДата);
			Отбор.Использование = Форма.КонДата <> Дата(1,1,1);		
		КонецЕсли;
		
		//Если Отборы.Количество() = 0 Тогда
		//	Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		//	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		//	Отбор.ПравоеЗначение = Форма.НачДата;
		//	Отбор.Использование = Форма.НачДата <> Дата(1,1,1);
		//	
		//	Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		//	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		//	Отбор.ПравоеЗначение = КонецДня(Форма.КонДата);
		//	Отбор.Использование = Форма.КонДата <> Дата(1,1,1);
		//Иначе
		//	Для каждого Отбор ИЗ Отборы Цикл
		//		Если Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата") Тогда
		//			Если Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		//				Отбор.ПравоеЗначение = Форма.НачДата;
		//				Отбор.Использование = Форма.НачДата <> Дата(1,1,1);
		//			ИначеЕсли Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		//				Отбор.ПравоеЗначение = КонецДня(Форма.КонДата);
		//				Отбор.Использование = Форма.КонДата <> Дата(1,1,1);
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;	
		
		Загл = ?(Форма.Параметры.РежимВыбора, НСтр("ru = 'Подбор инвойсов'; en = 'Invoice selection'"), 
											  НСтр("ru = 'Движение инвойсов'; en = 'Invoice progress'")); 
		Если Форма.НачДата = Дата(1,1,1) И Форма.КонДата = Дата(1,1,1) Тогда   
		  	Отбор.Использование = Ложь;
			Форма.Заголовок = Загл + НСтр("ru = ' (все даты)'; en = ' (all dates)'");
		Иначе	
			Форма.Заголовок = СтрШаблон("%1: %2 - %3", Загл, Формат(Форма.НачДата,"ДФ=dd.MM.yy"), Формат(Форма.КонДата,"ДФ=dd.MM.yy"));
		КонецЕсли;											  

		Возврат;
	КонецЕсли;       
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	Форма.Элементы.Список.Период.ДатаНачала = Форма.НачДата;
	Форма.Элементы.Список.Период.ДатаОкончания = Форма.КонДата;
	
	Если Обновить Тогда Форма.Элементы.Список.Обновить() КонецЕсли; 
	
	Доб = "";
	
	Если гоЭто("ОплатаПокупателя, ОплатаПоставщику, ДвижениеДенег, АвансовыйОтчет", Форма.ИмяДокумента) Тогда
		Попытка
			Счет = Форма.ФильтрДСчет;
			Если гоНПЗ(Счет) Тогда Доб = "  /" + СокрЛП(Счет) + "/" КонецЕсли; 
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	//в журналах появляется желтое поле с интервалом, так что наше можно в заголовке и не выводить
	Форма.Заголовок = Форма.ИмяЖурнала + Доб;	// + "  " + "(" + гоИмяИнтервала(Форма.НачДата, Форма.КонДата) + ")"; 
	
КонецПроцедуры

// © Primus1C  25.10.2023  НАЧАЛО ► 

Процедура гоСтандартныйОтборПоПолю(ВариантОтбора, Список, ИмяПоля) Экспорт
	
	лПользователь = гоПользователь(); 
	Если НРег(ВариантОтбора) = "контрагенты" Тогда  
		Если НЕ омСервер.ПолучитьПараметрСеанса("ОграничитьДоступПоКонтрагентам") Тогда
			Возврат;	
		КонецЕсли;
		Если омСервер.ПолучитьПараметрСеанса("ВариантДоступаККонтрагентамРазрешить") Тогда
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		Иначе
			лВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
		КонецЕсли;
	ИначеЕсли НРег(ВариантОтбора) = "склады" Тогда
		Если лПользователь.СкладыИсключать Тогда
			лВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		Иначе
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
	ИначеЕсли НРег(ВариантОтбора) = "денежныесчета" Тогда
		Если лПользователь.ДенежныеСчетаИсключать Тогда
			лВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		Иначе
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
	Иначе
		лВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;
	
	тч = лПользователь[ВариантОтбора];
	Если тч.Количество() = 0 Тогда 
		Возврат; 
	КонецЕсли; 
	мас = тч.ВыгрузитьКолонку(0); 
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения 		= лВидСравнения;
	ЭлементОтбора.ПравоеЗначение 	= Мас;
	
КонецПроцедуры

Процедура гоЗаголовокИнтервалСписка(Форма, Обновить = Истина, ПриОткрытии = Ложь, ИмяЭлементаСписка = "Список", ПолеДаты = "Дата") Экспорт
	
	Отборы = Форма[ИмяЭлементаСписка].Отбор.Элементы;
	
	Если Отборы.Количество() = 0 Тогда
		Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДаты);
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		Отбор.ПравоеЗначение = Форма.НачДата;
		Отбор.Использование = Истина;
		
		Отбор = Отборы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДаты);
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		Отбор.ПравоеЗначение = Форма.КонДата;
		Отбор.Использование = Истина;
	Иначе
		Для каждого Отбор ИЗ Отборы Цикл
			Если Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеДаты) Тогда
				Если Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
					Отбор.ПравоеЗначение = Форма.НачДата;
				ИначеЕсли Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
					Отбор.ПравоеЗначение = Форма.КонДата;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

Процедура гоЖурналПередЗакрытием(Форма, Отказ, СтандартнаяОбработка) Экспорт
	Форма.НачДата = Форма.Элементы.Список.Период.ДатаНачала;
	Форма.КонДата = Форма.Элементы.Список.Период.ДатаОкончания;
	
	Если Форма.Элементы.Список.РежимВыбора Тогда Возврат КонецЕсли;
	
	Форма.ПоследнийДокумент = Форма.Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

Процедура гоЖурналПриОткрытии(Форма, Отказ) Экспорт
	//Если Форма.Элементы.Список.РежимВыбора Тогда Возврат КонецЕсли;
	//
	//Форма.Элементы.Список.ТекущаяСтрока = Форма.ПоследнийДокумент;
КонецПроцедуры

Функция гоДата(Дат) Экспорт
	Возврат Формат(Дат, "ДФ=dd.MM.yyyy");
КонецФункции
 
Функция гоДата2(Дат) Экспорт
	Если гоПЗ(Дат) Тогда Возврат "  .  .  " КонецЕсли; 
	Возврат Формат(Дат, "ДФ=dd.MM.yy");
КонецФункции

Процедура гоВидимостьДоступностьЭлементаФормы(Форма, Имя, Можно) Экспорт
	Элемент = Форма.Элементы.Найти(Имя);
	Если Элемент = Неопределено Тогда Возврат КонецЕсли;
	
	Элемент.Видимость = Можно;
	Элемент.Доступность = Можно;
КонецПроцедуры

Процедура гоФормаСпискаПриСоздании(Форма) Экспорт
	Можно = гоЕстьРоль("РазрешитьНастройкуСписка");
	МожноФорму = гоЕстьРоль("РазрешитьИзменятьФорму");
	
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаНастройкаСписка", Можно);
	
	//для списков документов просто прячем интервал, у нас везде свои кнопки для него
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаИнтервал", Ложь);
	
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаИзменитьФорму", МожноФорму);
	
	Попытка
		//ПриходУслуг и АктУслуг и Счет - копировать можно
		Если гоЭто("ВозвратПокупателя, РасходнаяНакладная, ПриходнаяНакладная, ВозвратПоставщику, Перемещение", Форма.ИмяДокумента) Тогда  
			гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаСкопировать", Ложь);
		КонецЕсли; 
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	Попытка
		Форма.Элементы.ФормаОбновить.ТолькоВоВсехДействиях = Ложь;
		Форма.Элементы.ФормаОбновить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Исключение
	КонецПопытки; 
	
	//2016.01.30
	//это отключит окошко для поиска, которое не дает пользоваться старым вариантом поиска, когда при первой букве появляется окно
	Попытка
		Форма.Элементы.Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
	Исключение
	КонецПопытки; 
КонецПроцедуры
 
Функция гоИзбранный(Тек, ТолькоПривязки = 0) Экспорт
	//ВидДок = гоДокИмя(Тек);
	//
	////2015.01.05
	////делаю пока одинаково, а то у нас и этого не было вообще, работаем только не вчера
	//ТекДата = гоТекущаяДата();
	//
	////счета не проверяем
	//
	//Если гоЭто("Накладная, ВозвратПокупателя, ПриемныйАкт, Перемещение, ВозвратПоставщику, АктУслуг, ПриходУслуг", ВидДок) Тогда
	//	Если гоПЗ(Тек) Тогда Возврат Ложь КонецЕсли; 
	//	Если гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("КомуВчераСклад") Тогда Возврат Ложь КонецЕсли;
	//	
	//	ДокДата = НачалоДня(гоРеквизит(Тек, "Дата"));
	//	Если ДокДата >= ТекДата Тогда Возврат Ложь КонецЕсли;
	//	
	//	Возврат Истина;
	//КонецЕсли; 
	//
	//Если гоЭто("ОплатаПокупателя, ОплатаПоставщику, ДвижениеДенег, АвансовыйОтчет, НачислениеЗП", ВидДок) Тогда
	//	Если гоПЗ(Тек) Тогда Возврат Ложь КонецЕсли; 
	//	Если гоМельник() ИЛИ гоКолинко() ИЛИ гоЕстьРоль("КомуВчераДеньги") Тогда Возврат Ложь КонецЕсли;
	//	
	//	ДокДата = НачалоДня(гоРеквизит(Тек, "Дата"));
	//	Если ДокДата >= ТекДата Тогда Возврат Ложь КонецЕсли;
	//	
	//	//2015.01.20
	//	//вот тут мы запрещаем все вчерашнее и в результате никто не может привязать старую предоплату
	//	//решили, что можно отдать на только привязки текущий месяц
	//	Если гоЭто("ОплатаПокупателя, ОплатаПоставщику", ВидДок) Тогда
	//		Если Месяц(ДокДата) = Месяц(ТекущаяДата()) Тогда ТолькоПривязки = 1 КонецЕсли; КонецЕсли;
	//	
	//	Возврат Истина;
	//КонецЕсли; 
	
	Возврат Ложь;
КонецФункции

Функция гоСуммаЗн(Чис, Зн = 2, локПре = "", локСуф = "", НеПроверятьНоль = Ложь) Экспорт
	локЧис = Окр(Чис, Зн);
	
	Если НЕ НеПроверятьНоль Тогда
		Если локЧис = 0 Тогда Возврат "" КонецЕсли; КонецЕсли; 
	
	Возврат локПре + Формат(локЧис, "ЧДЦ=" + Зн + "; ЧН=") + локСуф;
КонецФункции

Функция гоСумма2(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 2, локПре, локСуф);
КонецФункции

Функция гоСумма2н(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 2, локПре, локСуф, Истина);
КонецФункции

Функция гоСумма4(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 4, локПре, локСуф);
КонецФункции

Функция гоЦена2(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 2, локПре, локСуф);
КонецФункции

Функция гоЦена3(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 3, локПре, локСуф);
КонецФункции

Функция гоЦена4(Чис, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗн(Чис, 4, локПре, локСуф);
КонецФункции

Функция гоСуммаЗнВал(Чис, Вал, Зн = 2, локПре = "", локСуф = "") Экспорт
	локЧис = Окр(Чис, Зн);
	
	//2015.07.05
	Попытка
		стрВал = СокрЛП(гоРеквизит(Вал, "Обозначение"));
	Исключение
		стрВал = СокрЛП(Вал);
	КонецПопытки; 
	
	Возврат локПре + Формат(локЧис, "ЧН=; ЧДЦ=" + Зн) + " " + стрВал + локСуф;
КонецФункции

Функция гоСуммаЗнВалН(Чис, Вал, Зн = 2, локПре = "", локСуф = "") Экспорт
	локЧис = Окр(Чис, Зн);
	
	Если локЧис = 0 Тогда Возврат "" КонецЕсли;
	
	Возврат локПре + Формат(локЧис, "ЧДЦ=" + Зн) + " " + СокрЛП(Вал.Обозначение) + локСуф;
КонецФункции

Функция гоСуммаВал2(Чис, Вал, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗнВал(Чис, Вал, 2, локПре, локСуф);
КонецФункции

Функция гоЦенаВал2(Чис, Вал, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗнВал(Чис, Вал, 2, локПре, локСуф);
КонецФункции

Функция гоЦенаВал3(Чис, Вал, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗнВал(Чис, Вал, 3, локПре, локСуф);
КонецФункции

Функция гоЦенаВал4(Чис, Вал, локПре = "", локСуф = "") Экспорт
	Возврат гоСуммаЗнВал(Чис, Вал, 4, локПре, локСуф);
КонецФункции

Функция гоПустой(Имя) Экспорт
	Возврат омСервер.ПустойСправочник(Имя);
КонецФункции

Функция гоПустойДок(Имя) Экспорт
	Возврат омСервер.ПустойДокумент(Имя);
КонецФункции

Процедура гоФормаОтчетаСКДПриСоздании(Форма) Экспорт
	Можно = гоЕстьРоль("РазрешитьВариантыОтчетов");
	
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаИзменитьВариант", Можно);
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаЗагрузитьВариант", Можно);
	гоВидимостьДоступностьЭлементаФормы(Форма, "ФормаСохранитьВариант", Можно);
КонецПроцедуры

Процедура гоФормаОтчетаСКДПриОткрытии(Форма, НадоМагазины = Истина, НадоКассы = Истина) Экспорт
	Если Форма.НаименованиеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	//Если НадоМагазины Тогда  
	//	МасМаг = гоПараметрСеанса("Магазины");
	//	//ВсеМаг = гоПараметрСеанса("ВсеМагазины");
	//	
	//	Если МасМаг.Количество() = 0 Тогда 
	//		гоУстановитьПараметр(Форма.Отчет, "Магазины", , Истина);	//попробуем просто снять
	//	Иначе 
	//		гоУстановитьПараметр(Форма.Отчет, "Магазины", МасМаг);
	//	КонецЕсли; 
	//КонецЕсли; 
	//
	//Если НадоКассы Тогда  
	//	МасКас = гоПараметрСеанса("Кассы");
	//	
	//	Если МасКас.Количество() = 0 Тогда 
	//		гоУстановитьПараметр(Форма.Отчет, "Кассы", , Истина);	//попробуем просто снять
	//	Иначе 
	//		гоУстановитьПараметр(Форма.Отчет, "Кассы", МасКас);
	//	КонецЕсли; 
	//КонецЕсли; 
	
	Форма.ВариантМодифицирован = Ложь;
КонецПроцедуры

Функция гоПолучитьПараметрСеанса(Имя) Экспорт
	Возврат омСервер.ПолучитьПараметрСеанса(Имя);
КонецФункции

Процедура гоУстановитьПараметрСеанса(Имя, Зна) Экспорт
	Пар = Зна;
	Если (Имя = "Склад") И (Зна = 0) Тогда Пар = гоПустой("Склады") КонецЕсли; 
	Если (Имя = "Номенклатура") И (Зна = 0) Тогда Пар = гоПустой("Номенклатура") КонецЕсли; 
	//2015.12.20
	Если (Имя = "ВалютаВыбора") И (Зна = 0) Тогда Пар = гоПустой("Валюты") КонецЕсли; 
	//2015.12.24
	Если (Имя = "ПоставщикВыбора") И (Зна = 0) Тогда Пар = гоПустой("Контрагенты") КонецЕсли;
	
	омСервер.УстановитьПараметрСеанса(Имя, Пар);
КонецПроцедуры

Процедура гоУстановитьКонстанту(Имя, Зна) Экспорт
	омСервер.УстановитьКонстанту(Имя, Зна);
КонецПроцедуры

Функция гоЭтоДок(Тек, Имя) Экспорт
	Возврат ТипЗнч(Тек) = Тип("ДокументСсылка." + Имя);
КонецФункции

Функция гоЭтоСпр(Тек, Имя) Экспорт
	Возврат ТипЗнч(Тек) = Тип("СправочникСсылка." + Имя);
КонецФункции

Функция гоВидДолгов(ДолгПоставщику, ПредоплатаПоставщику, ДолгПокупателя, ПредоплатаПокупателя) Экспорт
	Если ДолгПоставщику > 0 Тогда Возврат гоПеречисление("ВидДолгов.ДолгПоставщику");
	ИначеЕсли ДолгПоставщику < 0 Тогда Возврат гоПеречисление("ВидДолгов.ПредоплатаПоставщику");
	ИначеЕсли ПредоплатаПоставщику > 0 Тогда Возврат гоПеречисление("ВидДолгов.ПредоплатаПоставщику");
	ИначеЕсли ПредоплатаПоставщику < 0 Тогда Возврат гоПеречисление("ВидДолгов.ДолгПоставщику");
	ИначеЕсли ДолгПокупателя > 0 Тогда Возврат гоПеречисление("ВидДолгов.ДолгПокупателя");
	ИначеЕсли ДолгПокупателя < 0 Тогда Возврат гоПеречисление("ВидДолгов.ПредоплатаПокупателя");
	ИначеЕсли ПредоплатаПокупателя > 0 Тогда Возврат гоПеречисление("ВидДолгов.ПредоплатаПокупателя");
	ИначеЕсли ПредоплатаПокупателя < 0 Тогда Возврат гоПеречисление("ВидДолгов.ДолгПокупателя");
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция гоПересчитать(Сумма, ИзВалюты, ВВалюту, Фирма, НаДату = 0, умВалюта = 0, Зн = 2) Экспорт
	Если НЕ ЗначениеЗаполнено(ИзВалюты) Тогда Возврат 0 КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВВалюту) Тогда
		Если умВалюта = 0 Тогда Возврат 0 КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(умВалюта) Тогда Возврат 0 КонецЕсли; 
		ВалютаПересчета = умВалюта;
	Иначе
		ВалютаПересчета = ВВалюту;
	КонецЕсли; 
	
	Возврат омСервер.ПересчетЗн(Сумма, ИзВалюты, ВалютаПересчета, Фирма, НаДату, Зн);
КонецФункции

Функция гоПересчитатьНа(Сумма, ИзВалюты, ВВалюту, Фирма, Знач НаДату = 0, умВалюта = 0, Зн = 2) Экспорт
	Если НЕ ЗначениеЗаполнено(ИзВалюты) Тогда Возврат 0 КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВВалюту) Тогда
		Если умВалюта = 0 Тогда Возврат 0 КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(умВалюта) Тогда Возврат 0 КонецЕсли; 
		ВалютаПересчета = умВалюта;
	Иначе
		ВалютаПересчета = ВВалюту;
	КонецЕсли; 
	
	Если НЕ (НаДату = 0) Тогда
		Если НЕ ЗначениеЗаполнено(НаДату) Тогда 
			НаДату = КонецДня(гоТекущаяДата());
		Иначе
			НаДату = КонецДня(НаДату);
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат омСервер.ПересчетЗн(Сумма, ИзВалюты, ВалютаПересчета, Фирма, НаДату, Зн);
КонецФункции

Функция гоКурс(Валюта, Фирма, НаДату = 0) Экспорт
	Возврат омСервер.Курс(Валюта, Фирма, НаДату);
КонецФункции

Функция гоПересчетЗн(Сумма, ИзВалюты, ВВалюту, Фирма, НаДату = 0, Зн = 2) Экспорт
	Возврат омСервер.ПересчетЗн(Сумма, ИзВалюты, ВВалюту, Фирма, НаДату, Зн);
КонецФункции

Функция гоСледПолеТаб(Стр, Чис = 0) Экспорт
	Поз = Найти(Стр, гоТБ());
	
	Если Поз = 0 Тогда 
		Рез = СокрЛП(Стр);
		Стр = "";
	Иначе 
		Рез = СокрЛП(Лев(Стр, Поз - 1));
		Стр = Сред(Стр, Поз + 1);
	КонецЕсли;
	
	Если (Чис = 1) ИЛИ (Чис = "Число") Тогда
		Попытка
			Рез = Число(СтрЗаменить(Рез, " ", ""));
		Исключение
			Рез = 0;
		КонецПопытки;
	ИначеЕсли (Чис = 2) ИЛИ (Чис = "Дата") Тогда
		Попытка
			//Рез = Дата(Рез);
			Рез = гоСтрДата(Рез);
		Исключение
			Рез = гоПустаяДата();
		КонецПопытки;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция гоСтрДата(лСтр) Экспорт
	Стр = СокрЛП(лСтр);
	Если Стр = "" Тогда Возврат гоПустаяДата() КонецЕсли;
	Если Стр = ".  ." Тогда Возврат гоПустаяДата() КонецЕсли;
	
	лДен = Число(Сред(Стр, 1, 2));
	лМес = Число(Сред(Стр, 4, 2));
	лГод = Число(Сред(Стр, 7));	//сколько будет, пусть столько и берет
	
	Если лГод < 60 Тогда лГод = лГод + 2000 Иначе лГод = лГод + 1900 КонецЕсли; 
	
	Возврат Дата(лГод, лМес, лДен);
КонецФункции

Функция гоПроцентНаценки2(Знач Сум, Знач ЗакСум) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если (ЗакСум = 0) ИЛИ (Сум = 0) Тогда Возврат 0 КонецЕсли;
	
	Возврат Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 2);
КонецФункции

Функция гоПроцентНаценкиСтрока(Знач Сум, Знач ЗакСум, Зн = 0) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли;
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли;
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если (ЗакСум = 0) И (Сум = 0) Тогда Возврат "?" КонецЕсли;
	Если (ЗакСум = 0) ИЛИ (Сум = 0) Тогда Возврат "" КонецЕсли;
	
	Про = Окр((Сум - ЗакСум) * 100.00 / ЗакСум, Зн);
	Если Про = 0 Тогда Возврат "" КонецЕсли; 
	
	Возврат Строка(Про);
КонецФункции
	
Функция гоПроцентНаценки1(Знач Сум, Знач ЗакСум) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если (ЗакСум = 0) ИЛИ (Сум = 0) Тогда Возврат 0 КонецЕсли;
	
	Возврат Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 1);
КонецФункции
	
Функция гоПроцентНаценки0(Знач Сум, Знач ЗакСум) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если (ЗакСум = 0) ИЛИ (Сум = 0) Тогда Возврат 0 КонецЕсли;
	
	Возврат Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 0);
КонецФункции

Функция гоПроцент1ДляОтчета(Знач Сум, Знач ЗакСум) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если ЗакСум = 0 Тогда Возврат 0 КонецЕсли;
	Если Сум = 0 Тогда Возврат 0 КонецЕсли;
	
	Если Сум = ЗакСум Тогда Возврат 0 КонецЕсли;
	
	Возврат Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 1);
КонецФункции

Функция гоПроцент1(Знач Сум, Знач ЗакСум) Экспорт
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если ЗакСум = 0 Тогда Возврат "?" КонецЕсли;
	Если Сум = 0 Тогда Возврат "0%" КонецЕсли;
	
	Если Сум = ЗакСум Тогда Возврат "" КонецЕсли;
	
	Возврат гоСуммаЗн(Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 1), 1) + "%";
КонецФункции

Функция гоПроцент0(Знач Сум, Знач ЗакСум, НольПустойСтрокой = Ложь) Экспорт
	//Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	//Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	//
	//Попытка
	//	Если ЗакСум = 0 Тогда КонецЕсли; 
	//Исключение
	//    ЗакСум = 0
	//КонецПопытки; 
	//
	//Попытка
	//	Если Сум = 0 Тогда КонецЕсли; 
	//Исключение
	//    Сум = 0;
	//КонецПопытки; 
	//
	//Если ЗакСум = 0 Тогда Возврат "?" КонецЕсли;
	//Если Сум = 0 Тогда Возврат ?(НольПустойСтрокой, "", "0%") КонецЕсли;
	//
	//Если Сум = ЗакСум Тогда Возврат "" КонецЕсли;
	//
	//Возврат гоСуммаЗн(Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 0), 0) + "%";
	//ВКД++
	
	Если НЕ ТипЗнч(Сум) = Тип("Число") Тогда Сум = 0 КонецЕсли; 
	Если НЕ ТипЗнч(ЗакСум) = Тип("Число") Тогда ЗакСум = 0 КонецЕсли; 
	
	Попытка
		Если ЗакСум = 0 Тогда КонецЕсли; 
	Исключение
	    ЗакСум = 0
	КонецПопытки; 
	
	Попытка
		Если Сум = 0 Тогда КонецЕсли; 
	Исключение
	    Сум = 0;
	КонецПопытки; 
	
	Если ЗакСум = 0 Тогда Возврат "?" КонецЕсли;
	Если Сум = 0 Тогда Возврат ?(НольПустойСтрокой, "", "0%") КонецЕсли;
	
	Если Сум = ЗакСум Тогда Возврат "" КонецЕсли;
	
	Возврат гоСуммаЗн(Окр((Сум - ЗакСум) * 100.00 / ЗакСум, 0), 0) + "%";

	

	//ВКД--
КонецФункции

Функция гоСуммаПрописьюВал(Знач Сумма, Знач Валюта) Экспорт
	СтрЦел = СокрЛП(гоРеквизит(Валюта, "Обозначение"));
	СтрКоп = СокрЛП(гоРеквизит(Валюта, "Копейки"));
	
	ФорматнаяСтрока = "Л=ru_RU;";
	ПараметрыПрописи = "" + СтрЦел + ", " + СтрЦел + ", " + СтрЦел + ", ж, " + СтрКоп + ", " + СтрКоп + ", " + СтрКоп + ", ж, 2";
    ПрефиксМинус = "Минус";
		
	Возврат ?(Сумма < 0, ПрефиксМинус, "") + ЧислоПрописью(Сумма, ФорматнаяСтрока, ПараметрыПрописи);
КонецФункции
 
Процедура гоВставитьКучу(С, Поля) Экспорт
	Строки = СтрЗаменить(Поля, ",", гоРС());
	
	Для Н = 1 По СтрЧислоСтрок(Строки) Цикл
		С.Вставить(СокрЛП(СтрПолучитьСтроку(Строки, Н)), "");
	КонецЦикла; 
КонецПроцедуры

Функция гоАбс(Чис) Экспорт
	Возврат ?(Чис < 0, - Чис, Чис);
КонецФункции

Функция гоМесяцГод(Дат) Экспорт;
	Возврат гоЧислоНулиСлева(Месяц(Дат), 2) + "." + гоЧислоНулиСлева(Год(Дат), 4);
КонецФункции
 
Функция гоЦвет(Кра = 0, Зел = 0, Син = 0) Экспорт
	Возврат Макс(0, Син) * 65536 + Макс(0, Зел) * 256 + Макс(0, Кра);
КонецФункции
 
Процедура гоЦветОбратно(Цвет, Кра, Зел, Син) Экспорт
	Чис = Цвет;
	
	Син = Цел(Чис / 65536);
	Чис = Чис - (Син * 65536);
	
	Зел = Цел(Чис / 256);
	Чис = Чис - (Зел * 256);
	
	Кра = Чис;   

КонецПроцедуры

// © Primus1C  10.07.2023  НАЧАЛО ►  

Функция гоЦветРГБ(Цвет) Экспорт

	мас = СтрРазделить(Цвет, ",");
	Если мас[0] = "" Тогда
		Р = 0;
		Г = 0;
		Б = 0;
	Иначе
		Р = Число(мас[0]);
		Г = Число(мас[1]);
		Б = Число(мас[2]);
	КонецЕсли;
	Возврат Новый Цвет (Р, Г, Б);

КонецФункции // ()

Функция гоУстановитьЗначениеНезаполненого(Реквизит, ЗначениеРеквизита) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Реквизит) Тогда
		Реквизит = ЗначениеРеквизита
	КонецЕсли;

КонецФункции

// © Primus1C  ОКОНЧАНИЕ ◄

Функция гоМонопольныйРежим() Экспорт
//2016.02.22	
	Возврат омСервер.МонопольныйРежимСервер();
КонецФункции

Функция гоЕстьДвиженияПартии(Пар, ТекДок, ВернутьВсе = Ложь) Экспорт
//2016.02.22	
	Возврат омСервер.ЕстьДвиженияПартии(Пар, ТекДок, ВернутьВсе);
КонецФункции

Процедура гоПровестиДокументыСервер(СпиДок, РезСоо = "", Сче = 0) Экспорт
//2016.02.22	
	омСервер.ПровестиДокументыСервер(СпиДок, РезСоо, Сче);
КонецПроцедуры 

Функция гоСредняяЦена(ЛокКол, ЛокСум, Зн = 2) Экспорт
//2016.05.17

	Попытка
		Кол = Число(ЛокКол);
	Исключение
		Кол = 0;
	КонецПопытки; 
	Попытка
		Сум = Число(ЛокСум);
	Исключение
		Сум = 0;
	КонецПопытки;
	
	Если Кол = 0 Тогда Возврат 0 КонецЕсли;
	Если Сум = 0 Тогда Возврат 0 КонецЕсли;
	
	Возврат Окр(Сум / Кол, Зн);
КонецФункции

Процедура гоУстановитьПараметр(Отчет, Имя, Зна, Снять = Ложь, ЭтоСписок = Ложь) Экспорт
//2016.09.16

	ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Имя));
	Если Параметр <> Неопределено Тогда
		Параметр.Использование = НЕ Снять;
		Если ЭтоСписок Тогда 
			Параметр.Значение.Очистить();
			Параметр.Значение.Добавить(Зна);
		Иначе 
			Параметр.Значение = Зна;
		КонецЕсли; 
	Иначе
		Если гоАдминистратор() Тогда
			Сообщить("Не удалось установить параметр " + гоИмя(Имя) + "! Обратитесь к администратору!") КонецЕсли; 
		КонецЕсли;  
		
КонецПроцедуры
