&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Валюта = Параметры.Валюта;
	Количество = Параметры.Количество;
	Цена = Параметры.Цена;
	Фирма = Параметры.Фирма;
	Номенклатура = Параметры.Номенклатура;
	Партия = Параметры.Партия;
	
	ЭтаФорма.Заголовок = гоИмя(партия, Ложь);
	
	Склад = ?(Параметры.Свойство("Склад"), Параметры.Склад, 0);
	ЦенаЗакупки = ?(Параметры.Свойство("ЦенаЗакупки"), Параметры.ЦенаЗакупки, 0);
	
	стрОстаток = "";
	стрЦена = "";
	
	Если гоНПЗ(Партия) И гоНПЗ(Склад) Тогда
		стрОстаток = гоИмя(Склад) + НСтр("ru = ': ост. партии = '; en = ': rest of batch = '") + омСервер.ОстатокПартии(Фирма, Склад, Партия);
	КонецЕсли; 
	
	Если ЦенаЗакупки <> 0 Тогда  
		стрЦена = НСтр("ru = 'цена закупки (по курсу в валюте продажи) = '; en = 'purchase price (at the exchange rate in the sales currency) = '") + гоСуммаЗн(ЦенаЗакупки, Фирма.ЧислоЗнаковЦенаЗакупки) + " " + Валюта;
	КонецЕсли; 
	
	Элементы.Количество.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковКоличество;
	Элементы.Цена.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковЦена;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	Если Цена = 0 Тогда клОшибка(НСтр("ru = 'Не введена цена!'; en = 'No price entered!'")); Возврат; КонецЕсли; 
	
	Пар = Новый Структура;
	Пар.Вставить("Количество", Количество);
	Пар.Вставить("Цена", Цена);
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры
