Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Перемещения";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента_(Тек, Поз, Таб, Параметры = 0) Экспорт
	
	Таб.Очистить();
	
	М = Документы.Перемещение.ПолучитьМакет("Печать");
	С = Новый Структура;
	гоВставитьКучу(С, "Загол, ИмяПокупателя1, ИмяПоставщика1");
	гоВставитьКучу(С, "ДопНомера, НомерПП, лНоменклатура, лЕИ, лКоличество, лЦена, лСумма, сКоличество, СтрСНДС");
	гоВставитьКучу(С, "лВалюта");
	
	С.Загол = стрШаблон(НСтр("ru = 'Перемещение № %1 от %2'; en = 'Transfer № %1 (%2)'"), Тек.Номер, гоДата(Тек.Дата));
	С.ИмяПоставщика1 = "";
	С.ИмяПокупателя1 = "";

	Если гоНПЗ(Тек.Склад) Тогда
		С.ИмяПоставщика1 = СокрЛП(Тек.Склад);
	КонецЕсли;
	
	Если гоНПЗ(Тек.Куда) Тогда
		С.ИмяПокупателя1 = СокрЛП(Тек.Куда);
	КонецЕсли;
	
	Фикс = 4;
	ВывестиСекцию(Таб, М, "ШапкаП1", С); гоПлюс(Фикс);
	ВывестиСекцию(Таб, М, "ШапкаК1", С); гоПлюс(Фикс);
	
	ВывестиСекцию(Таб, М, "Шапка", С);
	
	Табл = Тек.Товары.Выгрузить();
	Табл.Свернуть("Номенклатура, ЦенаЗакупки", "Количество, СуммаЗакупки");
	
	С.лВалюта = СокрЛП(Тек.Валюта);
	
	ЧислоЗнаковЦена = Тек.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	НомерПП = 0;
	Для Каждого _Табл Из Табл Цикл
		гоПлюс(НомерПП);
		
		С.лНоменклатура = гоИмя(_Табл.Номенклатура, Ложь);
		С.НомерПП = НомерПП;
		С.лЕИ = НСтр("ru = 'шт.'; en = 'pc.'");
		С.лКоличество = _Табл.Количество;
		С.лЦена = гоСуммаЗн(_Табл.ЦенаЗакупки, ЧислоЗнаковЦена);
		С.лСумма = гоЦена2(_Табл.СуммаЗакупки);
		
		ВывестиСекцию(Таб, М, "Строка", С);
	КонецЦикла;
	
	С.лКоличество = Табл.Итог("Количество");
	С.лСумма = гоЦена2(Тек.Сумма);
	С.СтрСНДС = гоСуммаПрописьюВал(Тек.Сумма, Тек.Валюта);
		
	ВывестиСекцию(Таб, М, "Подвал", С);
	
	глПараметрыСтраницы(Таб, 1);
	глПовторятьПриПечатиСтроки(Таб, Фикс, Фикс);
КонецПроцедуры

Процедура ВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) 
	Ш = Макет.ПолучитьОбласть(Область); 
	Ш.Параметры.Заполнить(Параметры);  
	Если Уровень=Неопределено Тогда
		Таб.Вывести(Ш);
	Иначе
		Таб.Вывести(Ш, Уровень);
	КонецЕсли;
КонецПроцедуры

// © Primus1C  23.10.2025  НАЧАЛО ►

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СПФ = Новый Структура("БезСерий",  
							НСтр("ru='Перемещение';en='Transfer'") 
							//НСтр("ru='Перемещение (по сериям)';en='Transfer (with series)'")		
							);		
	//Если РольДоступна("Администратор") ИЛИ РольДоступна("Логистика") ИЛИ РольДоступна("Бухгалтерия") ИЛИ РольДоступна("ИнвойсТоварный") ИЛИ РольДоступна("ИнвойсЗакупки") Тогда
		СПФ.Вставить("ПоИнвойсам", НСтр("ru='Перемещение (по инвойсам)';en='Transfer (invoices)'"));		
		СПФ.Вставить("ПоИнвойсамЗаДень", НСтр("ru='Перемещения за день (по инвойсам)';en='Daily transfer (invoices)'"));		
	//КонецЕсли;						
							
	Возврат СПФ;						
							
КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	Если ВариантПечатнойФормы = "БезСерий" ИЛИ ВариантПечатнойФормы = "ПоСериям" Тогда
		
		Если ВариантПечатнойФормы = "БезСерий" Тогда
			поз = 1;
		Иначе
			поз = 2;
		КонецЕсли;
		ПечатьДокумента_(ДокСсылка, Поз, ТабДокумент);
		
	Иначе
		
		ТабДокумент.Очистить();  
		Макет = Документы.РасходнаяНакладная.ПолучитьМакет(ВариантПечатнойФормы);
		
		ЗапрШ = Новый Запрос;
		ЗапрШ.УстановитьПараметр("Ссылка", ДокСсылка);
		ЗапрШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ));
		ЗапрШ.Текст = "ВЫБРАТЬ
	             |	Накладная.Номер КАК Номер,
	             |	Накладная.Дата КАК Дата,
	             |	Накладная.Контрагент КАК Контрагент,
	             |	Накладная.Сумма КАК Сумма,
	             |	Накладная.Валюта КАК Валюта,
	             |	Накладная.Склад КАК Склад,      
				 |	Накладная.Куда КАК Куда,
	             |	Накладная.Количество КАК Количество,
	             |	ВЫРАЗИТЬ(Накладная.Примечание КАК СТРОКА(1000)) КАК Примечание,
	             |	&ПредставлениеДокумента КАК ПредставлениеДокумента 
	             |ИЗ
	             |	Документ.Перемещение КАК Накладная
	             |ГДЕ
	             |	Накладная.Ссылка = &Ссылка";   
		//ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрШ.Текст, "Накладная.Контрагент");	
		Шапка = ЗапрШ.Выполнить().Выбрать();
		Шапка.Следующий(); 
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка); 
	
		ЗапрИ = Новый Запрос;
		ЗапрИ.Текст = "ВЫБРАТЬ
		              |	РНТовары.Номенклатура КАК Номенклатура,
		              |	РНТовары.Партия.Док.ВКД_Инвойс КАК Инвойс,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Контрагент КАК Поставщик,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Дата КАК ДатаИнвойса,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика КАК НомерИнвойсаПоставщика,
		              |	СУММА(РНТовары.Количество) КАК Количество,
		              |	ИнвТовары.Количество КАК КоличествоИнвойс,
		              |	РНТовары.Ссылка.Контрагент КАК Покупатель,
		              |	РНТовары.Ссылка.Валюта КАК Валюта,
		              |	ИнвИтог.Количество КАК ИтКоличествоИнвойс
		              |ИЗ
		              |	Документ.Перемещение.Товары КАК РНТовары
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			ИнвойсТовары.Ссылка КАК Ссылка,
		              |			ИнвойсТовары.Номенклатура КАК Номенклатура,
		              |			СУММА(ИнвойсТовары.Количество) КАК Количество
		              |		ИЗ
		              |			Документ._Инвойс.ВКД_Товары КАК ИнвойсТовары
		              |		
		              |		СГРУППИРОВАТЬ ПО
		              |			ИнвойсТовары.Ссылка,
		              |			ИнвойсТовары.Номенклатура) КАК ИнвТовары
		              |		ПО РНТовары.Партия.Док.ВКД_Инвойс = ИнвТовары.Ссылка
		              |			И РНТовары.Номенклатура = ИнвТовары.Номенклатура
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			СУММА(_ИнвойсВКД_Товары.Количество) КАК Количество,
		              |			_ИнвойсВКД_Товары.Ссылка КАК Ссылка
		              |		ИЗ
		              |			Документ._Инвойс.ВКД_Товары КАК _ИнвойсВКД_Товары
		              |		
		              |		СГРУППИРОВАТЬ ПО
		              |			_ИнвойсВКД_Товары.Ссылка) КАК ИнвИтог
		              |		ПО РНТовары.Партия.Док.ВКД_Инвойс = ИнвИтог.Ссылка
		              |ГДЕ
		              |	РНТовары.Ссылка.Склад = &Склад
		              |	И ВЫБОР
		              |			КОГДА &ЗаДень
		              |				ТОГДА РНТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		              |			ИНАЧЕ РНТовары.Ссылка = &Ссылка
		              |		КОНЕЦ
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	РНТовары.Номенклатура,
		              |	РНТовары.Партия.Док.ВКД_Инвойс,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Контрагент,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Дата,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика,
		              |	ИнвТовары.Количество,
		              |	РНТовары.Ссылка.Контрагент,
		              |	РНТовары.Ссылка.Валюта,
		              |	ИнвИтог.Количество
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	Поставщик,
		              |	НомерИнвойсаПоставщика,
		              |	Номенклатура
		              |АВТОУПОРЯДОЧИВАНИЕ";
		ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрИ.Текст, "РНТовары.Партия.Док.ВКД_Инвойс.Контрагент");	
		ЗапрИ.УстановитьПараметр("Ссылка", ДокСсылка);
		ЗапрИ.УстановитьПараметр("Склад", ДокСсылка.Склад);
		ЗапрИ.УстановитьПараметр("Дата", ДокСсылка.Дата);
		ЗапрИ.УстановитьПараметр("ЗаДень", ВариантПечатнойФормы = "ПоИнвойсамЗаДень");
		
		Ном = 0;
		ИтКоличество = 0; 
		ВыборкаИ = ЗапрИ.Выполнить().Выбрать();
		Пока ВыборкаИ.Следующий() Цикл     
			ИтКоличество = ИтКоличество + ВыборкаИ.Количество;  
			Ном = Ном + 1;
			//ОбластьДно.Параметры.Ном = Ном;
			глВывестиСекцию(ТабДокумент, Макет, "Строка", ВыборкаИ); 
		КонецЦикла;
		
		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(Шапка);
		ОбластьДно.Параметры.ИтКоличество = ИтКоличество;
		//ОбластьДно.Параметры.СуммаПрописью = гоСуммаПрописьюВал(Шапка.Сумма, Шапка.Валюта);
		ТабДокумент.Вывести(ОбластьДно);
	
	КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄