 // © Primus1C  31.10.2025  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	//глПокраситьСтатусы(ЭтаФорма, "Список", Истина, Ложь, Ложь); 
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глПокраситьВалюты(ЭтаФорма, "Валюта");

	глУстановитьГраницуВидимости(Список);

	Если ЭтаФорма.Параметры.Свойство("ВыбранныеДокументы") Тогда
		
		//Если ЭтаФорма.Параметры.Свойство("СкладОтправитель") Тогда
		//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	ЭлементОтбора.Использование 	= Истина;
		//	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Склад");
		//	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		//	ЭлементОтбора.ПравоеЗначение 	= ЭтаФорма.Параметры.СкладОтправитель;
		//Иначе
			гоСтандартныйОтборПоПолю("Склады", 	Список, "Склад");
		//КонецЕсли;

		ВыбранныеДокументы = ЭтаФорма.Параметры.ВыбранныеДокументы;
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ключ");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ВыбранныеДокументы;
		
		Отб.Представление = "Ключ";
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение); 
		
	Иначе
		гоСтандартныйОтборПоПолю("Склады", Список, "Склад");
	КонецЕсли; 
	

	Если ЭтаФорма.Параметры.Свойство("ВидимостьКнопкиВыбора") Тогда    
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый;
    	Элементы.ФормаВыбрать.Видимость = ЭтаФорма.Параметры.ВидимостьКнопкиВыбора;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	гоЗаголовокИнтервал(ЭтаФорма, Истина); 

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(Ключ)

	ВыбранныеДокументы.Добавить(Ключ);
	
	Для каждого ЭлементУО Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементУО.Представление = "Ключ" Тогда
			Список.УсловноеОформление.Элементы.Удалить(ЭлементУО);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
	
	Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование = Истина;
	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ключ");
	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	Отб.ПравоеЗначение = ВыбранныеДокументы;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//Если Поле.Имя = "Ссылка" Тогда                                        
	//	СтандартнаяОбработка = Ложь;
	//	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка); 
	//Иначе
		Если Этаформа.Параметры.РежимВыбора Тогда 
			//+++
			Если Элемент.ТекущиеДанные <> Неопределено Тогда
				ПоследнийДокумент 	= Элемент.ТекущиеДанные.Ссылка;
				//ПоследняяПоставка	= Элемент.ТекущиеДанные.Поставка;
				//ПоследнееОтправлено = Элемент.ТекущиеДанные.Отправлено;
			КонецЕсли;			
			//---
			ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Ключ); 
			Элемент.Обновить();
		КонецЕсли;
	//КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
