&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли; 
	// © Primus1C  13.07.2023  НАЧАЛО ►
	Если РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") ИЛИ РольДоступна("Администратор") Тогда  
		Элементы.ГруппаИмя.Видимость = Истина;
	Иначе 
		Элементы.ГруппаИмя.Видимость = Ложь;
		Элементы.Псевдоним.Заголовок = "Наименование";
		Если РольДоступна("ИзменениеОтсрочки") Тогда
			Мас = Новый Массив;
			Мас.Добавить("ОтсрочкаДней");
			Мас.Добавить("ОтсрочкаНакладных");
			ОбщегоНазначенияСервер.УстановитьДоступностьРеквизитов(ЭтаФорма, Мас);	
		Иначе
			ТолькоПросмотр = Истина; 
		КонецЕсли;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

// © Primus1C  10.12.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПсевдонимПриИзменении(Неопределено); 
КонецПроцедуры

&НаКлиенте
Процедура ПсевдонимПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Объект.Псевдоним) Тогда
		Элементы.ДекорацияЗашифрован.Видимость = Истина;
	    Элементы.Наименование.ЦветТекста = WebЦвета.Серый;
	Иначе	
		Элементы.ДекорацияЗашифрован.Видимость = Ложь;
	    Элементы.Наименование.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
