&НаКлиенте
Процедура МояСформировать(Команда)
	клПроверитьУстановитьПараметрОтчета(Отчет, "ВалютаПересчета", гоРеквизит(гоФирма(), "Валюта"));
	
	ДатаОкончания = гоПустаяДата();
	Период = клПолучитьПараметрОтчета(Отчет, Период);
	Если НЕ (Период = Неопределено) Тогда ДатаОкончания = Период.ДатаОкончания КонецЕсли; 
	клПроверитьУстановитьПараметрОтчета(Отчет, "ДатаПересчета", ?(гоПЗ(ДатаОкончания), гоТекущаяДата(), ДатаОкончания));
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
//2017.03.24
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", Мас);
	КонецЕсли; 
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры
