&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли; 
	// © Primus1C  14.07.2023  НАЧАЛО ►   
	//гоСтандартныйОтборПоПолю("Контрагенты", Список, "Ссылка");
	//гоСтандартныйОтборПоПолю("Контрагенты", Дерево, "Ссылка");
	гоОтборФормыКонтрагентов(Список, Дерево);
	
	Режим = РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") ИЛИ РольДоступна("ЧтениеНаименованийКонтрагентов");
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьПсевдоним", НЕ Режим); 
	Элементы.Псевдоним.Видимость = Режим;
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ТекущаяПозиция = Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Список.ТекущаяСтрока = ТекущаяПозиция;
КонецПроцедуры
