// © Primus1C  06.10.2025  НАЧАЛО ►

#Область Печать
	
Процедура ВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) 

	Обл = Макет.ПолучитьОбласть(Область); 
	Обл.Параметры.Заполнить(Параметры);  
	Если Уровень = Неопределено Тогда
		Таб.Вывести(Обл);
	Иначе
		Таб.Вывести(Обл, Уровень);
	КонецЕсли;     
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СПФ = Новый Структура("БезСерий, ПоСериям 
							//|,БезСерийПоАлфавиту, ПоСериямПоАлфавиту
							|",  
							НСтр("ru='Передача на комиссию (без серий)';en='Передача на комиссию (no series)'"), 
							НСтр("ru='Передача на комиссию (по сериям)';en='Передача на комиссию (with series)'"),		
							//НСтр("ru='Передача на комиссию (без серий), алфавитный порядок';en='Передача на комиссиюe (no series), alphabetical order'"), 
							//НСтр("ru='Передача на комиссию (по сериям), алфавитный порядок';en='Передача на комиссию (with series), alphabetical order'")		
							);		
	Возврат СПФ;						
							
КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = Неопределено) Экспорт
	
	ТабДокумент.Очистить();  
	//Макет = Документы.РасходнаяНакладная.ПолучитьМакет(ВариантПечатнойФормы);
	Макет = Документы.ПередачаНаКомиссию.ПолучитьМакет("Печать");
	
	ЗапрШ = Новый Запрос;
	ЗапрШ.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапрШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ));
	ЗапрШ.Текст = "ВЫБРАТЬ
	              |	Накладная.Номер КАК Номер,
	              |	Накладная.Дата КАК Дата,
	              |	Накладная.Фирма КАК Поставщик,
	              |	Накладная.Контрагент КАК Покупатель,
	              |	Накладная.Сумма КАК Сумма,
	              |	Накладная.Валюта КАК Валюта,
	              |	Накладная.Склад.Наименование КАК ИмяСклада,
	              |	Накладная.Количество КАК Количество,
	              |	ВЫРАЗИТЬ(Накладная.Примечание КАК СТРОКА(1000)) КАК Примечание,
	              |	&ПредставлениеДокумента КАК ПредставлениеДокумента
	              |ИЗ
	              |	Документ.ПередачаНаКомиссию КАК Накладная
	              |ГДЕ
	              |	Накладная.Ссылка = &Ссылка";   
	ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрШ.Текст, "Накладная.Контрагент");	
	Шапка = ЗапрШ.Выполнить().Выбрать();
	Шапка.Следующий(); 
	ВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка); 

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", ДокСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Серия КАК Серия,
	             |	ТЧТовары.ЦенаЗакупки КАК ЦенаЗакупки,
	             |	ТЧТовары.Количество КАК Количество,
	             |	ТЧТовары.ЦенаКомитента КАК Цена,
	             |	ТЧТовары.Партия КАК Партия,
	             |	ТЧТовары.НомерСтроки КАК НомерСтроки,
	             |	ТЧТовары.Ссылка.Валюта КАК Валюта,
	             |	ТЧТовары.Сумма КАК Сумма
	             |ИЗ
	             |	Документ.ПередачаНаКомиссию.Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка = &Ссылка";
	//Если ПоАлфавиту Тогда
	//	Запр.Текст = Запр.Текст + " УПОРЯДОЧИТЬ ПО РНТовары.Номенклатура.Наименование";	
	//КонецЕсли;

	ИтКоличество = 0;
	ИтСумма = 0;
	//Ном = 0;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл     
		ИтКоличество = ИтКоличество + Выборка.Количество; 
		ИтСумма = ИтСумма + Выборка.Сумма;
		//Ном = Ном + 1;
		//ОбластьДно.Параметры.Ном = Ном;
		ВывестиСекцию(ТабДокумент, Макет, "Строка", Выборка);  
		Если ВариантПечатнойФормы = "ПоСериям" Тогда
			ВывестиСекцию(ТабДокумент, Макет, "Серия", Выборка);  
		КонецЕсли;
	КонецЦикла;
	
	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	ОбластьДно.Параметры.Заполнить(Шапка);
	ОбластьДно.Параметры.ИтКоличество = ИтКоличество;
	ОбластьДно.Параметры.ИтСумма = ИтСумма;
	ОбластьДно.Параметры.СуммаПрописью = гоСуммаПрописьюВал(ИтСумма, Шапка.Валюта); 

	//+
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДолгиОстатки.Валюта,
	               |	ДолгиОстатки.ПокупательОстаток
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(
	               |			,
	               |			Контрагент = &Контрагент
	               |				И Фирма = &Фирма) КАК ДолгиОстатки";
	Запрос.УстановитьПараметр("Контрагент", Шапка.Покупатель);
	Запрос.УстановитьПараметр("Фирма", Шапка.Поставщик);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	СтрокаЗадолженность = "Задолженность : ";
	Пока Выборка.Следующий() Цикл
		 СтрокаЗадолженность = СтрокаЗадолженность+ " 
		 | "+ Выборка.ПокупательОстаток + " " + Выборка.Валюта+ ";";	
	 КонецЦикла;
	 ОбластьДно.Параметры.Задолженность = СтрокаЗадолженность;
	 //-
	
	ТабДокумент.Вывести(ОбластьДно);

КонецПроцедуры

#КонецОбласти
