
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");  
	
	// заполним затраты
	Затраты = ПроведениеДокументов.ЗатратыПартий(Товары.ВыгрузитьКолонку("Партия"));
	Для Каждого Стр Из Товары Цикл  
		
		Если ЗначениеЗаполнено(Стр.Партия) Тогда 
			
			ЦенаЗатратПартии = Затраты.ЗатратыПартии.Получить(Стр.Партия);  
			Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартии) Тогда
				ЦенаЗатратПартии = 0;
			КонецЕсли; 
			ЦенаЗатратПартииИнв = Затраты.ЗатратыПартииИнвойсов.Получить(Стр.Партия);  
			Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартииИнв) Тогда
				ЦенаЗатратПартииИнв = 0;
			КонецЕсли; 
			ЦенаЗатрат = РаботаСВалютой.Пересчитать2025(ЦенаЗатратПартии + ЦенаЗатратПартииИнв, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата); 
			Стр.ЦенаЗакупкиСЗатратами = ЦенаЗатрат + Стр.ЦенаЗакупки;  
							
		Иначе	
			
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);
    Валюта = ПараметрыСеанса.БазоваяВалюта;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Валюта = ПараметрыСеанса.БазоваяВалюта Тогда
		К = 1;	
	Иначе
		К = РаботаСВалютой.Курс(Валюта, Дата, Фирма);
	КонецЕсли;
	//Доход = 0;
	
	Движения.ОстаткиТовара.Записывать 		= Истина;
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;
    Движения.РасходыДоходы.Записывать 		= Истина;
	//Движения.Долги.Записывать				= Истина;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= Склад;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 

		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход; 
		Движение.Период 			= Дата;
 		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
        Движение.Количество			= ТекСтрокаТовары.Количество;
        Движение.Сумма				= ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		Движение.СуммаКомиссионера 	= ТекСтрокаТовары.Сумма; 
		
		//// РН Продажи
		//Движение = Движения.Продажи.Добавить(); 
		//Движение.Период				= Дата;
		//Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;
		//Движение.Партия				= ТекСтрокаТовары.Партия;
		//Движение.ДокументПрихода	= ТекСтрокаТовары.ДокументПрихода;
		//Движение.Покупатель			= Контрагент;
		//Движение.Поставщик			= ТекСтрокаТовары.Поставщик;
		//Движение.Валюта				= Валюта;
		//Движение.Автор				= КемСоздан;
		//Движение.Склад				= Склад;
		//Движение.Фирма				= Фирма;
		//Движение.Количество			= ТекСтрокаТовары.Количество;
		//Движение.Сумма				= ТекСтрокаТовары.Сумма;
		//Движение.Наценка			= ТекСтрокаТовары.Сумма - ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		//Движение.СуммаВБазВалюте	= Движение.Сумма * К;
		//Движение.НаценкаВБазВалюте	= Движение.Наценка * К;   
		//Доход = Доход + Движение.НаценкаВБазВалюте;
		
	КонецЦикла;
	
	//// РН РасходыДоходы
	//Движение = Движения.РасходыДоходы.Добавить();
	//Движение.Период 	= Дата;
	//Движение.Фирма 		= Фирма;
	//Движение.Вид 		= Перечисления.ДоходРасход.Доход;
	//Движение.Статья 	= Статья;
	//Движение.Валюта 	= Валюта;
	//Движение.Сумма 		= Доход;

	//// РН Долги
	//Движение = Движения.Долги.ДобавитьПриход();
	//Движение.Период 				= Дата;
	//Движение.Фирма 					= Фирма;
	//Движение.Док 					= Ссылка;
	//Движение.Валюта 				= Валюта;
	//Движение.Контрагент 			= Контрагент;
	//Движение.ДолгПокупателя 		= Доход;
	//Движение.ПредоплатаПокупателя 	= 0;
	//Движение.ДолгПоставщику 		= 0;
	//Движение.ПредоплатаПоставщику 	= 0;
	
КонецПроцедуры

Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), Склад, Ошибки, Фирма);
	ПроведениеДокументов.ПроверитьДубли(ТаблицаТовары, Ошибки);	
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	СтруктураПолей.Вставить("Серия",				"Серия");
	СтруктураПолей.Вставить("Партия",				"Партия");
	СтруктураПолей.Вставить("Количество",			"Количество");
	СтруктураПолей.Вставить("ЦенаЗакупки",			"ЦенаЗакупки");
	СтруктураПолей.Вставить("ЦенаЗакупкиСЗатратами","ЦенаЗакупкиСЗатратами");
	СтруктураПолей.Вставить("ЦенаКомитента",		"ЦенаКомитента");
	СтруктураПолей.Вставить("Сумма",				"Сумма");   
	СтруктураПолей.Вставить("ДокументПрихода",		"Партия.Док");   
	СтруктураПолей.Вставить("Поставщик",			"Партия.Контрагент");   
	
	ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаТовары = ЗапросТовары.Выгрузить();
	
    Возврат ТаблицаТовары;
	
КонецФункции 

