
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Текст = "";
	Подсказка = НСтр("ru = 'Сообщение всем пользователям'; en = 'Message for all users'");
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОповещениеПослеВводаТекста", ОбработчикиКомандКлиент), Текст, Подсказка, 0, Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСообщение(Текст) 
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("БезДаты", Дата(1,1,1));
	Запр.Текст = "ВЫБРАТЬ
	             |	Пользователи.Ссылка КАК Пользователь,
	             |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	Пользователи.ВходВПрограммуРазрешен
	             |	И Пользователи.ДатаПоследнегоВхода <> &БезДаты";
	Выборка = Запр.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторПользователяИБ) Тогда
			Продолжить;
		КонецЕсли;  

		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		
		//Если Выборка.Пользователь <> ПараметрыСеанса.Пользователь Тогда
		//	Продолжить;
		//КонецЕсли;

		АнглЯзык = ПользовательИБ.Язык = Метаданные.Языки.Английский;
		
		МенеджерЗаписи = РегистрыСведений.Сооб_Сообщения.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Получатель 					= Выборка.Пользователь;
		МенеджерЗаписи.ТипСообщения 				= Перечисления.Сооб_ТипСообщения.Напоминание;
		МенеджерЗаписи.Категория 					= Перечисления.Сооб_Категория.ВнеОчереди;
		МенеджерЗаписи.Автор 						= ПараметрыСеанса.Пользователь;
		МенеджерЗаписи.ЗапланированнаяДатаДоставки 	= ТекущаяДатаСеанса();    
		МенеджерЗаписи.ДатаМожноУдалять				= ТекущаяДатаСеанса() + 15 * 60;
		МенеджерЗаписи.УникИдент 					= Новый УникальныйИдентификатор; 
		МенеджерЗаписи.Тема							= ?(АнглЯзык, "Attention!", "Внимание!");
		МенеджерЗаписи.Сообщение                    = Текст;
		МенеджерЗаписи.ДатаСоздания					= ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(); 
		
	КонецЦикла;

КонецПроцедуры	