
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	//СтрокаТЧ = ПараметрыВыполненияКоманды.Источник.ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;	// строка ПН
	//РеквизитыПриходнойНакладной = РеквизитыПриходнойНакладной(ПараметрыВыполненияКоманды.Источник.Параметры.Ключ);

	РеквизитыПартии = РеквизитыПартии(ПараметрКоманды); 
	
	ДокВызова = ПараметрыВыполненияКоманды.Источник.Параметры.Ключ;
	Если ТипЗнч(ДокВызова) = Тип ("ДокументСсылка.РасходнаяНакладная") Тогда
	    ПересчетДляДокумента = ДокВызова;
	Иначе	
	     ПересчетДляДокумента = Неопределено;
	КонецЕсли;
	СоставЗатрат = ОбщегоНазначенияСервер.СоставЗатрат(ПараметрКоманды, ПересчетДляДокумента);   
	
	стр = ""; 
	//ит = "Всего затрат: ";
	Для каждого Эл Из СоставЗатрат Цикл 
		стр = стр + Эл;
	КонецЦикла;
	
    клПредупреждение(стр,, СтрШаблон("%1 %2 (%3)",
									НСтр("ru = 'Затраты партии'; en = 'Batch costs'"),
									РеквизитыПартии.Серия,
									РеквизитыПартии.Владелец ));
	
КонецПроцедуры  


&НаСервере 
Функция РеквизитыПартии(Партия)

	Возврат Новый Структура("Владелец,Серия,ПриходнаяНакладная,Инвойс,Поставка", Партия.Владелец, Партия.Серия, Партия.Док,  Партия.Док.ВКД_Инвойс,  Партия.Док.Поставка);	

КонецФункции 

