&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//тоже не работает
	//Если НЕ НеДляПечати Тогда 
	//	Таб.Вывод = ИспользованиеВывода.Разрешить;
	//КонецЕсли; 
	
	//сейчас уже восстановились поля по умолчанию
	//но как узнать, были они пустые или нет?
	//а никак
	
	ПолеСлева = СохТаб.ПолеСлева;
	ПолеСправа = СохТаб.ПолеСправа;
	ПолеСверху = СохТаб.ПолеСверху;
	ПолеСнизу = СохТаб.ПолеСнизу;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Таб.Очистить();
	
	Если Параметры.Свойство("Таб") Тогда 
		СохТаб = Параметры.Таб;
		
		Таб.Вывести(СохТаб); 
	КонецЕсли; 
	
	//2014.06.20
	Если Параметры.Свойство("КлючСохраненияПоложенияОкна") Тогда 
		ЭтаФорма.КлючСохраненияПоложенияОкна = Параметры.КлючСохраненияПоложенияОкна;
	КонецЕсли; 
	
	СразуРедактировать = ?(Параметры.Свойство("СразуРедактировать"), Параметры.СразуРедактировать, Ложь);
	
	Если СразуРедактировать Тогда  
		Элементы.Таб.Редактирование = Истина;
	КонецЕсли; 
	
	Имя = "";
	Если Параметры.Свойство("Имя") Тогда 
		Имя = Параметры.Имя;
		
		НеДляПечати = Параметры.НеДляПечати;
		
		Если НеДляПечати Тогда 
			Таб.ФоноваяКартинка = БиблиотекаКартинок.НеДляПечати; 
			
			Элементы.СохранитьВФайл.Доступность = Ложь;
			
			Таб.ВерхнийКолонтитул.Выводить = Истина;
			Таб.ВерхнийКолонтитул.НачальнаяСтраница = 1;
			Таб.ВерхнийКолонтитул.ТекстВЦентре = "Н Е Д Е Й С Т В И Т Е Л Ь Н Ы Й     Д О К У М Е Н Т";
			
			Таб.НижнийКолонтитул.Выводить = Истина;
			Таб.НижнийКолонтитул.НачальнаяСтраница = 1;
			Таб.НижнийКолонтитул.ТекстВЦентре = "Н Е Д Е Й С Т В И Т Е Л Ь Н Ы Й     Д О К У М Е Н Т";
		КонецЕсли; 
		
		//не работает почему-то
		//Таб.Вывод = ИспользованиеВывода.Запретить;
	КонецЕсли; 
	
	Если Параметры.Свойство("Имя") Тогда ЭтаФорма.Заголовок = Параметры.Имя КонецЕсли; 
	
	Таб.ОриентацияСтраницы = СохТаб.ОриентацияСтраницы;
КонецПроцедуры

&НаКлиенте
Процедура ОбычнаяПечать()
	//здесь, по идее, заполненные при открытии и возможно, измененные поля, вот и проверим
	
	ПечТаб = ?(Элементы.Таб.Редактирование, Таб, СохТаб);
	
	ПечТаб.ПолеСлева = ПолеСлева;
	ПечТаб.ПолеСправа = ПолеСправа;
	ПечТаб.ПолеСверху = ПолеСверху;
	ПечТаб.ПолеСнизу = ПолеСнизу;
		
	Если СпрашиватьПринтер Тогда
		
		//вот здесь непонятно, отказались от печати или нет, но так, вроде бы и в 1с77 было
		
		ПечТаб.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	Иначе
		Если гоАдминистратор() Тогда
			ПечТаб.Показать(ЭтаФорма.Заголовок);
		Иначе
			ПечТаб.Напечатать();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Напечатать(Команда)
	ОбычнаяПечать();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	//сюда ничего не передается
	//Сообщить(Параметры.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТабОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
КонецПроцедуры
