&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	гоФормаОтчетаСКДПриСоздании(ЭтаФорма);
	
	ПоКонтрагенту = Справочники.Контрагенты.ПустаяСсылка();
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Контрагент") Тогда
			ПоКонтрагенту = Параметры.Отбор.Контрагент;
			Элементы.ПоКонтрагенту.Видимость = Истина;
			Элементы.ГруппаВарианта.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//тут вроде бы ограничивать не нужно
КонецПроцедуры
