
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	Если Параметры.Свойство("Сообщение") Тогда
		Объект.ФорматированноеСообщение = Параметры.Сообщение; 
		Элементы.ДекорацияСообщение.Заголовок = Параметры.Сообщение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Сообщить("Нажатие на гиперссылку");
КонецПроцедуры

&НаКлиенте
Процедура ФорматированноеСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Сообщить("ТОЖЕ Нажатие на гиперссылку");
КонецПроцедуры
