Процедура ПередЗаписью(Отказ)    
	
	// © Primus1C  02.04.2024  НАЧАЛО ►  
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ПометкаУдаления И НЕ Ссылка.ПометкаУдаления    
		И Блок
		И НЕ (РольДоступна("Администратор") ИЛИ РольДоступна("БлокИзмененияНоменклатуры")) Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Номенклатура заблокирована для изменений! Пометка на удаление невозможна!'; en = 'The good is locked for changes! Marking as deleted is not possible!'"));
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	
КонецПроцедуры
