
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Спис = омСервер.ПолучитьСписокЗначенийПеречисления("СтатусыИнвойсаПродажи");

	// Структуру передаем ТРЕТЬИМ параметром (ДополнительныеПараметры)
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Ссылка", ПараметрКоманды);
	ДопПараметры.Вставить("ФормаИсточник", ПараметрыВыполненияКоманды.Источник);
	
	// Вторым параметром указываем имя Общего модуля (например, ОбработчикиКомандКлиент)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлементаСтатусаИнвойсовПродажи", ОбработчикиКомандКлиент, ДопПараметры);
	
	Спис.ПоказатьВыборЭлемента(Оповещение, "Выберите статус");
	
КонецПроцедуры
