
&НаКлиенте
Процедура РассчитатьНаценку(Команда)
	
	Если Объект.ВариантРаспределения = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран вариант расчета!";
		Сообщение.Сообщить();
		Для каждого Стр Из Объект.Документы Цикл
			ЗаполнитьТЧ(Стр);
			Стр.СуммаНаценки = 0;
		КонецЦикла;
		
		
	ИначеЕсли Объект.ВариантРаспределения = 1 Тогда
		РассчитатьНаценкуПоСуммеДокумента();
	ИначеЕсли Объект.ВариантРаспределения = 2 Тогда
		РассчитатьНаценкуПоКоличеству() 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНаценкуПоСуммеДокумента()
	
	ОбщаяСуммаКРаспределению = Объект.Сумма;
	
	Для каждого Стр Из Объект.Документы Цикл
		ЗаполнитьТЧ(Стр);
	КонецЦикла;
	
	ОбщаяСуммаДокументов = Объект.Документы.Итог("СуммаДокумента");
		
	Для каждого Стр Из Объект.Документы Цикл
		ВесоваяЧасть = ?(ОбщаяСуммаДокументов = 0,0,Стр.СуммаДокумента / ОбщаяСуммаДокументов * 100)  ;
		СуммаНаценки = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
		Стр.СуммаНаценки = СуммаНаценки ;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНаценкуПоКоличеству()
	
	ОбщаяСуммаКРаспределению = Объект.Сумма;
	
	Для каждого Стр Из Объект.Документы Цикл
		ЗаполнитьТЧ(Стр);
	КонецЦикла;
	
	ОбщееКоличествоВДокументах = Объект.Документы.Итог("Количество");
	
	Для каждого Стр Из Объект.Документы Цикл
		ВесоваяЧасть = ?(ОбщееКоличествоВДокументах = 0,0,Стр.Количество / ОбщееКоличествоВДокументах * 100)  ;
		СуммаНаценки = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
		Стр.СуммаНаценки = СуммаНаценки ;
	КонецЦикла;
	
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладная.Сумма,
	               |	ПриходнаяНакладная.ВКД_СуммаСоСкидкой
	               |ИЗ
	               |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	               |ГДЕ
	               |	ПриходнаяНакладная.Ссылка = &Ссылка
	               |	И ПриходнаяНакладная.Проведен
	               |	И НЕ ПриходнаяНакладная.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка",Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ВКД_СуммаСоСкидкой <> Неопределено И  Выборка.ВКД_СуммаСоСкидкой <>  0 Тогда
			Возврат Выборка.ВКД_СуммаСоСкидкой
		ИначеЕсли Выборка.Сумма <> Неопределено И  Выборка.Сумма <>  0 Тогда
			Возврат Выборка.Сумма
		Иначе
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходнаяНакладная.ВКД_Количество
	               |ИЗ
	               |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	               |ГДЕ
	               |	ПриходнаяНакладная.Ссылка = &Ссылка
	               |	И ПриходнаяНакладная.Проведен
	               |	И НЕ ПриходнаяНакладная.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ВКД_Количество <> Неопределено Тогда
			Возврат Выборка.ВКД_Количество
		Иначе
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура  ЗаполнитьТЧ(Стр)
	
	СуммаДокумента = ПолучитьСуммуДокумента(Стр.Документ);
	КоличествоВДокументе = ПолучитьКоличествоДокумента(Стр.Документ);
	Стр.СуммаДокумента = СуммаДокумента;
	Стр.Количество = КоличествоВДокументе;
			
КонецПроцедуры

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Изменен вид расчета!Нажмите кнопку ""Рассчитать наценку""!";
	Сообщение.Сообщить();
	ОчиститьСуммуНаценки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСуммуНаценки()
	
Для каждого Стр Из Объект.Документы Цикл
		Стр.СуммаНаценки = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Необходимо пересчитать сумму наценки! Нажмите кнопку ""Рассчитать наценку""!";
	Сообщение.Сообщить();
	
	ОчиститьСуммуНаценки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
		
КонецПроцедуры


