
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	Если ТипЗнч(Параметры.Стр) = Тип("ФорматированнаяСтрока") Тогда
		Объект.СтрФрмт = Параметры.Стр;	  
		Попытка
			Объект.СтрБезФрмт = Параметры.Стр.ПолучитьТекст();  
		Исключение
		    Объект.СтрБезФрмт = Параметры.Стр;
		КонецПопытки;
	Иначе
		Объект.СтрФрмт = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(омСервер.Фрмт(Параметры.Стр, "КРАСНЫЙ_ТЕКСТ")));	
		Объект.СтрБезФрмт = Параметры.Стр;
	КонецЕсли;	
	
	Если Параметры.Свойство("Таймаут") Тогда
		Отсчет = Параметры.Таймаут;
	КонецЕсли;                 

КонецПроцедуры

&НаКлиенте
Процедура ЗаморозитьФорму()
	
	Если Отсчет > 0 Тогда
		Элементы.ОК.Заголовок = СтрШаблон("%1 (%2)", "ОК", Отсчет);
		Элементы.ОК.Доступность = Ложь;
		Отсчет = Отсчет - 1;
	Иначе
		Элементы.ОК.Заголовок = "ОК";
		Элементы.ОК.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СтрБезФрмт.Видимость = Ложь;

	Если Отсчет > 0 Тогда 
		Элементы.ОК.Доступность = Ложь;
		ПодключитьОбработчикОжидания("ЗаморозитьФорму", 1, Ложь)	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОформлениеПриИзменении(Элемент)

	Элементы.СтрФрмт.Видимость = НЕ	Элементы.СтрФрмт.Видимость;
	Элементы.СтрБезФрмт.Видимость = НЕ	Элементы.СтрБезФрмт.Видимость;

КонецПроцедуры
