Функция СканерШКНачатьОбработку(Источник, Событие, Данные, ВернутьШК = "") Экспорт
	Если СокрЛП(Источник) <> "СканерШтрихкода" Тогда Возврат Ложь КонецЕсли; 
	Если СокрЛП(Событие) <> "ПолученШтрихкод" Тогда Возврат Ложь КонецЕсли; 
	Если НЕ клСканерШКВключен Тогда Возврат Ложь КонецЕсли; 
	Если клСканерШК = Неопределено Тогда Возврат Ложь КонецЕсли; 
	
	Попытка
		клСканерШК.ПосылкаДанных = 0;
		ВернутьШК = СокрЛП(Данные);
		Возврат Истина;
	Исключение
	    клОшибка("Ошибка {НачатьОбработку}: " + ОписаниеОшибки());
	КонецПопытки; 

	Возврат Ложь;
КонецФункции

Процедура СканерШКЗавершитьОбработку() Экспорт
	Попытка
		клСканерШК.ПосылкаДанных = 1;
	Исключение
	    клОшибка("Ошибка {ЗавершитьОбработку}: " + ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

Процедура СканерШКПодключить() Экспорт
	РМ = гоПользователь();
	Если НЕ гоРеквизит(РМ, "ИспользоватьСканерШК") Тогда Возврат КонецЕсли;
	
	Если клСканерШКВключен Тогда Возврат КонецЕсли; 
	
	Если клСканерШК = Неопределено Тогда  
		клСканерШК = ПолучитьОбъектДрайвераСканераШтрихКодов();
		клСканерШКВключен = Ложь;
	КонецЕсли; 
	
	Если ПодключитьСканер(клСканерШК) Тогда клСканерШКВключен = Истина КонецЕсли;
КонецПроцедуры

#Если Не ВебКлиент Тогда
Процедура УстановитьДрайверИзДистрибутива(ИмяМакета, ИмяФайла) Экспорт

	ВременныйКаталог = КаталогВременныхФайлов();

	// Получение макета с сервера
	СсылкаНаФайл = МенеджерОборудованияВызовСервера.ПолучитьМакетССервера(ИмяМакета);

	// Распаковка архива дистрибутива во временный каталог
	Результат = ПолучитьФайл(СсылкаНаФайл, ВременныйКаталог + "Model.zip", Ложь);
	ФайлМакета = Новый ЧтениеZipФайла();
	ФайлМакета.Открыть(ВременныйКаталог + "Model.zip");
	ВременныйКаталог = ВременныйКаталог + "Model\";

	Для Каждого ЭлементМакета Из ФайлМакета.Элементы Цикл
		Если ЭлементМакета.Имя = ИмяФайла + ".zip" Тогда
			СоздатьКаталог(ВременныйКаталог);
			ФайлМакета.Извлечь(ЭлементМакета, ВременныйКаталог);

			// Распаковка дистрибутива
			ФайлАрхива = Новый ЧтениеZipФайла();
			ФайлАрхива.Открыть(ВременныйКаталог + ЭлементМакета.Имя);
			ФайлАрхива.ИзвлечьВсе(ВременныйКаталог);

			// Запуск инсталлятора
			ЗапуститьПриложение(ВременныйКаталог + ИмяФайла, ВременныйКаталог, Истина);

			// Удаление всех временных файлов после работы
			Попытка
				УдалитьФайлы(ВременныйКаталог);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	// Удаление всех временных файлов после работы
	ВременныйКаталог = СтрЗаменить(ВременныйКаталог, "Model\", "");
	Попытка
		УдалитьФайлы(ВременныйКаталог + "Model.zip");
	Исключение
	КонецПопытки;
КонецПроцедуры
#КонецЕсли

Процедура УстановитьДрайверСканераШтрихКодов() Экспорт
	Попытка
		#Если ВебКлиент Тогда
			УстановитьВнешнююКомпоненту("ОбщийМакет.Драйвер1ССканерШтрихкода");
		#Иначе
			УстановитьДрайверИзДистрибутива("Драйвер1ССканерШтрихкодаExe", "ScanOPOS.exe");
		#КонецЕсли
	Исключение
	    клОшибка(ОписаниеОшибки());
	КонецПопытки; 	
КонецПроцедуры

Функция ПолучитьОбъектДрайвераСканераШтрихКодов() Экспорт
	ОбъектДрайвера = Неопределено;
	
	Попытка
	    #Если ВебКлиент Тогда
			ПодключитьВнешнююКомпоненту("ОбщийМакет.Драйвер1ССканерШтрихкода", "Сканер");
			ОбъектДрайвера = Новый ("AddIn.Сканер.Scanner");
		#Иначе
			ProgID = "AddIn.Scanner";
			ПодключитьВнешнююКомпоненту(ProgID);
			ОбъектДрайвера = Новый (ProgID);
		#КонецЕсли
	Исключение
	КонецПопытки;

	Возврат ОбъектДрайвера;
КонецФункции

Процедура ОтключитьСканер(Сканер) Экспорт
	Попытка
		Сканер.УстройствоВключено = 0;
		Сканер.Освободить();
		Сканер.Отсоединить();
	Исключение
	    клОшибка("Ошибка {ОтключитСканер}: " + ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

Функция ПодключитьСканер(Сканер) Экспорт
	//РМ = гоПараметрСеанса("РабочееМесто");
	//Если гоПЗ(РМ) Тогда Возврат Ложь КонецЕсли;
	РМ = гоПользователь();
	Если НЕ гоРеквизит(РМ, "ИспользоватьСканерШК") Тогда Возврат Ложь КонецЕсли; 
	
	Р = Сканер.Подсоединить("СканерШтрихкода");
	Если Р = 0 Тогда
		Сканер.БитДанных = гоРеквизит(РМ, "БитДанных");
		Сканер.Порт =гоРеквизит(РМ, "Порт");
		Сканер.Скорость = гоРеквизит(РМ, "Скорость");
		Сканер.СтопСимвол = гоРеквизит(РМ, "СтопСимвол");
		//зачем-то второй раз
		Сканер.Порт = гоРеквизит(РМ, "Порт");
		Сканер.ИмяСобытия = "ПолученШтрихкод";
		
		Попытка
			Р = Сканер.Занять(1);
			Если Р = 0 Тогда
				Сканер.УстройствоВключено = 1;
				Сканер.ПосылкаДанных = 1;
				Сканер.ОчиститьВход();
				Сканер.ОчиститьВыход();
				Если Сканер.УстройствоВключено <> 1 Тогда
					ОтключитьСканер(Сканер);
					Возврат Ложь;
				КонецЕсли;
			Иначе
				клОшибка("Ошибка {Занять}: " + Р);
				ОтключитьСканер(Сканер);
				Возврат Ложь;
			КонецЕсли;
			
			Возврат Истина;
		Исключение
		    клОшибка("Ошибка {Занять}: " + ОписаниеОшибки());
			ОтключитьСканер(Сканер);
			Возврат Ложь;
		КонецПопытки; 
	Иначе	
		клОшибка("Ошибка {Подсоединить}: " + Р);
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура ЗаписатьБуфер(Тек, ВыдСтр, Форма) Экспорт
//2016.02.02

	//когда есть выделенные строки, то там у нас только внутренние ИДИ, а не номера строк, а нам будут нужны именно номера
	клБуферДокумент = Тек;
	клБуферНомераСтрок = Новый Массив;
	Если НЕ (ВыдСтр = 0) Тогда
		Для Каждого Стр Из ВыдСтр Цикл
			ТовСтр = Форма.Объект.Товары.НайтиПоИдентификатору(Стр);
			клБуферНомераСтрок.Добавить(ТовСтр.НомерСтроки);
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВернутьБуфер(Тек, ВыдСтр) Экспорт
//2016.02.02

	Тек = клБуферДокумент;
	ВыдСтр = клБуферНомераСтрок;
КонецПроцедуры


// © Primus1C  31.05.2026  НАЧАЛО ► 

Функция ОставитьТолькоИМЕИ(ШК, Искать = "IMEI") Экспорт

	Если Найти(ШК, Искать) = 0 Тогда Возврат ШК КонецЕсли;

	Рез = "";
	Стр = СтрЗаменить(ШК, ",", гоРС());
	Кол = СтрЧислоСтрок(Стр);
	Для Н = 1 По Кол Цикл
		Лтр = СокрЛП(СтрПолучитьСтроку(Стр, Н));
		Если НЕ гоНачинаетсяС(Лтр, Искать) Тогда Продолжить КонецЕсли;
		гоРезСоо(Рез, СтрЗаменить(Лтр, Искать, ""));
	КонецЦикла;
	
	Возврат Рез; 
	
КонецФункции

Функция ПолучитьИМЕИИзБуфера_Стар() Экспорт

	Буф = "";  
	
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^V");
	Исключение
	    клОшибка(ОписаниеОшибки()); 
		Возврат Буф;
	КонецПопытки; 
	
	Если ВвестиСтроку(Буф, НСтр("ru = 'Вставьте (если пусто) серии (CTRL+V) и нажмите <ОК>'; en = 'Paste (if empty) series (CTRL+V) and click <OK>'"), , Истина) Тогда 
		Буф = РаботаСоСканеромШК.ОставитьТолькоИМЕИ(Буф);
	КонецЕсли;
	
	Возврат Буф;

КонецФункции // ПолучитьИМЕИИзБуфера()


Процедура ПолучитьИМЕИИзБуфера(ОписаниеОповещенияОЗавершении) Экспорт

	Буф = "";  
	
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^V");
	Исключение
	    клОшибка(ОписаниеОшибки()); 
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Буф);
		Возврат;
	КонецПопытки; 
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПолучитьИМЕИИзБуфераПослеВвода", РаботаСоСканеромШК, ОписаниеОповещенияОЗавершении), 
		Буф, НСтр("ru = 'Вставьте (если пусто) серии (CTRL+V) и нажмите <ОК>'; en = 'Paste (if empty) series (CTRL+V) and click <OK>'"), , Истина);

КонецПроцедуры // ПолучитьИМЕИИзБуфера()

Процедура ПолучитьИМЕИИзБуфераПослеВвода(Буф, ОписаниеОповещенияОЗавершении) Экспорт
	
	Если Буф = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, "");
		Возврат;
	КонецЕсли;
	
	Буф = РаботаСоСканеромШК.ОставитьТолькоИМЕИ(Буф);
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Буф); 
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄