&НаКлиенте
Процедура УстановитьДрайвер(Команда)
	РаботаСоСканеромШК.УстановитьДрайверСканераШтрихКодов();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВерсию(Команда)
	Сканер = РаботаСоСканеромШК.ПолучитьОбъектДрайвераСканераШтрихКодов();
	
	ВходныеПараметры = Неопределено;
	ПараметрыПодключения = Неопределено;
	ВыходныеПараметры = Новый Массив;
	
	ПодключаемоеОборудование1ССканерыШтрихкодаКлиент.ПолучитьВерсиюДрайвера(Сканер, ВходныеПараметры, ПараметрыПодключения, ВыходныеПараметры);
	
	Драйвер = ВыходныеПараметры[0];
	Версия = ВыходныеПараметры[1];
КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
	Сканер = РаботаСоСканеромШК.ПолучитьОбъектДрайвераСканераШтрихКодов();
	
	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт", Порт);
	времПараметрыУстройства.Вставить("Скорость", Скорость);
	времПараметрыУстройства.Вставить("БитДанных", БитДанных);
	времПараметрыУстройства.Вставить("СтопБит", СтопБит);
	времПараметрыУстройства.Вставить("Префикс", Префикс);
	времПараметрыУстройства.Вставить("Суффикс", Суффикс);
	времПараметрыУстройства.Вставить("Таймаут", Таймаут);
	времПараметрыУстройства.Вставить("Модель", Модель);
	
	ПараметрыПодключения = Неопределено;
	ВыходныеПараметры = Новый Массив;
	
	ПодключаемоеОборудование1ССканерыШтрихкодаКлиент.ТестУстройства(Сканер, времПараметрыУстройства, ПараметрыПодключения, ВыходныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СпПорт = Элементы.Порт.СписокВыбора;
	
	Для Индекс = 1 По 60 Цикл
		СпПорт.Добавить(Индекс, "COM" + СокрЛП(Индекс));
	КонецЦикла;

	СпСкорость = Элементы.Скорость.СписокВыбора;
	СпСкорость.Добавить(110,    "110");
	СпСкорость.Добавить(300,    "300");
	СпСкорость.Добавить(600,    "600");
	СпСкорость.Добавить(1200,   "1200");
	СпСкорость.Добавить(2400,   "2400");
	СпСкорость.Добавить(4800,   "4800");
	СпСкорость.Добавить(9600,   "9600");
	СпСкорость.Добавить(14400,  "14400");
	СпСкорость.Добавить(19200,  "19200");
	СпСкорость.Добавить(38400,  "38400");
	СпСкорость.Добавить(56000,  "56000");
	СпСкорость.Добавить(57600,  "57600");
	СпСкорость.Добавить(115200, "115200");
	СпСкорость.Добавить(128000, "128000");
	СпСкорость.Добавить(256000, "256000");

	СпБитДанных = Элементы.БитДанных.СписокВыбора;
	Для Индекс = 1 По 8 Цикл
		СпБитДанных.Добавить(Индекс, СокрЛП(Индекс));
	КонецЦикла;

	СпСтопБит = Элементы.СтопБит.СписокВыбора;
	СпСтопБит.Добавить(0, НСтр("ru='1 стоп-бит'"));
	СпСтопБит.Добавить(1, НСтр("ru='1.5 стоп-бита'"));
	СпСтопБит.Добавить(2, НСтр("ru='2 стоп-бита'"));
	
	Порт = 1;
	Скорость = 9600;
	БитДанных = 8;
	СтопБит = 0;
	Префикс = "";
	Суффикс = "#13";
	Таймаут = 75;
	Модель = Элементы.Модель.СписокВыбора[0];
КонецПроцедуры
