
Процедура СоздатьЗаписьРССообщения(СсылкаНаОбъект, ТипСообщения, Получатель=Неопределено) Экспорт
	
	ФормаС = ПолучитьФорму("РегистрСведений.Сооб_Сообщения.ФормаЗаписи");
	ФормаС.Запись.СсылкаНаОбъект 	= СсылкаНаОбъект;       
	ФормаС.Запись.ТипСообщения		= ТипСообщения; 
	Если Получатель <> Неопределено Тогда
		ФормаС.Запись.Получатель = Получатель;
	КонецЕсли;
	Если ТипСообщения = ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Напоминание") Тогда
		ФормаС.Запись.Получатель = гоПользователь();
	КонецЕсли; 
	ФормаС.Модифицированность = Истина;
	ФормаС.Открыть();

КонецПроцедуры
