&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПараметры()
	гоСтандартныйОтбор(Список, 0, ТолькоОстатки);
	
	Список.Параметры.УстановитьЗначениеПараметра("Фирма", гоФирма());
	
	Если ФильтрСклады.Количество() = 0 Тогда
		Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФильтрСклады")).Использование = Ложь;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрСклады", ФильтрСклады.ВыгрузитьЗначения());
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладыПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОстаткиПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры
