
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._Инвойс") Тогда
		Инвойс = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВЗАИМОРАСЧЕТЫ С ПОСТАВЩИКАМИ
	Движения._ВзаиморасчетыСПоставщиками.Записывать = Истина;
	Движение			 = Движения._ВзаиморасчетыСПоставщиками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период		 = Дата;
	Движение.Инвойс		 = Инвойс;
	Движение.Контрагент	 = Инвойс.Контрагент;
	Движение.СуммаОплаты = Сумма;
	Движение.Валюта		 = Валюта;
	
	//ДЕНЬГИ
	Движения._ДенежныеСредства.Записывать = Истина;
	Движение			 = Движения._ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период		 = Дата;
	Движение.Валюта		 = Валюта;
	Движение.Сумма		 = Сумма;
	
КонецПроцедуры


