// © Primus1C  18.01.2024  НАЧАЛО ►

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
				|	ДополнительныеСвойства.ИмяПредопределенныхДанных КАК Имя
				|ИЗ
				|	ПланВидовХарактеристик.ДополнительныеСвойства КАК ДополнительныеСвойства";
	Выборка = Запр.Выполнить().Выбрать();    
	Пока Выборка.Следующий() Цикл
		Если Элементы.Найти(Выборка.Имя) <> Неопределено Тогда
			Элементы[Выборка.Имя].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ВидНоменклатуры", ЭтаФорма.Параметры.ВидНоменклатуры);
	Запр.Текст = "ВЫБРАТЬ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство КАК Свойство,
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Свойство.ИмяПредопределенныхДанных КАК ИмяСвойства,
	             |	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства
	             |ИЗ
	             |	Справочник.ВидыНоменклатуры.СвойстваНоменклатуры КАК ВидыНоменклатурыСвойстваНоменклатуры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |		ПО ВидыНоменклатурыСвойстваНоменклатуры.Свойство = ЗначенияСвойствОбъектов.Владелец
	             |ГДЕ
	             |	ВидыНоменклатурыСвойстваНоменклатуры.Ссылка = &ВидНоменклатуры";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы[Выборка.ИмяСвойства].Видимость = Истина; 
		Если Элементы[Выборка.ИмяСвойства].Вид = ВидПоляФормы.ПолеВвода Тогда
			Элементы[Выборка.ИмяСвойства].СписокВыбора.Добавить(Выборка.ЗначениеСвойства);
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("ПриИзменении", 	"ВыполнитьДействиеПриИзмененииДанных"); 
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("НачалоВыбора", 	"ВыполнитьДействиеПриНачалеВыбораДанных"); 
			Элементы[Выборка.ИмяСвойства].УстановитьДействие("Очистка", 		"ВыполнитьДействиеПриОчисткеДанных"); 
		КонецЕсли;
	КонецЦикла;
	Элементы.Группы.УстановитьДействие("ПриИзменении", 	"ВыполнитьДействиеПриИзмененииДанных"); 
	Элементы.Группы.УстановитьДействие("НачалоВыбора", 	"ВыполнитьДействиеПриНачалеВыбораДанных"); 
	Элементы.Группы.УстановитьДействие("Очистка", 		"ВыполнитьДействиеПриОчисткеДанных"); 
	
	Элементы.ГруппаСпецификация.Видимость = Элементы.Спецификация.Видимость;
	
	лГруппа = "";
	Род = ЭтаФорма.Параметры.Номенклатура.Родитель;
	Пока ЗначениеЗаполнено(Род) Цикл
		Элементы.Группы.СписокВыбора.Вставить(0, Род.Наименование);
		Если ЗначениеЗаполнено(Род.ИмяГруппыДляКонструктора) И лГруппа = "" Тогда
			лГруппа = Род.ИмяГруппыДляКонструктора; 
		КонецЕсли;
		Род = Род.Родитель;
	КонецЦикла;
	Если лГруппа <> "" Тогда
		Элементы.Группы.СписокВыбора.Вставить(0, лГруппа);
       	Группы = лГруппа;
	КонецЕсли;
	
	// заполним существующие значения свойств
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Объект", ЭтаФорма.Параметры.Номенклатура);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Свойство,
	             |	ЗначенияСвойствОбъектов.ЗначениеСвойства КАК Значение
	             |ИЗ
	             |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |ГДЕ
	             |	ЗначенияСвойствОбъектов.Объект = &Объект";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтотОбъект[Выборка.Свойство] = Выборка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КартинкаФлаг = ОбщегоНазначения.ИндексКартинкиСпецификации(Строка(Спецификация));

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура NFCПриИзменении(Элемент)

	СформироватьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриИзмененииДанных(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриНачалеВыбораДанных(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;
	//Имя = СтрЗаменить(Элемент.Имя, "с_", "");
	//ПараметрыВвода = Новый Структура("РежимВыбора, Отбор", Истина, Новый Структура("Владелец", pr_ОбщийМодуль.ДополнительныйРеквизит(Имя)));    
	//ДопПараметры = Новый Структура("ИмяРеквизита", Имя);
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораЗначенияРеквизита", ЭтотОбъект, ДопПараметры, "ПриОшибкеВыбора", ЭтотОбъект);
	//ОткрытьФорму("Справочник.ЗначенияСвойствОбъектов.ФормаВыбора", ПараметрыВвода,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриОчисткеДанных(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры


#КонецОбласти


#Область ВспомогательныйПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	КартинкаФлаг = ОбщегоНазначения.ИндексКартинкиСпецификации(Строка(Спецификация));
	
	Наименование = СтрШаблон("%1 %2 %3 %4 %5 %6 %7 %8 %9 %10 ", 
							СокрЛП(Группы), Поколение, РазмерЧасов, РазмерРемня, Диагональ, Год, МодульСвязи, РазмерКлавиатуры, Модель, Объем) +
					СтрШаблон("%1 %2 %3 %4", 
							ЦветРемня, Цвет, Спецификация, ?(NFC, "NFC", ""));
	КвоРазделителей = 13;
	Для Инд = 2 По КвоРазделителей Цикл
		ДлинаПробелов = КвоРазделителей + 2 - Инд;	
		Пробелы = "";
		Для д = 1 По ДлинаПробелов Цикл
			Пробелы = Пробелы + " ";
		КонецЦикла;
		Наименование = СтрЗаменить(Наименование, Пробелы, " ");
	КонецЦикла;							

КонецПроцедуры	

#КонецОбласти

&НаКлиенте
Процедура КомандаОк(Команда)

	Закрыть(Новый Структура("Наименование,Поколение,РазмерЧасов,РазмерРемня,Диагональ,Год,МодульСвязи,РазмерКлавиатуры,Модель,Объем,ЦветРемня,Цвет,Спецификация,NFC", 
							Наименование, Поколение, РазмерЧасов, РазмерРемня, Диагональ, Год, МодульСвязи, РазмерКлавиатуры, Модель, Объем, ЦветРемня, Цвет, Спецификация, NFC));  
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
