&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Тек = ПараметрКоманды;
	Если гоПЗ(Тек) Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Док", Тек);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	
	Если ТипЗнч(Тек) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда  
		ОткрытьФорму("Отчет.ОднаПредоплатаПоставщику.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе	
		Вид = гоРеквизит(Тек, "ВидДвиженияДенег");
		Если Вид = гоПеречисление("ВидДвиженияДенег.Поставщики") Тогда
			ОткрытьФорму("Отчет.ОднаПредоплатаПоставщику.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		ИначеЕсли Вид = гоПеречисление("ВидДвиженияДенег.Покупатели") Тогда
			ОткрытьФорму("Отчет.ОднаПредоплатаПокупателя.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
