&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	Если гоРеквизит(ПараметрКоманды, "ЭтоГруппа") Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Номенклатура, Фирма", ПараметрКоманды, гоФирма());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ОткрытьФорму("Отчет.ОборотыОднойНоменклатуры.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);


КонецПроцедуры
