&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	СкладНадо = гоПараметрСеанса("Склад");
	гоУстановитьПараметрСеанса("Склад", 0); 
	
	// © Primus1C  14.07.2023  НАЧАЛО ►    
	Если Параметры.Свойство("Склад") Тогда
		СкладНадо = Параметры.Склад; 
	КонецЕсли;
	Если Параметры.Свойство("ВыбраннаяНоменклатура") Тогда
		
		ВыбраннаяНоменклатура = ЭтаФорма.Параметры.ВыбраннаяНоменклатура;
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ВыбраннаяНоменклатура;
		
		Отб.Представление = "Ссылка";
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение); 
		
	КонецЕсли; 
	
	Если Элементы.Список.ПодчиненныеЭлементы.Найти("Флаг") <> Неопределено Тогда
		лРежим = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьФлагиВСписке");
		Элементы.Список.ПодчиненныеЭлементы.Флаг.Видимость = лРежим;
		Если лРежим Тогда
			ОбщегоНазначения.ДополнитьТекстЗапросаСпецификациями(Список.ТекстЗапроса, "Спецификации.ЗначениеСвойства.Наименование");
		КонецЕсли;
	КонецЕсли;

	глПокраситьУслуги(ЭтаФорма);
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);

	Элементы.Остаток.Видимость = ОбщегоНазначенияПовтИсп.ЕстьДоступКОстаткамТоваров(); 

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПараметры()  
	
	// © Primus1C  27.06.2023  НАЧАЛО ►
	
	//////гоСтандартныйОтбор(Список, 0, ТолькоОстатки);
	//////2016.05.29
	//////добавили условие, чтобы были видны и услуги, на которых нет остатков
	//////стандартный отбор больше не годится, потому что нужно сразу три элемента включать/выключать
	////Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = ТолькоОстатки;
	////Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[0].Использование = ТолькоОстатки;
	//////Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[1].Использование = ТолькоОстатки;
	//////2016.06.21
	//////не хотят услуги
	////Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Элементы[1].Использование = Ложь;

	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = ТолькоОстатки;
	Для каждого Эл Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		ИмяОтбора = строка(Эл.ЛевоеЗначение);
		//Если ИмяОтбора = "Услуги" Тогда
		//	Эл.Использование = Ложь;
		//ИначеЕсли ИмяОтбора = "Остаток" Тогда
		//	Эл.Использование = ТолькоОстатки;
		//КонецЕсли;     
		Если ИмяОтбора = "Остаток" Тогда
			Эл.Использование = ТолькоОстатки;  
		КонецЕсли;
	КонецЦикла;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	Список.Параметры.УстановитьЗначениеПараметра("Фирма", гоФирма());
	
	Если ФильтрСклады.Количество() = 0 Тогда
		Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФильтрСклады")).Использование = Ложь;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрСклады", ФильтрСклады.ВыгрузитьЗначения());
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Ложь;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СкладНадо) Тогда
		ФильтрСклады.Очистить();
		ФильтрСклады.Добавить(СкладНадо);
		Элементы.ФильтрСклады.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладыПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОстаткиПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ИскатьНоменклатуру(Команда)
//2016.07.20

	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
	//НовНом = клИскатьНоменклатуру(Элементы.Список.ТекущаяСтрока);
	//Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	//Элементы.Список.ТекущаяСтрока = НовНом; 
	клИскатьНоменклатуру(Новый ОписаниеОповещения("ИскатьНоменклатуруПослеПоиска", ЭтотОбъект), Элементы.Список.ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ИскатьНоменклатуруПослеПоиска(НовНом, ДопПараметры) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	Элементы.Список.ТекущаяСтрока = НовНом;
КонецПроцедуры


// © Primus1C  14.04.2024  НАЧАЛО ►

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Этаформа.Параметры.РежимВыбора Тогда
		ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Ссылка); 
		Элемент.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(Ссылка)

	ВыбраннаяНоменклатура.Добавить(Ссылка);
	
	Для каждого ЭлементУО Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементУО.Представление = "Ссылка" Тогда
			Список.УсловноеОформление.Элементы.Удалить(ЭлементУО);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
	
	Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование = Истина;
	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	Отб.ПравоеЗначение = ВыбраннаяНоменклатура;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение); 
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄