
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если (ЭтотОбъект.Отбор.Количество() = 0) И (ПривилегированныйРежим() = ЛОЖЬ) Тогда
		//это пустой набор записей (УДАЛЕНИЕ)

		Если НЕ РольДоступна("Сооб_АдминистраторСообщений") Тогда
			
			Отказ = Истина;
			//ВызватьИсключение("Удаление запрещено");
			
			СообщПольз = Новый СообщениеПользователю;
			СообщПольз.Текст = НСтр("ru = 'У вас нет права удалять!'; en = 'You do not have the right to delete!'");
			СообщПольз.КлючДанных( ЭтотОбъект.Отбор);
			СообщПольз.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;        	

КонецПроцедуры
