#Область ДействияФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВКД_Распределить = 1
	КонецЕсли;

	// © Primus1C  25.06.2023  НАЧАЛО ►  
	
	Если РольДоступна("Администратор") ИЛИ РольДоступна("ИнвойсТоварный") Тогда
		Элементы.ДокументОснование.Вид = ВидПоляФормы.ПолеВвода; 
	КонецЕсли;    
	
	Отправки.Параметры.УстановитьЗначениеПараметра("Инвойс", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запр = Новый Запрос;   
		Запр.УстановитьПараметр("Инвойс", Объект.Ссылка);
		Запр.Текст ="ВЫБРАТЬ 
		            |	СостоянияИнвойсов.Статус КАК Статус,
		            |	СостоянияИнвойсов.СтатусОплаты КАК СтатусОплаты
		            |ИЗ
		            |	РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
		            |ГДЕ
		            |	СостоянияИнвойсов.Инвойс = &Инвойс"; 
		Выборка = Запр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтатусДокумента = Выборка.Статус; 	
			СтатусОплаты 	= Выборка.СтатусОплаты; 	
		КонецЕсли; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	_Инвойс.Ссылка КАК Инвойс
		             |ИЗ
		             |	Документ._Инвойс КАК _Инвойс
		             |ГДЕ
		             |	НЕ _Инвойс.ПометкаУдаления
		             |	И _Инвойс.ДокументОснование = &ДокументОснование
		             |	И _Инвойс.ВидОперации = &ВидОперации";
	    Запр.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	    Запр.УстановитьПараметр("ВидОперации", Объект.ВидОперации);
		Выборка = Запр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Сообщить(СтрШаблон(НСтр("ru = 'Уже есть инвойс (%1), созданный на основании текущего документа!'; en = 'There is already an invoice (%1) created based on the current document!'"), Объект.ВидОперации), СтатусСообщения.ОченьВажное);
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	лРежим = РольДоступна("Администратор") ИЛИ РольДоступна("ИнвойсТоварный");
	Элементы.СтатусДокумента.ТолькоПросмотр = НЕ лРежим;

	ЗаполнитьКэшДанных(Ложь); 
	
	СформироватьГиперссылкиФайловНаФорме();

	Попытка
		Элементы.ПримечаниеЗакупки.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование.Примечание); 
	Исключение
	КонецПопытки;
	Элементы.ПоставкаШаблон.Видимость = Ложь;  // <- отладка

	КоличествоПоставок = 0;
	Для каждого СтрокаТЧ Из Объект.Поставки Цикл
		Если СтрокаТЧ.Поставка > КоличествоПоставок Тогда
			КоличествоПоставок = СтрокаТЧ.Поставка;
		КонецЕсли;	
	КонецЦикла;	
	Для П = 1 По КоличествоПоставок Цикл
		ДобавитьПоставкуНаСервере(П);
	КонецЦикла;        
	
	СведенияОбОтправках = СведенияОбОтправках();
	Элементы.ГруппаОтправки.Заголовок = СтрШаблон(НСтр("ru = 'Отправки (%1)'; en = 'Shipments (%1)'"), СведенияОбОтправках.КоличествоОтправок);
	Если СведенияОбОтправках.Ошибка Тогда
		Элементы.ГруппаОтправки.Заголовок = Элементы.ГруппаОтправки.Заголовок + НСтр("ru = ': ОШИБКА!'; en = ': ERROR!'");
		Элементы.ГруппаОтправки.Картинка = БиблиотекаКартинок.ВниманиеКрасный;
	КонецЕсли;

	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  
	
	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют");
	Элементы.ВКД_ТоварыЦенаЗакупки.Заголовок 	= СтрШаблон("%1 (%2)", НСтр("ru = 'Цена закупки'; en = 'Price'"), Объект.Валюта.Символ);
	Элементы.ВКД_ТоварыСуммаЗакупки.Заголовок 	= СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма закупки'; en = 'Sum'"), Объект.Валюта.Символ);
	Элементы.ИнвойсСкорСуммаИнвойса.Заголовок 	= СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Sum'"), Объект.Валюта.Символ);
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Элементы.ВКД_ТоварыЦенаИнвойса.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Цена инвойса'; en = 'Invoice price'"), Объект.ДокументОснование.Валюта.Символ);
		Элементы.ВКД_ТоварыСуммаИнвойса.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма инвойса'; en = 'Invoice sum'"), Объект.ДокументОснование.Валюта.Символ);
	КонецЕсли;
	
	Элементы.Курс.Заголовок 					= СтрШаблон("%1 1%2", НСтр("ru = 'Курс'; en = 'Rate'"), Объект.ДокументОснование.Валюта.Символ);
	//Элементы.Курс.ФорматРедактирования			= СтрШаблон("ЧФ='Ч %1'", ПараметрыСеанса.БазоваяВалюта.Символ);
	Элементы.ДекорацияКурс.Заголовок 			= ПараметрыСеанса.БазоваяВалюта.Символ;  
	
	Элементы.ДекорацияВалютаЗатрат.Заголовок 	= ПараметрыСеанса.БазоваяВалюта.Символ;
	
	СтруктураПечатныхФорм = Документы._Инвойс.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	// привязки 
	лПривязки = Объект.Контрагент.ПривязыватьИнвойсы;
	Элементы.Привязки.Видимость = лПривязки;
	Если лПривязки Тогда
	    ЗаполнитьТаблицуПривязок();
	КонецЕсли; 
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.Сумма = Объект.ВКД_Товары.Итог("СуммаЗакупки");
	Объект.ВКД_Количество = Объект.ВКД_Товары.Итог("Количество");
	
	// © Primus1C  15.08.2023  НАЧАЛО ►  
	
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.ПустаяСсылка");
			Прервать;
		КонецЕсли;	
	КонецЦикла;  
	
	Инд = Объект.Поставки.Количество() - 1;
	Пока Инд >= 0 Цикл
		НайдСтроки = Объект.ВКД_Товары.НайтиСтроки(Новый Структура("ИдСтроки", Объект.Поставки[Инд].ИдСтроки));
		Если НайдСтроки.Количество() = 0 Тогда
			Объект.Поставки.Удалить(Инд);
		КонецЕсли; 
		Инд = Инд - 1;
	КонецЦикла;
	
	Если КоличествоПоставок > 0 Тогда
		ПересчитатьСуммыПоставокИзТоваров();
		ПеренестиДанныеПоставкиСФормыВТЧ();
	КонецЕсли;
	
	//Если Объект.КоличествоПоставок = 1 Тогда
	//	Если НЕ клВопрос("В документе используется разделение на поставки, но поставок всего 1. Вы действительно хотите сохранить одну поставку в документе?") Тогда
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;  
	
	Если ДоступЛогиста() Тогда
		лКоличествоПоставок = 0;
		Для Каждого Пост Из Объект.Поставки Цикл
			лКоличествоПоставок = Макс(лКоличествоПоставок, Пост.Поставка);                
		КонецЦикла;
		Если лКоличествоПоставок > 0 Тогда
			фЕстьОстаток = Ложь;
			Для каждого СтрокаИнвСкор Из ИнвойсСкорректированный Цикл
				Если СтрокаИнвСкор.Остаток > 0 Тогда
					фЕстьОстаток = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если фЕстьОстаток Тогда
				клВопрос(Новый ОписаниеОповещения("ПередЗаписьюПереносОстаткаЗавершение", ЭтотОбъект), 
					СтрШаблон(НСтр("ru = 'Перенести остаток товаров в новую поставку № %1?'; en = 'Transfer the goods balance to a new delivery № %1?'"), лКоличествоПоставок+1));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПереносОстаткаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	ДобавитьПоставку(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// © Primus1C  12.09.2023  НАЧАЛО ►  
	//клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ, Истина);
	КонецЦикла;
	
	ОбновитьПроцентНаценки();
	ОтобразитьРазницуИнвойсов();
	ПоставкиВФорму();
	ОбновитьИнвойсСкорректированный(); 
	
	ВидимостьПанелиСообщений = ВидимостьПанелиСообщений И Сооб_Сервер.ПроверитьНаличиеРоли(гоПользователь());
	Элементы.КнопкаСообщения.Пометка = ВидимостьПанелиСообщений;
	ПоказатьСкрытьПанельСообщений();
	ОбновитьНадписиФормы(); 
	ОтобразитьЦветСтатусов(); 
	ОтобразитьЦветВалюты(); 
	
	ОбновитьДеревоЗатрат(Неопределено);
	
	ОбновитьИтоги();
	УстановитьВидимостьНДС(); 
	УстановитьВидимостьНаценки();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры


// © Primus1C  15.07.2023  НАЧАЛО ►  

&НаСервереБезКонтекста
Функция ВалютаИнвойсаЗакупки(ИнвойсЗакупкиСсылка)

	Возврат Новый Структура("Валюта,ВестиПартионныйУчет", 
							ИнвойсЗакупкиСсылка.Валюта,
							ИнвойсЗакупкиСсылка.Валюта.ВестиПартионныйУчет);	

КонецФункции 

&НаКлиенте 
// Заполняет таблицу формы Поставки
// по данным из ТЧ Товары и ТЧ Поставки
Процедура ПоставкиВФорму()
	
	Поставки.Очистить();
	
	Для Каждого СтрокаТовар ИЗ Объект.ВКД_Товары Цикл 
		Остаток = СтрокаТовар.Количество;
		Для П = 1 По КоличествоПоставок Цикл
			НовСтрока = Поставки.Добавить();                                       
			ЗаполнитьЗначенияСвойств(НовСтрока,	СтрокаТовар, "ИдСтроки,Номенклатура"); 
			НовСтрока.Поставка 			 = П;
			НовСтрока.Цена 				 = СтрокаТовар.ЦенаЗакупки; 
			НовСтрока.НомерСтрокиИнвойса = СтрокаТовар.НомерСтроки; // нач.значение 1
			НайдСтроки = Объект.Поставки.НайтиСтроки(Новый Структура("ИдСтроки,Номенклатура,Поставка", СтрокаТовар.ИдСтроки, СтрокаТовар.Номенклатура, П));	
			Если НайдСтроки.Количество() > 0 Тогда
				НовСтрока.Количество = НайдСтроки[0].Количество;
				НовСтрока.Пометка = НовСтрока.Количество <> 0;
				Остаток = Остаток - НовСтрока.Количество;
			КонецЕсли;
			ПересчитатьСуммуСтрокиПоставки(НовСтрока);
		КонецЦикла; 
		СтрокиОстатка = Поставки.НайтиСтроки(Новый Структура("ИдСтроки,Номенклатура", СтрокаТовар.ИдСтроки, СтрокаТовар.Номенклатура));
		Для Каждого СтрокаОстатка ИЗ СтрокиОстатка Цикл
			СтрокаОстатка.Остаток = Остаток;
		КонецЦикла;	
	КонецЦикла;	
	
	ОбновитьИтогиПоставок();
	ПеренестиДанныеПоставкиСФормыВТЧ();
	
КонецПроцедуры

&НаКлиенте
Функция ЦенаЗакупкиПоИдСтроки(ИдСтроки)
	
	НайдСтроки = Объект.ВКД_Товары.НайтиСтроки(Новый Структура("ИдСтроки", ИдСтроки));
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат НайдСтроки[0].ЦенаЗакупки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ЦенаЗакупкиПоИдСтрокиНаСервере(ИдСтроки)
	
	НайдСтроки = Объект.ВКД_Товары.НайтиСтроки(Новый Структура("ИдСтроки", ИдСтроки));
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат НайдСтроки[0].ЦенаЗакупки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуСтрокиПоставки(СтрокаПоставки)
	
	Если СтрокаПоставки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Цена = ЦенаЗакупкиПоИдСтроки(СтрокаПоставки.ИдСтроки);
	Если Цена <> 0 Тогда
		СтрокаПоставки.Цена = Цена;
	КонецЕсли;
	СтрокаПоставки.Сумма = СтрокаПоставки.Цена * СтрокаПоставки.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыПоставокИзТоваров()
	
	Если КоличествоПоставок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПоставки Из Поставки Цикл
		ПересчитатьСуммуСтрокиПоставки(СтрокаПоставки);
	КонецЦикла;
	
	ОбновитьИтогиПоставок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиПоставок(НомерПоставки = 0)
	
	Если КоличествоПоставок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоставкаОт = ?(НомерПоставки = 0, 1, НомерПоставки);
	ПоставкаДо = ?(НомерПоставки = 0, КоличествоПоставок, НомерПоставки);
	
	Для П = ПоставкаОт По ПоставкаДо Цикл
		
		Если Элементы.Найти("П" + П + "ПоставкиСумма") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Ит = 0;  
		ИтКво = 0;
		НайдСтроки = Поставки.НайтиСтроки(Новый Структура("Поставка", П));
		Для каждого СтрокаПоставки Из НайдСтроки Цикл
			Ит = Ит + СтрокаПоставки.Сумма;	 
			ИтКво = ИтКво + СтрокаПоставки.Количество;
		КонецЦикла;
		Элементы["П" + П + "ПоставкиСумма"].ТекстПодвала = СтрШаблон("%1 %2", КэшДанных.СимволВалюты, Формат(Ит, "ЧДЦ=4"));
		Элементы["П" + П + "ПоставкиКоличество"].ТекстПодвала = Формат(ИтКво, "ЧДЦ=0");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьПометкуСтрокиПоставки(СтрокаПоставки)
	
	Если СтрокаПоставки.Пометка Тогда
		СтрокаПоставки.Количество = СтрокаПоставки.Остаток;
		СтрокаПоставки.Остаток = 0;
	Иначе           
		СтрокаПоставки.Остаток = СтрокаПоставки.Количество; 
		СтрокаПоставки.Количество = 0;
	КонецЕсли;
	
	ПересчитатьСуммуСтрокиПоставки(СтрокаПоставки);
	
КонецПроцедуры

&НаСервере 
// Заполняет таблицу формы ИнвойсСкорректированный
// по данным из таблицы формы Поставки
Процедура ОбновитьИнвойсСкорректированный()
	
	//+
	ИнвойсСкорректированный.Очистить();
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		НовСтрока = ИнвойсСкорректированный.Добавить();                 
	    ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ, "ИдСтроки,Номенклатура");
		НовСтрока.НомерСтрокиИнвойса	= СтрокаТЧ.НомерСтроки;
		НовСтрока.КоличествоИнвойса     = СтрокаТЧ.Количество;
		НовСтрока.СуммаИнвойса          = СтрокаТЧ.СуммаЗакупки;  
		НовСтрока.Остаток               = СтрокаТЧ.Количество;
	КонецЦикла;
	//-
	
	тз = Поставки.Выгрузить();
	тз.Свернуть("НомерСтрокиИнвойса,Номенклатура", "Количество,Сумма");
	тз.Сортировать("НомерСтрокиИнвойса");
	//ИнвойсСкорректированный.Очистить();
	Для Каждого СтрокаПоставки Из тз Цикл
		//НовСтрока = ИнвойсСкорректированный.Добавить();      
		СтрокаСкорр = ИнвойсСкорректированный[СтрокаПоставки.НомерСтрокиИнвойса - 1];
		//НовСтрока.НомерСтрокиИнвойса 	= СтрокаПоставки.НомерСтрокиИнвойса;
		//НовСтрока.Номенклатура			= СтрокаПоставки.Номенклатура;  
	   	//НовСтрока.КоличествоИнвойса 	= Объект.ВКД_Товары[СтрокаПоставки.НомерСтрокиИнвойса-1].Количество;
		СтрокаСкорр.КоличествоПоставки 	= СтрокаСкорр.КоличествоПоставки + СтрокаПоставки.Количество;
		//НовСтрока.СуммаИнвойса          = СтрокаПоставки.Сумма;
		СтрокаСкорр.Остаток				= СтрокаСкорр.КоличествоИнвойса - СтрокаСкорр.КоличествоПоставки; 
	КонецЦикла;	
	
	Элементы.ИнвойсСкорКоличествоИнвойса.ТекстПодвала 	= ИнвойсСкорректированный.Итог("КоличествоИнвойса");
	Элементы.ИнвойсСкорСуммаИнвойса.ТекстПодвала 		= СтрШаблон("%1 %2", Объект.Валюта.Символ, Формат(ИнвойсСкорректированный.Итог("СуммаИнвойса"), "ЧДЦ=2"));
	Элементы.ИнвойсСкорКоличествоПоставки.ТекстПодвала 	= ИнвойсСкорректированный.Итог("КоличествоПоставки");
	Элементы.ИнвойсСкорОстаток.ТекстПодвала 			= ИнвойсСкорректированный.Итог("Остаток");
	Если КоличествоПоставок > 0 И ИнвойсСкорректированный.Итог("Остаток") > 0 Тогда
		Элементы.ИнвойсСкорОстаток.КартинкаПодвала = БиблиотекаКартинок.ВниманиеКрасный;
	Иначе
		Элементы.ИнвойсСкорОстаток.КартинкаПодвала = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СведенияОбОтправках()
	
	лОшибка 		= Ложь;
	лКвоОтправок	= 0;
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(ОтправкаИнвойсов.НомерСтроки) КАК КвоСтрок
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |ГДЕ
	             |	ОтправкаИнвойсов.Инвойс = &Инвойс
	             |	И ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ОтправкаИнвойсов.Поставка КАК Поставка,
	             |	КОЛИЧЕСТВО(ОтправкаИнвойсов.Поставка) КАК КоличествоПоставок
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |ГДЕ
	             |	ОтправкаИнвойсов.Инвойс = &Инвойс
	             |	И ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ОтправкаИнвойсов.Поставка";
	Запр.УстановитьПараметр("Инвойс", Объект.Ссылка);
	Пакет = Запр.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать(); 
	Если Выборка.Следующий() Тогда
		лКвоОтправок = Выборка.КвоСтрок;
	Иначе	
	    лКвоОтправок = 0;
	КонецЕсли;
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоПоставок > 1 Тогда
			лОшибка = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("Ошибка, КоличествоОтправок", лОшибка, лКвоОтправок);
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьНадписиФормы()

	лКоличествоПоставок = 0;
	Для Каждого Пост Из Объект.Поставки Цикл
		лКоличествоПоставок = Макс(лКоличествоПоставок, Пост.Поставка);                
	КонецЦикла;
	
	Элементы.КорректировкиИПоставки.Заголовок = СтрШаблон(НСтр("ru = 'Корректировки, поставки (%1)'; en = 'Adjustments, deliveries (%1)'"),
						                            		лКоличествоПоставок);
	
КонецПроцедуры 
														
&НаСервере
Процедура ЗаменитьТчТоварыНаСервере(Знач ИдСтроки)
	
	// произведем замены в ТЧ Товары
	ЗаменыТовары = Замены.Выгрузить();
   	ЗаменыТовары.Свернуть("Номенклатура,ИДСтроки,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса", "Количество"); // без поставок
	НомСтроки = Объект.ВКД_Товары.Индекс(Объект.ВКД_Товары.НайтиСтроки(Новый Структура("ИдСтроки",ИдСтроки))[0]);	
	Объект.ВКД_Товары.Удалить(НомСтроки);
	Для каждого СтрокаЗамены Из ЗаменыТовары Цикл   
		СтрокаТЧ = Объект.ВКД_Товары.Вставить(НомСтроки);
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаЗамены); 
		СтрокаТЧ.СуммаЗакупки 	= СтрокаТЧ.ЦенаЗакупки * СтрокаТЧ.Количество; 
		СтрокаТЧ.СуммаИнвойса 	= СтрокаТЧ.ЦенаИнвойса * СтрокаТЧ.Количество;  
		СтрокаТЧ.ИдСтроки 		= ИдСтроки;
		СтрокиЗамены = Замены.НайтиСтроки(Новый Структура("Номенклатура,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса", 
															 СтрокаТЧ.Номенклатура,
		                                                     СтрокаТЧ.ЦенаЗакупки,
															 СтрокаТЧ.ЦенаСоСкидкой,
															 СтрокаТЧ.ЦенаИнвойса));
		Для каждого СтрЗамены Из СтрокиЗамены Цикл 
			СтрЗамены.ИдСтроки = ИдСтроки;
			СтрЗамены.НомерСтрокиИнвойса = НомСтроки + 1;
		КонецЦикла;	
		ИдСтроки  = ИдСтроки + 1;
		НомСтроки = НомСтроки + 1; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаменаРазделение" Тогда
		
		// заполним ТЗ Замены значениями от пользователя
		Замены.Очистить();
		Для каждого стр Из Параметр.ТаблицаЗамен Цикл
			НовСтрока = Замены.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, стр);
		КонецЦикла;                                 
		
		// произведем замены в ТЧ Товары
		ЗаменитьТчТоварыНаСервере(НовСтрока.ИдСтроки);
		
		// произведем замены в ТЧ Поставки
		МассивСтрок = Поставки.НайтиСтроки(Новый Структура("ИдСтроки", Параметр.ИдСтроки));
		Для Каждого ЭлементМассив Из МассивСтрок Цикл
			Поставки.Удалить(ЭлементМассив); 
		КонецЦикла;
		Для каждого СтрокаТз Из Замены Цикл
			НовСтрока = Поставки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТз);
			НовСтрока.Цена = ЦенаЗакупкиПоИдСтроки(НовСтрока.ИдСтроки);
			Если НовСтрока.Цена = 0 Тогда
				НовСтрока.Цена = СтрокаТз.ЦенаИнвойса;
			КонецЕсли;
			НовСтрока.Сумма = НовСтрока.Количество * НовСтрока.Цена;  
			НовСтрока.Пометка = НовСтрока.Количество > 0;
		КонецЦикла;        
		
		// добавим (если нет) строки с нулевыми кол-вами в ТЧ Поставки 
		Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
			Для П = 1 По КоличествоПоставок Цикл
				НайдСтроки = Поставки.НайтиСтроки(Новый Структура("Номенклатура,Поставка", СтрокаТЧ.Номенклатура, П));
				Если НайдСтроки.Количество() = 0 Тогда
					НовСтрока = Поставки.Добавить();  
					ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ, "Номенклатура,ИдСтроки,ЦенаИнвойса");
					НовСтрока.Поставка = П;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;		
		
		// отсортируем строки ТЧ Поставки в соотв.с порядком строк ТЧ Товары
		Соотв = Новый Соответствие;
		Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
			Соотв.Вставить(СтрокаТЧ.идСтроки, СтрокаТЧ.НомерСтроки+1);
		КонецЦикла;
		Для каждого СтрокаПоставки Из Поставки Цикл
			СтрокаПоставки.НомерСтрокиИнвойса = Соотв.Получить(СтрокаПоставки.ИдСтроки) - 1; 
		КонецЦикла;
		Поставки.Сортировать("НомерСтрокиИнвойса");
		
		// заполним колонку Остаток в ТЧ Поставки  
		Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
			Ост = СтрокаТЧ.Количество;
			НайдСтроки = Поставки.НайтиСтроки(Новый Структура("ИдСтроки", СтрокаТЧ.ИдСтроки));
			Для каждого НайдСтрока Из НайдСтроки Цикл
				Ост = Ост - НайдСтрока.Количество;
			КонецЦикла;
			Для каждого НайдСтрока Из НайдСтроки Цикл
				НайдСтрока.Остаток = Ост;
			КонецЦикла;
		КонецЦикла;
		
		ОбновитьИнвойсСкорректированный();
		ОбновитьИтогиПоставок();
		ПеренестиДанныеПоставкиСФормыВТЧ();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  
	
	РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(Объект.Ссылка, СтатусДокумента, , , , , , , Объект.Ссылка);
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

#КонецОбласти


#Область ДействияЭлементовШапкиФормы 

&НаКлиенте
Процедура РассчитатьСкидку(Команда)
	
	Если Объект.ВКД_Распределить = 0 Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Скидка не будет распределена! Не выбран вид расчета!'; en = 'The discount will not be distributed! Calculation type not selected!'");
		Сообщение.Сообщить();
	ИначеЕсли Объект.ВКД_Распределить = 1 Тогда
		РассчитатьЦенуЗакупкиПоСумме();	
	ИначеЕсли Объект.ВКД_Распределить = 2 Тогда
		РассчитатьЦенуЗакупкиПоКоличеству();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуЗакупкиПоСумме()

	ОбщаяСуммаКРаспределению = ПолучитьСуммуСкидки();
	
	СуммаИнвойса = Объект.ВКД_Товары.Итог("СуммаЗакупки");
	Если ОбщаяСуммаКРаспределению <> 0 Тогда
		Для каждого Стр из Объект.ВКД_Товары Цикл	
			ВесоваяЧасть = Стр.СуммаЗакупки / СуммаИнвойса * 100  ;
			СуммаКРаспределению = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
			ДельтаЦены = СуммаКРаспределению / Стр.Количество;
			ЦенаСоСкидкой = Стр.ЦенаЗакупки - ДельтаЦены;
			Стр.ЦенаСоСкидкой = ЦенаСоСкидкой;
			Стр.СуммаЗакупкиСоСкидкой = Стр.Количество * ЦенаСоСкидкой;
		КонецЦикла;
	Объект.ВКД_СуммаЗакупкиСоСкидкой = Объект.ВКД_Товары.Итог("СуммаЗакупкиСоСкидкой");
    Объект.ВКД_Скидка = ОбщаяСуммаКРаспределению;
	//Элементы.ВКД_Скидка.Видимость = Истина;
	//Элементы.СуммаЗакупкиСоСкидкой.Видимость = Истина;
	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Расчет не проведен. Сумма скидки равна 0! Воможно, не выбран документ скидки!'; en = 'The calculation has not been carried out. The discount amount is 0! Probably the discount document is not selected!'");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуЗакупкиПоКоличеству()

	ОбщаяСуммаКРаспределению = ПолучитьСуммуСкидки();
	ОбщееКоличество = Объект.ВКД_Товары.Итог("Количество");
	
	Если ОбщаяСуммаКРаспределению <> 0 Тогда
		
		ДельтаЦены = ОбщаяСуммаКРаспределению / ОбщееКоличество;
		
		Для каждого Стр из Объект.ВКД_Товары Цикл
			
			ЦенаСоСкидкой = Стр.ЦенаЗакупки - ДельтаЦены;

			Если ЦенаСоСкидкой <= 0 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(НСтр("ru = 'При данном виде расчета цена закупки %1 со скидкой меньше 0! Результат не будет записан! Необходимо выбрать вид расчета ПО СУММЕ'; en = 'With this type of calculation, the purchase price %1 with a discount is less than 0! The result will not be recorded! You must select the type of calculation BY SUM'"), Стр.Номенклатура);
				Сообщение.Сообщить();
				Прервать;
			Иначе
				Стр.ЦенаСоСкидкой = ЦенаСоСкидкой;
				Стр.СуммаЗакупкиСоСкидкой = Стр.Количество * ЦенаСоСкидкой;
			КонецЕсли;
			
		КонецЦикла;
		
	Объект.ВКД_СуммаЗакупкиСоСкидкой = Объект.ВКД_Товары.Итог("СуммаЗакупкиСоСкидкой");
    Объект.ВКД_Скидка = ОбщаяСуммаКРаспределению;
	//Элементы.ВКД_Скидка.Видимость = Истина;
	//Элементы.СуммаЗакупкиСоСкидкой.Видимость = Истина;

	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Расчет не проведен. Сумма скидки равна 0! Воможно, не выбран документ скидки!'; en = 'The calculation has not been carried out. The discount amount is 0! The discount document may not have been selected!'");
		Сообщение.Сообщить();
	КонецЕсли;
	
			
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуСкидки()

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
              |	ВКД_СкидкаПоставщикаДокументы.СуммаСкидки
              |ИЗ
              |	Документ.ВКД_СкидкаПоставщика.Документы КАК ВКД_СкидкаПоставщикаДокументы
              |ГДЕ
              |	ВКД_СкидкаПоставщикаДокументы.Ссылка = &Ссылка
              |	И ВКД_СкидкаПоставщикаДокументы.Документ = &Документ";			   
			   Запрос.УстановитьПараметр("Ссылка",Объект.ВКД_ДокументСкидки);
			   Запрос.УстановитьПараметр("Документ",Объект.Ссылка);
			   РезультатЗапроса = Запрос.Выполнить();
			   
   Если Не РезультатЗапроса.Пустой() Тогда
	   Выборка = РезультатЗапроса.Выбрать();
	   Выборка.Следующий();
	   Если Выборка.СуммаСкидки <> Неопределено Тогда
		   Возврат Выборка.СуммаСкидки
	   Иначе
		   Возврат 0;
	   КонецЕсли; 
   Иначе Возврат 0;
   КонецЕсли;	   

КонецФункции

&НаКлиенте
Процедура ВКД_РаспределитьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВКД_ДокументСкидки) Тогда
		ОчиститьСуммуСкидки();
		
		Если  Объект.ВКД_Распределить = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Скидка не будет распределена! Не выбран вид расчета!'; en = 'The discount will not be distributed! Calculation type not selected!'");
			Сообщение.Сообщить();
			
		ИначеЕсли Объект.ВКД_Распределить = 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Скидка будет распределена по сумме!'; en = 'The discount will be distributed according to the amount!'");
			Сообщение.Сообщить();
			
		ИначеЕсли Объект.ВКД_Распределить = 2 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Скидка будет распределена по количеству!'; en = 'The discount will be distributed according to quantity!'");
			Сообщение.Сообщить();
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСуммуСкидки()
	
	Для каждого Стр Из Объект.ВКД_Товары Цикл
		Стр.ЦенаСоСкидкой = 0;
		Стр.СуммаЗакупкиСоСкидкой = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ДокументСкидкиПриИзменении(Элемент)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Изменен документ скидки. Нажмите кнопку <Рассчитать скидку>!'; en = 'The discount document has been changed. Click the <Calculate discount> button!'");
	Сообщение.Сообщить();
	ОчиститьСуммуСкидки();
	
КонецПроцедуры

// © Primus1C  28.09.2023  НАЧАЛО ►

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)

	ОтобразитьЦветСтатусов();
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ОтобразитьЦветВалюты();
	ОтобразитьРазницуИнвойсов();

КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Объект.КурсУстановленВручную = Истина;
	ОбновитьОтображениеДанных(Элементы.КурсУстановленВручную);
	
	Если Объект.Курс = 0 Тогда
		Возврат;
	КонецЕсли;
	
	клВопрос(Новый ОписаниеОповещения("КурсПриИзмененииЗавершение", ЭтотОбъект), 
		НСтр("ru = 'Пересчитать цены и суммы оплаты во всех строках?'; en = 'Convert prices and payment sum in all lines?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ);
	КонецЦикла;
	Если КоличествоПоставок > 0 Тогда
		ПересчитатьСуммыПоставокИзТоваров();
		ПеренестиДанныеПоставкиСФормыВТЧ();
	КонецЕсли;
	КурсУстановленВручную = Истина;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ, РассчитатьТолькоСуммуИнвойса = Ложь)
	
	Если Объект.Наценка Тогда
		ЦенаБазовая = СтрокаТЧ.ЦенаСНаценкой;
	ИначеЕсли СтрокаТЧ.ЦенаБезНДС = 0 Тогда
		ЦенаБазовая = СтрокаТЧ.ЦенаИнвойса;
	Иначе
		ЦенаБазовая = СтрокаТЧ.ЦенаБезНДС;
	КонецЕсли;
	
	//СтрокаТЧ.СуммаИнвойса = СтрокаТЧ.ЦенаИнвойса * СтрокаТЧ.Количество; 
    СтрокаТЧ.СуммаИнвойса = ЦенаБазовая * СтрокаТЧ.Количество; 
	
	Если Объект.Курс > 0 И НЕ РассчитатьТолькоСуммуИнвойса Тогда 
		//Если СтрокаТЧ.ЦенаИнвойса <> 0 Тогда
		Если ЦенаБазовая <> 0 Тогда
			//СтрокаТЧ.ЦенаЗакупки = СтрокаТЧ.ЦенаИнвойса / Объект.Курс;
			СтрокаТЧ.ЦенаЗакупки = ЦенаБазовая / Объект.Курс;
		КонецЕсли;  
		Если СтрокаТЧ.СуммаИнвойса <> 0 Тогда
			СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.СуммаИнвойса / Объект.Курс;
		КонецЕсли;  
	КонецЕсли;                    
	
	ОбновитьСуммуВВалютеИнвойса();
	ОтобразитьРазницуИнвойсов();

КонецПроцедуры

&НаКлиенте
Процедура ВКД_ДатаИнвойсаПоставщикаПриИзменении(Элемент)

	ОтобразитьРазницуИнвойсов();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	ОтобразитьРазницуИнвойсов();

КонецПроцедуры

&НаКлиенте
Процедура КурсУстановленВручнуюПриИзменении(Элемент)
	
	Если Объект.КурсУстановленВручную Тогда 
		Сооб = Новый СообщениеПользователю;
		Сооб.Поле = "Объект.Курс"; 
		Сооб.Текст = НСтр("ru = 'Чтобы задать курс вручную, просто введите его значение'; en = 'To set the rate manually, just enter its value'");
    	Сооб.Сообщить();
	Иначе  
		ВалютаИнвойсаЗакупки = ВалютаИнвойсаЗакупки(Объект.ДокументОснование);
		Если НЕ ВалютаИнвойсаЗакупки.ВестиПартионныйУчет Тогда
			Сооб = Новый СообщениеПользователю;
			Сооб.Поле = "Объект.Курс"; 
			Сооб.Текст = СтрШаблон(НСтр("ru = 'У валюты %1 не ведется партионный учет.%2Возможен только ручной ввод курса!'; en = 'Currency %1 is not accounted for in batches.%2Only manual exchange rate entry is possible!'"),
									ВалютаИнвойсаЗакупки.Валюта, Символы.ПС);
			Сооб.Сообщить();
			Объект.КурсУстановленВручную = Истина;
		Иначе
			Объект.Курс = СрВзвешКурс;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

#КонецОбласти


#Область ДействияЭлементовТабличнойЧастиТовары 

&НаКлиенте
Процедура ВКД_ТоварыЦенаЗакупкиПриИзменении(Элемент)  
	
	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;	
	СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.ЦенаЗакупки * СтрокаТЧ.Количество;
	Объект.Сумма = 0;
	Если КоличествоПоставок > 0 Тогда
		ПересчитатьСуммыПоставокИзТоваров();
		ПеренестиДанныеПоставкиСФормыВТЧ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;	
	СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.ЦенаЗакупки * СтрокаТЧ.Количество; 
	// © Primus1C  01.03.2024  НАЧАЛО ►	  
	Если Объект.Наценка Тогда
		СтрокаТЧ.СуммаЗакупки = СтрокаТЧ.ЦенаСНаценкой * СтрокаТЧ.Количество; 
		ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ, Истина);
	Иначе
		ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ);
	КонецЕсли;	
	// © Primus1C  ОКОНЧАНИЕ ◄
	Объект.Сумма = 0;

КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыСуммаЗакупкиПриИзменении(Элемент)  
	
	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;
	СтрокаТЧ.ЦенаЗакупки = Окр(СтрокаТЧ.СуммаЗакупки / СтрокаТЧ.Количество,4);
	Объект.Сумма = 0;     
	
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыПередУдалением(Элемент, Отказ)
	
	Если КоличествоПоставок > 1 Тогда
		Отказ = Истина;
		Стр = Элементы.ВКД_Товары.ТекущиеДанные;
		Если Стр = Неопределено Тогда Возврат КонецЕсли;
		ИДИ = Стр.ПолучитьИдентификатор();
		клНетДа(Новый ОписаниеОповещения("ВКД_ТоварыПередУдалениемЗавершение", ЭтотОбъект, ИДИ),
			НСтр("ru = 'Удалить строку (также из поставок)?'; en = 'Delete line (also from deliveries?'"));
		Возврат;
	КонецЕсли;
	
	УдСтроки = Поставки.НайтиСтроки(Новый Структура("ИдСтроки", ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ИдСтроки));
	Для каждого Стр Из УдСтроки Цикл
		Поставки.Удалить(Поставки.Индекс(стр));	
	КонецЦикла;
	
	//ОбновитьИнвойсСкорректированный();

КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыПередУдалениемЗавершение(Результат, ИДИ) Экспорт
	Стр = Объект.ВКД_Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	Если Результат Тогда
		УдСтроки = Поставки.НайтиСтроки(Новый Структура("ИдСтроки", Стр.ИдСтроки));
		Для каждого УдСтр Из УдСтроки Цикл
			Поставки.Удалить(Поставки.Индекс(УдСтр));	
		КонецЦикла;
	КонецЕсли;
	
	//ОбновитьИнвойсСкорректированный();
	
	Объект.ВКД_Товары.Удалить(Стр);
КонецПроцедуры

// © Primus1C  25.06.2023  НАЧАЛО ►

&НаКлиенте
Процедура ВКД_ТоварыЦенаИнвойсаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;
	//Если СтрокаТЧ <> Неопределено Тогда
		СтрокаТЧ.ЦенаСНаценкой = СтрокаТЧ.ЦенаИнвойса + СтрокаТЧ.Наценка;
		СтрокаТЧ.ЦенаЗакупки = СтрокаТЧ.ЦенаСНаценкой;
	//КонецЕсли;	
	ОбновитьПроцентНаценки();
	ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыНаценкаПриИзменении(Элемент)

	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;
	СтрокаТЧ.ЦенаСНаценкой 	= СтрокаТЧ.ЦенаИнвойса + СтрокаТЧ.Наценка; 
	СтрокаТЧ.ЦенаЗакупки 	= СтрокаТЧ.ЦенаСНаценкой;   
	СтрокаТЧ.СуммаЗакупки 	= СтрокаТЧ.Количество * СтрокаТЧ.ЦенаЗакупки;
	ОбновитьПроцентНаценки();

КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыЦенаСНаценкойПриИзменении(Элемент)

	СтрокаТЧ = Элементы.ВКД_Товары.ТекущиеДанные;
	//Если СтрокаТЧ <> Неопределено Тогда
		СтрокаТЧ.Наценка = СтрокаТЧ.ЦенаСНаценкой - СтрокаТЧ.ЦенаИнвойса;
	ОбновитьПроцентНаценки();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыПриИзменении(Элемент)

    Объект.Сумма 						= Объект.ВКД_Товары.Итог("СуммаЗакупки");
	Объект.ВКД_СуммаЗакупкиСоСкидкой 	= Объект.ВКД_Товары.Итог("СуммаЗакупкиСоСкидкой");
	Объект.ВКД_Количество				= Объект.ВКД_Товары.Итог("Количество");

	ОбновитьИтоги();
    ЗаполнитьКэшДанных(Истина);
	ОбновитьИДСтрок();

КонецПроцедуры 

&НаКлиенте
Процедура ВКД_ТоварыПослеУдаления(Элемент)
	
	ОбновитьИнвойсСкорректированный();
	ОтобразитьРазницуИнвойсов();

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

#КонецОбласти


// © Primus1C  24.06.2023  НАЧАЛО ►

#Область Служебные

&НаСервере
Процедура ВычислитьТолькоУслуги()
	
	ТолькоУслуги = Истина;
	Для	Каждого СтрокаТч ИЗ Объект.ВКД_Товары Цикл
		Если СтрокаТч.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			ТолькоУслуги = Ложь;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	ВычислитьТолькоУслуги();
	Элементы.КонтрольВКД_Количество.Видимость = НЕ Объект.ТолькоУслуги;

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект, Истина, Ложь); 
	//Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
    Элементы.ДекорацияСумма.Заголовок 			= Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Сумма));
    Элементы.ДекорацияКоличество.Заголовок 		= Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Количество));
    Элементы.ДекорацияСкидка.Заголовок 			= Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Скидка));
    Элементы.ДекорацияСуммаСоСкидкой.Заголовок 	= Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.СуммаСоСкидкой));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветСтатусов()
	
	Если КэшРаскраски.РаскрашиватьСтатусы Тогда  
		Цв = КэшРаскраски.ЦветаСтатусов.Получить(Строка(СтатусДокумента));
		Если Цв <> Неопределено Тогда
			Элементы.СтатусДокумента.ЦветФона = Цв;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшРаскраски.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшРаскраски.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли;
	Элементы.Оплата.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Валюта оплаты'; en = 'Payment currency'"), Объект.Валюта);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступЛогиста()

	Возврат РольДоступна("Логистика") ИЛИ РольДоступна("Администратор");	

КонецФункции 

&НаСервере
Процедура ЗаполнитьКэшДанных(ТолькоКоличествоИСумму)
	
	Если НЕ ТолькоКоличествоИСумму Тогда
	
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			
			Запр = Новый Запрос;
			Запр.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
			Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
			Запр.Текст = "ВЫБРАТЬ
			             |	ЕСТЬNULL(СУММА(Инвойс.СуммаВВалютеИнвойса), 0) КАК СуммаВВалютеИнвойса
			             |ИЗ
			             |	Документ._Инвойс КАК Инвойс
			             |ГДЕ
			             |	Инвойс.ДокументОснование = &ДокументОснование
			             |	И НЕ Инвойс.ПометкаУдаления
			             |	И Инвойс.Ссылка <> &Ссылка
			             |;
			             |
			             |////////////////////////////////////////////////////////////////////////////////
			             |ВЫБРАТЬ
			             |	ИнвойсЗакупки.НомерИнвойсаПоставщика КАК ВКД_НомерИнвойсаПоставщика,
			             |	ИнвойсЗакупки.ДатаИнвойсаПоставщика КАК ВКД_ДатаИнвойсаПоставщика,
			             |	ИнвойсЗакупки.Количество КАК ВКД_Количество,
			             |	ИнвойсЗакупки.Сумма КАК СуммаВВалютеИнвойса,
			             |	ИнвойсЗакупки.Контрагент КАК Контрагент
			             |ИЗ
			             |	Документ.ИнвойсЗакупки КАК ИнвойсЗакупки
			             |ГДЕ
			             |	ИнвойсЗакупки.Ссылка = &ДокументОснование";  
			Пакет = Запр.ВыполнитьПакет();
			Выгрузка0 = Пакет[0].Выгрузить();
			Выгрузка1 = Пакет[1].Выгрузить();
			Если Выгрузка1.Количество() = 0 Тогда   
			    КэшДанных = Неопределено;
			Иначе
				КэшДанных = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выгрузка1[0]);
				КэшДанных.Вставить("СуммаДругихИнвойсов", Выгрузка0[0].СуммаВВалютеИнвойса);
			КонецЕсли; 
			
		Иначе
		    КэшДанных = Новый Структура;
		КонецЕсли;
	
	КонецЕсли; 
	
	КэшДанных.Вставить("СимволВалюты", Объект.Валюта.Символ); 
	
	//СкорректированныеДанные = ОбщегоНазначенияСервер.СуммаКоличествоИнвойсаСУчетомКорректировок(Объект.Ссылка);
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	КэшДанных.Вставить("КоличествоКор", СкорректированныеДанные.Количество);
	//	КэшДанных.Вставить("КоличествоСум", СкорректированныеДанные.Сумма);
	//Иначе
	//	КэшДанных.Вставить("Количество", Объект.ВКД_Товары.Итог("Количество"));
	//	КэшДанных.Вставить("Сумма", Объект.ВКД_Товары.Итог("СуммаЗакупки"));
	//КонецЕсли; 
	
	КэшРаскраски = Новый Структура;
    КэшРаскраски.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	КэшРаскраски.Вставить("ЦветаВалют", 		ОбщегоНазначенияПовтИсп.ЦветаВалют());
	КэшРаскраски.Вставить("РаскрашиватьСтатусы", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеДокумента"));
	КэшРаскраски.Вставить("ЦветаСтатусов", 		ОбщегоНазначенияПовтИсп.ЦветаСтатусов());
	
КонецПроцедуры

#КонецОбласти     

&НаКлиенте
Процедура НаценкаЕстьНет(Команда)
	
	Объект.Наценка = НЕ Объект.Наценка;
	УстановитьВидимостьНаценки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНаценки()
	
	Элементы.ВКД_ТоварыНаценкаЕстьНет.Пометка = Объект.Наценка;
	Элементы.ГруппаНаценка.Видимость = Объект.Наценка;

КонецПроцедуры


&НаКлиенте
Процедура ДокументОснованиеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОткрытьЗначение(Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьРазницуИнвойсов()
	
	ОбновитьСуммуВВалютеИнвойса();	
	
	Если КэшДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	Для каждого Эл Из КэшДанных Цикл
		Попытка
			Если Эл.Ключ = "СуммаВВалютеИнвойса" Тогда
				РазницаОК = Эл.Значение = ИтогСуммаВВалютеИнвойса + КэшДанных.СуммаДругихИнвойсов;
			Иначе	
				РазницаОК = Объект[Эл.Ключ] = Эл.Значение;
			КонецЕсли;
			Элементы["Контроль"+Эл.Ключ].Картинка = ?(разницаОК, БиблиотекаКартинок.ОформлениеЗнакФлажок, БиблиотекаКартинок.ОформлениеЗнакКрест);	
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	лПривязыватьИнвойсы = омСервер.ПолучитьРеквизит(Объект.Контрагент, "ПривязыватьИнвойсы");
	Если омСервер.ПолучитьРеквизит(Объект.ДокументОснование, "Валюта") = Объект.Валюта Тогда
		Элементы.ГруппаВалюта.Видимость = Ложь;
	Иначе
		Элементы.ГруппаВалюта.Видимость = Истина;
		Элементы.КурсУстановленВручную.Видимость = лПривязыватьИнвойсы; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВВалюту(Команда)

	Если Объект.Курс = 0 Тогда
	     клОшибка(НСтр("ru = 'Не указан курс!'; en = 'Rate not specified!'"));
	Иначе	
	    Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
			ПересчитатьЦенуИСуммуПоКурсу(СтрокаТЧ);
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуВВалютеИнвойса()

	ИтогСуммаВВалютеИнвойса = 0;  
	Для каждого Товар Из Объект.ВКД_Товары Цикл
		ИтогСуммаВВалютеИнвойса = ИтогСуммаВВалютеИнвойса + Товар.Количество * Товар.ЦенаИнвойса;
	КонецЦикла;      
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПроцентНаценки()

	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
    	СтрокаТЧ.ПроцентНаценки = ?(СтрокаТЧ.ЦенаИнвойса=0, "", Формат(СтрокаТЧ.Наценка/СтрокаТЧ.ЦенаИнвойса*100, "ЧДЦ=2"));
		Если СтрокаТЧ.ПроцентНаценки <> "" Тогда
			СтрокаТЧ.ПроцентНаценки = СтрокаТЧ.ПроцентНаценки + "%"
		КонецЕсли;
	КонецЦикла;      
		
КонецПроцедуры	


#Область Поставки

&НаКлиенте
Процедура ДобавитьПоставку(Команда)  
	
	Если КоличествоПоставок = 0 Тогда
		ОбновитьИДСтрок();	
	КонецЕсли;
	
	Если КоличествоПоставок > 8 Тогда
		клОшибка(НСтр("ru = 'Количество поставок слишком велико! Обратитесь к разработчику'; en = 'The supply delivery is too large! Contact the developer!'"));
		Возврат;		                      
	КонецЕсли;                
	
	Если НЕ Объект.Проведен Тогда
		клПредупреждение(НСтр("ru = 'Сначала проведите документ!'; en = 'Post the document first!'"), 5, НСтр("ru = 'Добавление поставки'; en = 'Adding a delivery'"));
		Возврат;
	КонецЕсли;          
	
	КоличествоПоставок = КоличествоПоставок + 1;  

	ОтправкиИнвойса = ОтправкиИнвойса();
	Если ОтправкиИнвойса.Количество() > 0 Тогда  
		Если ОтправкиИнвойса.Количество() = 1 Тогда
			стр = НСтр("ru = 'отправке'; en = 'the shipment'")
		Иначе
			стр = НСтр("ru = 'отправках'; en = 'shipments'")
		КонецЕсли;
	    клИнфоСписок(НСтр("ru = 'Инвойс найден в '; en = 'Invoice found in '") + стр, ОтправкиИнвойса);
		Возврат;
	КонецЕсли;
	
	ДобавитьПоставкуНаСервере(КоличествоПоставок, Истина);  
	
	ОбновитьИтогиПоставок(КоличествоПоставок);
	ОбновитьНадписиФормы();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоставкуНаСервере(НомерПоставки, ЭтоНоваяПоставка=Ложь)

	Для каждого СтрокаИнвойсаСкорр Из ИнвойсСкорректированный Цикл
		НовСтрока = Поставки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаИнвойсаСкорр, "ИдСтроки,Номенклатура");   
		Если ЭтоНоваяПоставка Тогда
			// перенесем кол-во из скорр.инвойса
			НовСтрока.Количество 	= Макс(СтрокаИнвойсаСкорр.Остаток, 0); 
			НовСтрока.Цена			= ЦенаЗакупкиПоИдСтрокиНаСервере(НовСтрока.ИдСтроки);
			Если НовСтрока.Цена = 0 И СтрокаИнвойсаСкорр.КоличествоИнвойса <> 0 Тогда
				НовСтрока.Цена = СтрокаИнвойсаСкорр.СуммаИнвойса / СтрокаИнвойсаСкорр.КоличествоИнвойса;
			КонецЕсли;
			НовСтрока.Сумма 		= НовСтрока.Цена * НовСтрока.Количество;
		Иначе
			// перенесем кол-во из ТЧ			
			НайдСтрокиТЧ = Объект.Поставки.НайтиСтроки(Новый Структура("ИдСтроки,Поставка", НовСтрока.ИдСтроки, НомерПоставки));
			Для каждого СтрокаТЧ Из НайдСтрокиТЧ Цикл
				НовСтрока.Количество = СтрокаТЧ.Количество;
				НовСтрока.Цена = ЦенаЗакупкиПоИдСтрокиНаСервере(НовСтрока.ИдСтроки);
				Если НовСтрока.Цена = 0 И СтрокаТЧ.Количество <> 0 Тогда
					НовСтрока.Цена = СтрокаТЧ.Сумма / СтрокаТЧ.Количество;
				КонецЕсли;
				НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
			КонецЦикла;
			// рассчитаем остаток
			Ост = СтрокаИнвойсаСкорр.КоличествоИнвойса;
			НайдСтрокиТЧ = Объект.Поставки.НайтиСтроки(Новый Структура("ИдСтроки", НовСтрока.ИдСтроки));
			Для каждого СтрокаТЧ Из НайдСтрокиТЧ Цикл
				Ост = Ост - СтрокаТЧ.Количество;
			КонецЦикла;
			НовСтрока.Остаток = Ост;
		КонецЕсли;        
		НовСтрока.Поставка				= НомерПоставки;  
		НовСтрока.НомерСтрокиИнвойса 	= СтрокаИнвойсаСкорр.НомерСтрокиИнвойса;
		НовСтрока.Пометка 				= НовСтрока.Количество > 0; 
	КонецЦикла; 
	
	// обновим все остатки 
	Для Каждого СтрокаТовар ИЗ Объект.ВКД_Товары Цикл 
		Остаток = СтрокаТовар.Количество;
        НайдСтроки = Поставки.НайтиСтроки(Новый Структура("ИдСтроки", СтрокаТовар.ИдСтроки)); 
		Для каждого НайдСтрока Из НайдСтроки Цикл
			Остаток = Остаток - НайдСтрока.Количество;
		КонецЦикла;
		Для каждого НайдСтрока Из НайдСтроки Цикл
			НайдСтрока.Остаток = Остаток;
		КонецЦикла;
	КонецЦикла;
	
	//
	ЭлементИсточника 	= Элементы.ПоставкаШаблон;
	ПрефиксКопии 		= "П" + НомерПоставки;
 	ГруппаЭлементов 	= Элементы.ГруппаПоставки;
    СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, ГруппаЭлементов);
	
	// Заголовок закладки                                                              
	Элементы[ПрефиксКопии + "ПоставкаШаблон"].Видимость = Истина;
	Элементы[ПрефиксКопии + "ПоставкаШаблон"].Заголовок = НСтр("ru = 'Поставка '; en = 'Delivery '") + НомерПоставки;
	// отбор по номеру поставки
	Элементы[ПрефиксКопии + "Поставки"].ОтборСтрок = Новый ФиксированнаяСтруктура("Поставка", НомерПоставки); 
	//события табл.поля 
	Элементы[ПрефиксКопии + "Поставки"].УстановитьДействие("ПередУдалением", "ПоставкиПередУдалением");
	Элементы[ПрефиксКопии + "Поставки"].УстановитьДействие("ПередНачаломДобавления", "ПоставкиПередНачаломДобавления");
	Элементы[ПрефиксКопии + "Поставки"].ИзменятьПорядокСтрок = Ложь;
	
	// надпись на кнопке
	Если Элементы.Найти(ПрефиксКопии + "УдалитьПоставку") <> Неопределено Тогда
		Элементы[ПрефиксКопии + "УдалитьПоставку"].Заголовок = НСтр("ru = 'Удалить поставку '; en = 'Delete delivery '") + НомерПоставки;
	КонецЕсли;
	
	Если ЭтоНоваяПоставка Тогда
		ПеренестиДанныеПоставкиСФормыВТЧ();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ОтправкиИнвойса()

	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Инвойс", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ОтправкаИнвойсов.Регистратор КАК Ссылка
	             |ИЗ
	             |	РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |ГДЕ
	             |	ОтправкаИнвойсов.Инвойс = &Инвойс
	             |	И ОтправкаИнвойсов.Регистратор ССЫЛКА Документ.Отправка"; 
	спис = Новый СписокЗначений; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Спис.Добавить(Выборка.Ссылка, Выборка.Ссылка, , БиблиотекаКартинок.ЗаписатьИЗакрыть);
	КонецЦикла;
	Возврат спис;

КонецФункции // ОтправкиИнвойса()

&НаСервере
Процедура ПеренестиДанныеПоставкиСФормыВТЧ()

	Объект.Поставки.Очистить();
	Для каждого СтрокаПоставки Из Поставки Цикл
		Если СтрокаПоставки.Количество <> 0 Тогда
			НовСтрока = Объект.Поставки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаПоставки, "ИдСтроки,Номенклатура,Количество,Сумма,Поставка"); 
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПоставку(Команда)
	
	Если Элементы.ГруппаПоставки.ТекущаяСтраница = Неопределено Тогда
		ТекПоставка = "1";	
	Иначе
		ТекПоставка = Сред(Элементы.ГруппаПоставки.ТекущаяСтраница.Имя, 2, 1);
	КонецЕсли;
	УдалитьПоставкуНаСервере();

	УдСтроки = Поставки.НайтиСтроки(Новый Структура("Поставка", Число(ТекПоставка)));
	Для каждого УдСтрока Из УдСтроки Цикл
		Поставки.Удалить(УдСтрока);
	КонецЦикла;
	
	Для каждого стрПоставка Из Поставки Цикл
		Если стрПоставка.Поставка > Число(ТекПоставка) Тогда
			стрПоставка.Поставка = стрПоставка.Поставка - 1;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоПоставок = КоличествоПоставок - 1;

	ПеренестиДанныеПоставкиСФормыВТЧ();
	ОбновитьИнвойсСкорректированный();
	ОбновитьИтогиПоставок();
	ОбновитьНадписиФормы();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПоставкуНаСервере()
	
	ЭтаФорма.Элементы.Удалить(этаформа.Элементы["П" + КоличествоПоставок + "ПоставкаШаблон"]);  

КонецПроцедуры

#КонецОбласти


#Область КопированиеЗакладкиПоставка 

&НаСервере
Функция СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, ГруппаЭлементов = Неопределено)
	
    Тип = ТипЗнч(ЭлементИсточника);
    
    ЭлементПриемника = Элементы.Добавить(ПрефиксКопии + ЭлементИсточника.Имя, Тип, ГруппаЭлементов);
	
    Если Тип = Тип("ГруппаФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
        
        Если ЭлементИсточника.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страницы Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ТекущаяСтраница");
            
            СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.Страница Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымЗаголовка");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымШапки");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
            
        КонецЕсли;
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
    ИначеЕсли Тип = Тип("ПолеФормы") Тогда
        
        ЭлементПриемника.Вид = ЭлементИсточника.Вид;
		
		//+
       	// ЭлементПриемника.ПутьКДанным = ПрефиксКопии + ЭлементИсточника.ПутьКДанным;
        ЭлементПриемника.ПутьКДанным = ЭлементИсточника.ПутьКДанным;
		//-
		
        Если ЭлементИсточника.Вид = ВидПоляФормы.ПолеВвода Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ВыделенныйТекст, СвязьПоТипу, ПутьКДанным");
            
            Если ЭлементИсточника.СвязьПоТипу.ПутьКДанным <> "" Тогда
                ПутьКДаннымСвязиПриемника = СтрЗаменить(ЭлементИсточника.СвязьПоТипу.ПутьКДанным, "Элементы." , "Элементы." + ПрефиксКопии);
                ЭлементПриемника.СвязьПоТипу = Новый СвязьПоТипу(ПутьКДаннымСвязиПриемника, ЭлементИсточника.СвязьПоТипу.ЭлементСвязи);    
            КонецЕсли;
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеПереключателя Тогда
            
            ЗаполнитьКоллекциюСвойств(ЭлементПриемника.СписокВыбора, ЭлементИсточника.СписокВыбора);
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        ИначеЕсли ЭлементИсточника.Вид = ВидПоляФормы.ПолеФорматированногоДокумента Тогда
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным, ВыделенныйТекст");
            
        Иначе
            
            ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,,"ПутьКДанным");
            
        КонецЕсли;
        
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
        
    ИначеЕсли Тип = Тип("ТаблицаФормы") Тогда
		
		//+
        //ЭлементПриемника.ПутьКДанным = ПрефиксКопии + ЭлементИсточника.ПутьКДанным;
        ЭлементПриемника.ПутьКДанным = ЭлементИсточника.ПутьКДанным;
        //-
		
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника,, "ПутьКДаннымКартинкиСтроки, ПутьКДанным, ДополнительныеПараметрыСоздания, ЗапросОбновления");
        
        СкопироватьПодчиненныеЭлементы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
        СкопироватьКнопкиКоманднойПанелиТаблицы(ЭлементПриемника.КоманднаяПанель, ЭлементИсточника.КоманднаяПанель, ПрефиксКопии);
        
        СкопироватьСобытия(ЭлементПриемника, ЭлементИсточника);
        
    ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
        
        СкопироватьКоманду(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
        
    Иначе
        
        ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
        
    КонецЕсли;
    
КонецФункции

&НаСервере
Процедура СкопироватьПодчиненныеЭлементы(Приемник, Источник, ПрефиксКопии) Экспорт
    
    Для Каждого ЭлементИсточника Из Источник.ПодчиненныеЭлементы Цикл
        СоздатьКопиюЭлемента(ЭлементИсточника, ПрефиксКопии, Приемник);
    КонецЦикла;
    
КонецПроцедуры

// Служебные для копирования

&НаСервереБезКонтекста
Процедура ЗаполнитьКоллекциюСвойств(КоллекцияПриемник, КоллекцияИсточник)
    
    Для Каждого Элемент Из КоллекцияИсточник Цикл
        ЗаполнитьЗначенияСвойств(КоллекцияПриемник.Добавить(), Элемент);
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьКнопкиКоманднойПанелиТаблицы(ГруппаКнопокПриемник, ГруппаКнопокИсточник,ПрефиксКопии) Экспорт
    
    Для Каждого ЭлементИсточника из ГруппаКнопокИсточник.ПодчиненныеЭлементы Цикл
        // Созданные элементы командных панелей таблиц должны содержать слово "кнопка" или "кнопки".
        // Это необходимо, чтобы отличить их от стандартных элементов, которые генерируются в источнике сами
        Если Найти(НРег(ЭлементИсточника.Имя), "кнопк") > 0 Тогда
            
            Тип = ТипЗнч(ЭлементИсточника);
            ЭлементПриемника = Элементы.Добавить(ПрефиксКопии + ЭлементИсточника.Имя, Тип, ГруппаКнопокПриемник);
            
            Если Тип = Тип("ГруппаФормы") Тогда
                
                ЭлементПриемника.Вид = ЭлементИсточника.Вид;
                
                ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
                
                СкопироватьКнопкиКоманднойПанелиТаблицы(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
                
            ИначеЕсли Тип = Тип("КнопкаФормы") Тогда
                
                ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
                
                СкопироватьКоманду(ЭлементПриемника, ЭлементИсточника, ПрефиксКопии);
                
            КонецЕсли;    
            
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьКоманду(ЭлементПриемник, ЭлементИсточник, ПрефиксКопии) Экспорт
    
    КомандаИсточник = Команды.Найти(ЭлементИсточник.ИмяКоманды);
    
    КомандаПриемник = Команды.Найти(ПрефиксКопии + КомандаИсточник.Имя); //Две кнопки могут ссылаться на одну команду
    
    Если КомандаПриемник = Неопределено Тогда
        КомандаПриемник = Команды.Добавить(ПрефиксКопии + КомандаИсточник.Имя);
    КонецЕсли;     
    
    ЗаполнитьЗначенияСвойств(КомандаПриемник, КомандаИсточник, , "Имя");
    
    ЭлементПриемник.ИмяКоманды = КомандаПриемник.Имя;
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьСобытия(ЭлементПриемник, ЭлементИсточник) Экспорт
    
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриИзменении");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "НачалоВыбораИзСписка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Очистка");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Выбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Регулирование");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "Открытие");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОбработкаВыбора");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "АвтоПодбор");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ОкончаниеВводаТекста");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриОбновленииСоставаПользовательскихНастроекНаСервере");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриНачалеРедактирования");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломДобавления");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПередНачаломИзменения");
    СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, "ПриАктивизацииСтроки");
    
КонецПроцедуры

&НаСервере
Процедура СкопироватьСобытие(ЭлементПриемник, ЭлементИсточник, ИмяСобытия) Экспорт
    
    Действие = ЭлементИсточник.ПолучитьДействие(ИмяСобытия);
    
    Если Действие <> "" Тогда
        ЭлементПриемник.УстановитьДействие(ИмяСобытия, Действие);
    КонецЕсли;
    
КонецПроцедуры	

#КонецОбласти               


#Область Поставки
	
&НаКлиенте
Процедура ПоставкаУстановитьПометки(Команда)
	
	ИзменитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставкаСнятьПометки(Команда)
	ИзменитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоставкаИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометки(ЗначениеПометки)
	
	ТекПоставка = Сред(Элементы.ГруппаПоставки.ТекущаяСтраница.Имя, 2, 1);
	ТаблицаФормы = Элементы["П" + ТекПоставка + "Поставки"];
	
	НайдСтроки = Поставки.НайтиСтроки(Новый Структура("Поставка", Число(ТекПоставка)));
	Для каждого ТекСтрока Из НайдСтроки Цикл   
		
		Если ЗначениеПометки = Неопределено Тогда
			ТекСтрока.Пометка = НЕ ТекСтрока.Пометка;
		Иначе
			ТекСтрока.Пометка = ЗначениеПометки;
		КонецЕсли;    
		
		ПрименитьПометкуСтрокиПоставки(ТекСтрока);
		
	КонецЦикла; 

	ПеренестиДанныеПоставкиСФормыВТЧ();
	ОбновитьИнвойсСкорректированный();
	ОбновитьИтогиПоставок(Число(ТекПоставка)); 
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПоставкиПометкаПриИзменении(Элемент)

	ТекДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ПрименитьПометкуСтрокиПоставки(ТекДанные);
	ПеренестиДанныеПоставкиСФормыВТЧ();
	ОбновитьИнвойсСкорректированный();
	ОбновитьИтогиПоставок(ТекДанные.Поставка);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставкиКоличествоПриИзменении(Элемент)
	
	ТекДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные; 
	ТекДанные.Остаток = ТекДанные.Остаток + КоличествоПоставкиДоРедактирования - ТекДанные.Количество; 
	ПересчитатьСуммуСтрокиПоставки(ТекДанные);
	ТекДанные.Пометка = ТекДанные.Количество <> 0;	
	
	ПеренестиДанныеПоставкиСФормыВТЧ();
	ОбновитьИнвойсСкорректированный();
	ОбновитьИтогиПоставок(ТекДанные.Поставка);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПоставкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоставкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоставкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	КоличествоПоставкиДоРедактирования = ТекДанные.Количество;

КонецПроцедуры

&НаКлиенте
Процедура КонтрольНажатие(Элемент)  
	
	Если КэшДанных = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда	
		Возврат;
	КонецЕсли;	
	
	Ключ = СтрЗаменить(Элемент.Имя, "Контроль", ""); 
	Если ТипЗнч(КэшДанных[Ключ]) = Тип("Дата") Тогда 
		Если КэшДанных[Ключ] = Дата(1,1,1) Тогда
		  	лЗнач = НСтр("ru = '<не задана>'; en = '<not specified>'");
		Иначе
			лЗнач = Формат(КэшДанных[Ключ], "ДФ=dd.MM.yyyy");
		КонецЕсли;
	Иначе
	   лЗнач = КэшДанных[Ключ] 
	КонецЕсли;

	Сообщить(Элемент.Заголовок + НСтр("ru = ' в инвойсе закупки: '; en = ' in the purchase invoice: '") + лЗнач, СтатусСообщения.Информация);  
	
КонецПроцедуры

#КонецОбласти


#Область Сообщения

&НаКлиенте
Процедура НажатиеКнопкиОтобразитьСообщения(Команда)

	ВидимостьПанелиСообщений = НЕ ВидимостьПанелиСообщений;
	Элементы.КнопкаСообщения.Пометка = ВидимостьПанелиСообщений;
	ПоказатьСкрытьПанельСообщений();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьСкрытьПанельСообщений()

	Элементы.ГруппаСообщения.Видимость = ВидимостьПанелиСообщений;
	Если ВидимостьПанелиСообщений Тогда
		ОбновитьСообщенияНаФорме();
		ПодключитьОбработчикОжидания("ОбновитьСообщенияНаФорме", Сооб_Сервер.ПериодОбновленияЧата(), Ложь);
	Иначе
	    ОтключитьОбработчикОжидания("ОбновитьСообщенияНаФорме");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СообщПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ИД = ДанныеСобытия.Element.id;
	//Сообщить(ИД);
	
	Если Лев(ИД, 7) = "answer_" Тогда
		Сооб_Клиент.СоздатьЗаписьРССообщения(ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Сообщение"), ПользовательПоКоду(СтрЗаменить(ИД, "answer_","")));		
	ИначеЕсли Лев(ИД, 5) = "doit_" Тогда

		ОбновитьСообщенияНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательПоКоду(Код)
	
	Возврат Справочники.Пользователи.НайтиПоКоду(Код);

КонецФункции 

&НаКлиенте
Процедура СоздатьСообщение(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Сообщение"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНапоминание(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Напоминание"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручение(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Поручение"));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСообщенияНаФорме()

	КэшСообщений = Сооб_Сервер.СообщенияОбъекта(Объект.Ссылка);
	Элементы.КнопкаСообщения.Заголовок = НСтр("ru = 'Сообщения'; en = 'Messages'") + Формат(КэшСообщений.КоличествоСообщений,"ЧДЦ=0; ЧН=' '; ЧФ=' :Ч'");
	СообщенияОбъекта = КэшСообщений.СтрокаHTML;
	 
КонецПроцедуры

#КонецОбласти

                         
#Область Файлы

&НаКлиенте
Процедура ФайлыНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		//Сообщить(НСтр("ru = 'Документ не записан!'; en = 'The document is not saved!'"));
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.ХранилищеФайлов.Форма.УпрФормаСписка", 
				Новый Структура("ОбъектУИД,Владелец", ЭтаФорма.Объект.ДокументОснование.УникальныйИдентификатор(), Объект.ДокументОснование), 
				ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.ДокументОснование, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.ДокументОснование, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), 
																"НажатиеГиперссылкиФайла");

КонецПроцедуры

#КонецОбласти


#Область Замены

&НаКлиенте
Процедура ЗаменаЗаменить(Команда)
	
	ВызватьЗаменуРазделение("Замена");	 

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаРазделить(Команда)

	ВызватьЗаменуРазделение("Разделение");	 
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьЗаменуРазделение(Режим)

	Перем ВыбНоменклатура;
	
	Если Элементы.ВКД_Товары.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ОбновитьИДСтрок();      
	ЕстьВПоставках = Ложь;
	МассивЗамен = Новый Массив;
	ТекущиеДанные = Элементы.ВКД_Товары.ТекущиеДанные;  
	НайдСтроки = Поставки.НайтиСтроки(Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура));
	Для каждого СтрокаЗамен Из НайдСтроки Цикл
		СтруктураСтроки = Новый Структура("Номенклатура,Количество,Поставка,ИдСтроки,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаЗамен, "Номенклатура,Количество,Поставка,ИдСтроки"); 
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные, "ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса"); 
		МассивЗамен.Добавить(СтруктураСтроки);   
		Если СтрокаЗамен.Количество > 0 Тогда
			ЕстьВПоставках = Истина;
		КонецЕсли;
	КонецЦикла;  
	
	Если ЕстьВПоставках Тогда   
		
		ПараметрыЗамены = Новый Структура( "МассивЗамен,Режим,Инвойс,Номенклатура,Количество,ИдСтроки,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса",
											МассивЗамен,    
											Режим,
											Объект.Ссылка, 
											ТекущиеДанные.Номенклатура, 
											ТекущиеДанные.Количество, 
											ТекущиеДанные.ИдСтроки, 
											ТекущиеДанные.ЦенаЗакупки, 
											ТекущиеДанные.ЦенаСоСкидкой,
	                                        ТекущиеДанные.ЦенаИнвойса );
		ОткрытьФорму("Документ._Инвойс.Форма.ФормаРазделения", ПараметрыЗамены, ЭтаФорма, ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе
		
		ИДИ = ТекущиеДанные.ПолучитьИдентификатор();
		ВыбНоменклатура = ТекущиеДанные.Номенклатура; 
		ПоказатьВводЗначения(Новый ОписаниеОповещения("ВызватьЗаменуРазделениеПослеВыбораНоменклатуры", ЭтотОбъект, ИДИ), 
			ВыбНоменклатура, НСтр("ru = 'Выберите замену'; en = 'Select a substitution'"), Тип("СправочникСсылка.Номенклатура"));
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВызватьЗаменуРазделениеПослеВыбораНоменклатуры(ВыбНоменклатура, ИДИ) Экспорт
	Если ВыбНоменклатура = Неопределено Тогда Возврат КонецЕсли;
	
	ТекущиеДанные = Объект.ВКД_Товары.НайтиПоИдентификатору(ИДИ);
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	клНамекнуть(ТекущиеДанные.Номенклатура, 
				НСтр("ru = 'Номенклатура не участвует в поставках'; en = 'This good not involved in deliveries'"),
				БиблиотекаКартинок.Инфо);
	ТекущиеДанные.Номенклатура = ВыбНоменклатура; 
	НайдСтроки = Поставки.НайтиСтроки(Новый Структура("ИдСТроки", ТекущиеДанные.ИдСтроки));
	Для каждого Стр Из НайдСтроки Цикл
		Стр.Номенклатура = ВыбНоменклатура;	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ЗаменаЗаписатьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаЗаписать(Команда)
	ЗаменаЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИДСтрок()
	
	Ид = 0;      
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		Ид = Макс(Ид, СтрокаТЧ.ИдСтроки);	
	КонецЦикла;	
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		Ид = Ид + 1;
		Если СтрокаТЧ.ИдСтроки = 0 Тогда
			СтрокаТЧ.ИдСтроки = Ид;	
		КонецЕсли;
	КонецЦикла;
	     
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	Если Копирование Тогда
		Отказ = Истина;
		НоваяСтрока = Объект.ВКД_Товары.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент.ТекущиеДанные);
		НоваяСтрока.ИдСтроки = 0;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыБезНДС(Команда)
	
	НДС = 0;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("РассчитатьСуммыБезНДСПослеВводаСтавки", ЭтотОбъект), НДС, НСтр("ru = 'Ставка НДС, %'; en = 'WAT, %'"), 5, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыБезНДСПослеВводаСтавки(НДС, ДопПараметры) Экспорт 
	
	Если НДС = Неопределено Тогда Возврат КонецЕсли;
	
	//НДС = 1 / (1 + НДС/100);
	//НДС = НДС /100;
	Для каждого СтрокаТЧ Из Объект.ВКД_Товары Цикл
		СтрокаТЧ.ЦенаБезНДС 	= СтрокаТЧ.ЦенаИнвойса / (1 + НДС/100);
		СтрокаТЧ.СуммаНДС 		= СтрокаТЧ.ЦенаИнвойса * СтрокаТЧ.Количество / (1 + НДС/100) * НДС/100;
		СтрокаТЧ.СуммаБезНДС	= СтрокаТЧ.ЦенаБезНДС * СтрокаТЧ.Количество; 
		СтрокаТЧ.ЦенаЗакупки	= СтрокаТЧ.ЦенаБезНДС / ?(Объект.Курс=0, 1, Объект.Курс);
		СтрокаТЧ.СуммаЗакупки 	= СтрокаТЧ.СуммаБезНДС / ?(Объект.Курс=0, 1, Объект.Курс);
	КонецЦикла;
	ОбновитьПроцентНаценки();  
	УстановитьВидимостьНДС();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНДС()

	Режим = Объект.ВКД_Товары.Итог("СуммаНДС") > 0;
	Элементы.ГруппаНДС.Видимость = Режим;

КонецПроцедуры



//&НаСервере
//Процедура УстановитьУсловноеОформлениеЗамен()

//	Для каждого Эл Из УсловноеОформление.Элементы Цикл
//		Если Эл.ИдентификаторПользовательскойНастройки = "Замена" ИЛИ Эл.ИдентификаторПользовательскойНастройки = "Разделение" Тогда
//			УсловноеОформление.Элементы.Удалить(Эл);	
//		КонецЕсли;
//	КонецЦикла;

//	Элемент = УсловноеОформление.Элементы.Добавить();
//	Элемент.ИдентификаторПользовательскойНастройки = "ЗаменаРазделение"; 
//	
//	Для каждого ЭлтФормы Из Элементы.ВКД_Товары.ПодчиненныеЭлементы Цикл
//		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлтФормы.Имя);
//		ПолеЭлемента.Использование = Истина;
//	КонецЦикла;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВКД_Товары.ИДСтроки");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	ОтборЭлемента.ПравоеЗначение = СписокЗамененных;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(204,255,204));
//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	Элемент.ИдентификаторПользовательскойНастройки = "Разделение"; 
//	
//	Для каждого ЭлтФормы Из Элементы.ВКД_Товары.ПодчиненныеЭлементы Цикл
//		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлтФормы.Имя);
//		ПолеЭлемента.Использование = Истина;
//	КонецЦикла;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВКД_Товары.ИДСтроки");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	ОтборЭлемента.ПравоеЗначение = СписокРазделенных;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,255,190));
//		
//КонецПроцедуры

#КонецОбласти  


#Область Дерево_Затрат

&НаКлиенте
Процедура ОбновитьДеревоЗатрат(Команда) 
	
	МассивЗатрат = Новый Массив;
	ЗаполнитьДеревоЗначенийНаСервере(МассивЗатрат);  
	
	СтруктураЗатрат = омСервер.МоиИтогиФорматированные(Новый Структура("Ссылка", МассивЗатрат), Ложь, Ложь, Истина); 
    Элементы.ДекорацияЗатраты.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураЗатрат.Затраты));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗначенийНаСервере(МассивЗатрат)
	
	Дер = РеквизитФормыВЗначение("Затраты");
	Дер.Строки.Очистить(); 
	
	УстановитьПривилегированныйРежим(Истина);
	
    Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ 
	             |	ДвижениеДенегИнвойсы.Ссылка.Затрата КАК Затрата,
	             |	ДвижениеДенегИнвойсы.Ссылка КАК Документ,
	             |	ДвижениеДенегИнвойсы.Сумма КАК Сумма,
	             |	ДвижениеДенегИнвойсы.Ссылка.Валюта КАК Валюта
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	             |ГДЕ
	             |	ДвижениеДенегИнвойсы.Инвойс = &Ссылка
	             |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	             |	И ДвижениеДенегИнвойсы.Ссылка.ВидДвиженияДенег = Значение(Перечисление.ВидДвиженияДенег.Логистика)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ.Затрата КАК Затрата,
	             |	ВТ.Документ КАК Документ,
	             |	ВТ.Сумма КАК Сумма,
	             |	ВТ.Валюта КАК Валюта
	             |ИЗ
	             |	ВТ КАК ВТ
	             |ИТОГИ
	             |	СУММА(Сумма)
	             |ПО
	             |	Затрата,
	             |	Документ,
	             |	Валюта
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СУММА(ВТ.Сумма) КАК Сумма,
	             |	ВТ.Валюта КАК Валюта
	             |ИЗ
	             |	ВТ КАК ВТ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВТ.Валюта";  
	Пакет = Запр.ВыполнитьПакет();    

	УстановитьПривилегированныйРежим(Ложь);

	ВыборкаЗ = Пакет[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаЗ.Следующий() Цикл   
		СтрокаЗ = Дер.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗ, ВыборкаЗ); 
		ВыборкаД = ВыборкаЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаД.Следующий() Цикл
			ВыборкаВ = ВыборкаД.Выбрать();
			ВыборкаВ.Следующий();
			//СтрокаИ.Валюта = ВыборкаВ.Валюта;
			СтрокаВ = СтрокаЗ.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВ, ВыборкаВ);
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дер, "Затраты");
	
	Выборка = Пакет[2].Выбрать();	
	Пока Выборка.Следующий() Цикл
		МассивЗатрат.Добавить(Новый Структура("Сумма, Валюта", Выборка.Сумма, Выборка.Валюта));
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ЗатратыДокумент" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);   
	КонецЕсли;   

КонецПроцедуры

#КонецОбласти 


#Область Привязки
	
&НаСервере
Процедура ЗаполнитьТаблицуПривязок()
	
	лВалютаИнвойса = Объект.ДокументОснование.Валюта;
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ДвижениеДенегИнвойсы.Ссылка КАК Документ,
	             |	ДвижениеДенегИнвойсы.Сумма КАК Сумма
	             |ИЗ
	             |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	             |ГДЕ
	             |	ДвижениеДенегИнвойсы.Инвойс = &Инвойс
	             |	И ДвижениеДенегИнвойсы.Ссылка.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.Поставщики)
	             |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДвижениеДенегИнвойсы.Ссылка.Дата";
	Запр.УстановитьПараметр("Инвойс", Объект.Ссылка);
	Выгрузка = Запр.Выполнить().Выгрузить();
	Привязки.Загрузить(Выгрузка);
	
	Для каждого СтрокаТЗ Из Привязки Цикл  
		док = СтрокаТЗ.Документ; 
		//СтрокаТЗ.Курс = омСервер.СредневзвешенныйКурс(лВалютаИнвойса, Док.ДСчет, Док.Дата);  
		СтрокаТЗ.Курс = РаботаСВалютой.СредневзвешенныйКурс(лВалютаИнвойса, Док.ДСчет, Док.Ссылка.МоментВремени());
		Если СтрокаТЗ.Курс > 0 Тогда
			СтрокаТЗ.СуммаВБазВалюте = СтрокаТЗ.Сумма / СтрокаТЗ.Курс;
		КонецЕсли;
	КонецЦикла; 
	
	Элементы.ПривязкиСумма.ТекстПодвала = Формат(Привязки.Итог("Сумма"), "ЧДЦ=2");
	Элементы.ПривязкиСуммаВБазВалюте.ТекстПодвала = Формат(Привязки.Итог("СуммаВБазВалюте"), "ЧДЦ=2");
	Элементы.ПривязкиСумма.Заголовок = СтрШаблон("Сумма (%1)", лВалютаИнвойса.Символ);
	Элементы.ПривязкиСуммаВБазВалюте.Заголовок = СтрШаблон("Сумма (%1)", лВалютаИнвойса.БазоваяВалюта.Символ);
	Элементы.СтраницаПривязки.Заголовок = СтрШаблон("%1 (%2)",
													НСтр("ru = 'Привязки'; en = 'Bindings'"),
													Привязки.Количество());
	Если Привязки.Количество() = 1 Тогда
		// берем из единственного док-та оплаты, т.к. обратный расчет от сумм м.давать погрешность	
		СрВзвешКурс = Привязки[0].Курс;
	Иначе
		СрВзвешКурс = ?(Привязки.Итог("СуммаВБазВалюте") = 0, 0, Привязки.Итог("Сумма") / Привязки.Итог("СуммаВБазВалюте"));
	КонецЕсли;
	Элементы.КурсУстановленВручную.Подсказка = СтрШаблон("%1: %2 %3",
														НСтр("ru = 'Cр.взвешенный курс рассчитан'; en = 'Weighted average rate calculated'"),
														СрВзвешКурс,
														лВалютаИнвойса.Символ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ПривязкиДокумент" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Документ); 
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы._Инвойс.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄
