#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Режим,Инвойс,ИДСтроки,Количество,Номенклатура,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса");
	
	Для каждого ЭлтЗамен Из Параметры.МассивЗамен Цикл
		НовСтрока = Замены.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ЭлтЗамен);	
	КонецЦикла;
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Инвойс", Параметры.Инвойс);
	Запр.УстановитьПараметр("тз", Замены.Выгрузить());
	Запр.Текст = "ВЫБРАТЬ
	             |	тз.Номенклатура,
	             |	тз.ИДСтроки,
	             |	тз.Количество,
	             |	тз.Поставка,
	             |	тз.ЦенаЗакупки,
	             |	тз.ЦенаСоСкидкой,
	             |	тз.ЦенаИнвойса
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&тз КАК тз
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ.Номенклатура,
	             |	ВТ.ИДСтроки,
	             |	ВТ.Количество,
	             |	ВТ.Поставка,
	             |	ВТ.ЦенаЗакупки,
	             |	ВТ.ЦенаСоСкидкой,
	             |	ВТ.ЦенаИнвойса,
	             |	Отправки.Регистратор КАК Отправка
	             |ИЗ
	             |	ВТ КАК ВТ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |			ОтправкаИнвойсов.Поставка КАК Поставка,
	             |			ОтправкаИнвойсов.Регистратор КАК Регистратор
	             |		ИЗ
	             |			РегистрНакопления.ОтправкаИнвойсов КАК ОтправкаИнвойсов
	             |		ГДЕ
	             |			ОтправкаИнвойсов.Инвойс = &Инвойс
	             |			И ОтправкаИнвойсов.ОжидаемыеПоставки = -1) КАК Отправки
	             |		ПО ВТ.Поставка = Отправки.Поставка";
	 Замены.Загрузить(Запр.Выполнить().Выгрузить());
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Режим = "Замена" Тогда            
		ВыбНоменклатура = Номенклатура; 
		Если ВвестиЗначение(ВыбНоменклатура, НСтр("ru = 'Выберите замену'; en = 'Select a substitution'"), Тип("СправочникСсылка.Номенклатура")) Тогда
			Для каждого Стр Из Замены Цикл
				Стр.Номенклатура = ВыбНоменклатура;	
			КонецЦикла; 
			Ок(Неопределено);
		Иначе	
			Отказ = Истина;
		КонецЕсли;
	Иначе // разделение	
		УстановитьДоступностьОК();
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти  


#Область Команды

&НаКлиенте
Процедура Добавить(Команда)
	
	Если Элементы.Замены.ТекущаяСтрока = Неопределено Тогда
		Источник = Новый Структура("Номенклатура,ИДСтроки,Поставка,Отправка,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса"); 
	Иначе
		Источник = Новый Структура("Номенклатура,ИДСтроки,Поставка,Отправка,ЦенаЗакупки,ЦенаСоСкидкой,ЦенаИнвойса", 
									Элементы.Замены.ТекущиеДанные.Номенклатура,
									Элементы.Замены.ТекущиеДанные.ИДСтроки,
									Элементы.Замены.ТекущиеДанные.Поставка,  
									Элементы.Замены.ТекущиеДанные.Отправка,
									ЦенаЗакупки,
									ЦенаСоСкидкой,
									ЦенаИнвойса ); 
	КонецЕсли;
	НовСтрока = Замены.Вставить(Замены.Индекс(Элементы.Замены.ТекущиеДанные) + 1); 
	ЗаполнитьЗначенияСвойств(НовСтрока, Источник);

КонецПроцедуры

&НаКлиенте
Процедура Влево(Команда)
	
	Если Элементы.Замены.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	Остаток = Остаток + Элементы.Замены.ТекущиеДанные.Количество;
	Элементы.Замены.ТекущиеДанные.Количество = 0;
	УстановитьДоступностьОК();

КонецПроцедуры

&НаКлиенте
Процедура Вправо(Команда)

	Если Элементы.Замены.ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	Элементы.Замены.ТекущиеДанные.Количество = Элементы.Замены.ТекущиеДанные.Количество + Остаток;
    Остаток = 0;
   	УстановитьДоступностьОК();

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)              
	
	Оповестить("ЗаменаРазделение", Новый Структура("ТаблицаЗамен,ИДстроки", Замены, ИДстроки), ЭтаФорма); 
    Закрыть();  
	
КонецПроцедуры

#КонецОбласти  


&НаКлиенте
Процедура ЗаменыПередНачаломИзменения(Элемент, Отказ)  
	
	КоличествоВСтроке = Элементы.Замены.ТекущиеДанные.Количество; 
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЗаменыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЗаменыКоличествоПриИзменении(Элемент)
	
	Разница = КоличествоВСтроке - Элементы.Замены.ТекущиеДанные.Количество; 
	Остаток = Остаток + Разница;  
	КоличествоВСтроке = Элементы.Замены.ТекущиеДанные.Количество;
    УстановитьДоступностьОК();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОК()
	
	Режим = Остаток = 0;
	Элементы.ОК.Видимость = Режим; 
	Элементы.ДекорацияОк.Видимость = НЕ Режим;
	
	Если Элементы.Замены.ТекущиеДанные <> Неопределено Тогда
		Элементы.Влево.Доступность = Элементы.Замены.ТекущиеДанные.Количество > 0;
		Элементы.Вправо.Доступность = Остаток + Элементы.Замены.ТекущиеДанные.Количество >= 0;
	КонецЕсли;
	Если Остаток = 0 Тогда
	  	Элементы.Вправо.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменыПриАктивизацииСтроки(Элемент)

    УстановитьДоступностьОК();

КонецПроцедуры
