
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ПериодОтчета") Тогда
		ОтборПериод		= Параметры.Отбор.ПериодОтчета;
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Дата") Тогда
		ОтборДата		= КонецДня(Параметры.Отбор.Дата);
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Склад") Тогда
		ОтборСклад 		= Параметры.Отбор.Склад; 
	КонецЕсли;
	ОтборНоменклатура 	= Параметры.Отбор.Номенклатура;
	ВидРасшифровки 		= Параметры.ВидРасшифровки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = "Расшифровка продаж по периодам: " + ВидРасшифровки;
	СформироватьОтчет(); 

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	Перем ДанныеРасшифровки;
	          
	//СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетРасшифровкиЗаказано");
    СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетРасшифровки" + ВидРасшифровки);
   
    Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;    
    
    //ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных) );
    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
    
    //Установка параметров
    Настройки = КомпоновщикНастроек.Настройки;     
	//Для каждого Элемент Из Настройки.Отбор.ДоступныеПоляОтбора.Элементы Цикл
	//	Если Строка(Элемент.Поле) = "Номенклатура" Тогда
	//		Параметр = Настройки.ПараметрыДанных.Элементы.Найти("Номенклатура");
	//		Параметр.Значение = ОтборНоменклатура;
	//		Параметр.Использование = Истина; 
	//	ИначеЕсли Строка(Элемент.Поле) = "Склад" Тогда
	//		Параметр = Настройки.ПараметрыДанных.Элементы.Найти("Склад");
	//		Параметр.Значение = ОтборСклад;
	//		Параметр.Использование = Истина; 
	//	КонецЕсли;	
	//КонецЦикла;   
	Для каждого Элемент Из Настройки.Отбор.Элементы Цикл
		Если Строка(Элемент.ЛевоеЗначение) = "Номенклатура" Тогда
			Элемент.ПравоеЗначение = ОтборНоменклатура;
			Элемент.Использование = Истина; 
		ИначеЕсли Строка(Элемент.Поле) = "Склад" Тогда
			//Параметр = Настройки.ПараметрыДанных.Элементы.Найти("Склад");
			//Параметр.Значение = ОтборСклад;
			//Параметр.Использование = Истина; 
		КонецЕсли;	
	КонецЦикла;

	
	Для каждого Эл Из Настройки.ПараметрыДанных.Элементы Цикл
		Если Строка(Эл.Параметр) = "ПериодОтчета" Тогда 
			Эл.Значение = ОтборПериод;
			Эл.Использование = Истина;              
	//	ИначеЕсли Строка(Эл.Параметр) = "НачалоПериода" Тогда
	//		Эл.Значение = ОтборПериод.ДатаНачала;
	//		Эл.Использование = Истина;              
	//	ИначеЕсли Строка(Эл.Параметр) = "КонецПериода" Тогда
	//		Эл.Значение = ОтборПериод.ДатаОкончания;
	//		Эл.Использование = Истина;              

		ИначеЕсли Строка(Эл.Параметр) = "ДатаОтчета" Тогда 
			Эл.Значение = ОтборДата;
			Эл.Использование = Истина;  

			
	//+++		
	ИначеЕсли Строка(Эл.Параметр) = "Номенклатура" Тогда 
		Эл.Значение = ОтборНоменклатура;
		Эл.Использование = Истина; 
	//---
		КонецЕсли;	
	КонецЦикла;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
	//					Настройки, ДанныеРасшифровки, ,
	//                    //Настройки, , ,
	//                    Тип("ГенераторМакетаКомпоновкиДанных"));
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
    //ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    Результат = Новый ТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);    
    
КонецПроцедуры



&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь;
	//СсылкаИнвойс = РасшифровкаПолучитьИнвойс(ДанныеРасшифровки_, Расшифровка);
	Если Найти(Элемент.ТекущаяОбласть.Текст, "Инвойс") > 0 Тогда
		ОткрытьЗначение( СсылкаИнвойс(Элемент.ТекущаяОбласть.Текст) );
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаИнвойс(ИнвойсСтрокой)

	Возврат Документы._Инвойс.НайтиПоНомеру(Сред(ИнвойсСтрокой, 8, 9));
	
КонецФункции	
