// © Primus1C  05.11.2023  НАЧАЛО ►

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеДокумента") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;     
		
		Для каждого П Из Метаданные.Перечисления.СтатусыИнспекции.ЗначенияПеречисления Цикл  
			ЗначениеПеречисления = Перечисления.СтатусыИнспекции[П.Имя]; 
			//ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, ЦветСтатуса(ЗначениеПеречисления),));
			лЦвет = ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка(П.Имя);
			Если лЦвет = Новый Цвет(255, 255, 255) Тогда
				ДанныеВыбора.Добавить(ЗначениеПеречисления); 
			Иначе
				ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, лЦвет,)); 
			КонецЕсли;
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры 

//Функция ЦветСтатуса(ЗначениеПеречисления) Экспорт

//	Если ЗначениеПеречисления = Перечисления.СтатусыИнспекции.InspectionDone Тогда
//		Цв = Новый Цвет(51, 212, 144);	
//	ИначеЕсли ЗначениеПеречисления = Перечисления.СтатусыИнспекции.HaveSomeProblem Тогда
//		Цв = Новый Цвет(254, 188, 101);	
//	ИначеЕсли ЗначениеПеречисления = Перечисления.СтатусыИнспекции.NotInspected Тогда
//		Цв = Новый Цвет(121, 126, 146);	
//	Иначе
//		Цв = Новый Цвет(255, 255, 255);	
//	КонецЕсли;	
//    Возврат Цв;  
//	
//КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄
