&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ЭтаФорма.Заголовок  = СтрШаблон("%1 (%2)", РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, ЭтотОбъект.ПредставлениеТекущегоВарианта);

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	//естьНом = РасшифровкаПолучитьНоменклатуру(ДанныеРасшифровки, Расшифровка);
	//Если естьНом = 0 Тогда Возврат КонецЕсли; 
	//
	//естьКол = РасшифровкаПолучитьКолонку(ДанныеРасшифровки, Расшифровка);
	//
	//Если естьКол = "Остаток" Тогда
	//	СтандартнаяОбработка = Ложь; 

	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Фирма", гоФирма()); 
	//	Отбор.Вставить("Номенклатура", естьНом); 
	//	Для каждого Эл Из отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//		Если Строка(Эл.Параметр) = "Склады" Тогда
	//			//Отбор.Вставить("Склад", Эл.Значение);
	//		ИначеЕсли Строка(Эл.Параметр) = "ПериодОтчета" Тогда
	//			Отбор.Вставить("ПериодОтчета", Эл.Значение);	
	//		КонецЕсли;
	//	КонецЦикла;				
	//	//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//	//ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровкиОстатков", ПараметрыФормы, ); 
	//	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//	ОткрытьФорму("Отчет.ОборотыОднойНоменклатуры.Форма.ФормаОтчетаНовая", ПараметрыФормы, ЭтаФорма, Истина); 
	//	
	//ИначеЕсли естьКол = "Заказано" ИЛИ естьКол = "ВПути" Тогда
	//	
	//	СтандартнаяОбработка = Ложь;
	//	Отбор = Новый Структура("Номенклатура", естьНом);
	//	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//    ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, );
	//	
	//ИначеЕсли естьКол = "Сумма" ИЛИ естьКол = "Наценка" ИЛИ естьКол = "Количество" Тогда
	//
	//	СтандартнаяОбработка = Ложь;
	//	Отбор = Новый Структура("Номенклатура", естьНом);
	//	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//    ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, );
	//	
	////ИначеЕсли естьКол = "Заказано" Тогда 
	////	СтандартнаяОбработка = Ложь;
	////	Отбор = Новый Структура("Номенклатура", естьНом);
	////	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	////	ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровкиЗаказано", ПараметрыФормы, );
	////	
	////ИначеЕсли естьКол = "ВПути" Тогда 
	////	СтандартнаяОбработка = Ложь;
	////	Отбор = Новый Структура;
	////	Отбор.Вставить("Номенклатура", естьНом); 
	////	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	////	ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровкиВПути", ПараметрыФормы, );

	//КонецЕсли;	

	естьНом = РасшифровкаПолучитьНоменклатуру(ДанныеРасшифровки, Расшифровка);
	Если естьНом = 0 Тогда Возврат КонецЕсли; 
	
	Для Каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//Если Эл.Использование Тогда
			Если Строка(Эл.Параметр) = "ПериодОтчета" Тогда
				естьПериод = Эл.Значение;	
			ИначеЕсли Строка(Эл.Параметр) = "Склад" Тогда
				естьСклад = Эл.Значение;	
			КонецЕсли;	
		//КонецЕсли;	
	КонецЦикла;	
	
	естьКол = РасшифровкаПолучитьКолонку(ДанныеРасшифровки, Расшифровка);
	
	Если естьКол = "Остаток" ИЛИ естьКол = "Количество" ИЛИ естьКол = "Сумма" ИЛИ естьКол = "Наценка" Тогда
		СтандартнаяОбработка = Ложь; 
		//Отбор = Новый Структура;
		//Отбор.Вставить("Фирма", гоФирма()); 
		//Отбор.Вставить("Номенклатура", естьНом); 
		//Для каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//	Если Строка(Эл.Параметр) = "Склад" Тогда
		//		Отбор.Вставить("Склад", Эл.Значение);
		//	ИначеЕсли Строка(Эл.Параметр) = "ПериодОтчета" Тогда
		//		Отбор.Вставить("ПериодОтчета", Эл.Значение);	
		//	КонецЕсли;
		//КонецЦикла;				
		//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
		//ОткрытьФорму("Отчет.ОборотыОднойНоменклатуры.Форма.ФормаОтчетаНовая", ПараметрыФормы, ЭтаФорма, Истина); 

		Отбор = Новый Структура("Номенклатура,Склад,ПериодОтчета", естьНом, естьСклад, естьПериод);
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, ВидРасшифровки", Отбор, Истина, ЕстьКол);
		ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, Истина);

		
	//ИначеЕсли естьКол = "Заказано" ИЛИ естьКол = "ВПути" Тогда
	//	
	//	СтандартнаяОбработка = Ложь; 
	//	
	//	Отбор = Новый Структура("Номенклатура", естьНом);
	//	Для каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//		Если Строка(Эл.Параметр) = "Склад" Тогда
	//			Отбор.Вставить("Склад", Эл.Значение);
	//		ИначеЕсли Строка(Эл.Параметр) = "ПериодОтчета" Тогда
	//			Отбор.Вставить("ПериодОтчета", Эл.Значение);
	//			Отбор.Вставить("КонецПериода", Эл.Значение.ДатаОкончания);
	//		КонецЕсли;
	//	КонецЦикла;			
	//	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, ВидРасшифровки", Отбор, Истина, естьКол);
	//	//ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровкиЧастичноОтправленных", ПараметрыФормы, );
	//    ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли естьКол = "Заказано" Тогда 
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Номенклатура", естьНом);
		//Для каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//	Если Строка(Эл.Параметр) = "ПериодОтчета" Тогда
		//		//Отбор.Вставить("ПериодОтчета", Эл.Значение);
		//		Отбор.Вставить("Дата", Эл.Значение.ДатаОкончания);
		//	КонецЕсли;
		//КонецЦикла;			
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, ВидРасшифровки", Отбор, Истина, ЕстьКол);
        ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, Истина);
		
	ИначеЕсли естьКол = "ВПути" Тогда 
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Номенклатура,Дата", естьНом, естьПериод.ДатаОкончания);
		//Для каждого Эл Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		//	Если Строка(Эл.Параметр) = "Склад" Тогда
		//		Отбор.Вставить("Склад", Эл.Значение);
		//	ИначеЕсли Строка(Эл.Параметр) = "ПериодОтчета" Тогда
		//		Отбор.Вставить("ПериодОтчета", Эл.Значение);	
		//	КонецЕсли;
		//КонецЦикла;			
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, ВидРасшифровки", Отбор, Истина, ЕстьКол);
        ОткрытьФорму("Отчет.ПродажиПоПериодам.Форма.ФормаРасшифровки", ПараметрыФормы, ЭтаФорма, Истина);

	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифровкаПолучитьНоменклатуру(ДанныеРасшифровки, Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Данное = Данные.Элементы.Получить(Расшифровка);
	
	естьНом = 0;
	МассивРодителей = Данное.ПолучитьРодителей();	
	Для Каждого Родитель Из МассивРодителей Цикл
		Данное = Данные.Элементы.Получить(Родитель.Идентификатор);
		Попытка
			Поля = Данное.ПолучитьПоля();
		Исключение
		    Возврат 0;
		КонецПопытки; 
		Поле = Поля.Найти("Номенклатура");
		Если НЕ (Поле = Неопределено) Тогда естьНом = Поле.Значение; Прервать; КонецЕсли;
	КонецЦикла; 
	Если естьНом = 0 Тогда Возврат 0 КонецЕсли; 
	Если естьНом.ЭтоГруппа Тогда Возврат 0 КонецЕсли; 
	
	Возврат естьНом;
КонецФункции

&НаСервереБезКонтекста
Функция РасшифровкаПолучитьКолонку(ДанныеРасшифровки, Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Данное = Данные.Элементы.Получить(Расшифровка);
	Попытка
		Поля = Данное.ПолучитьПоля();
	Исключение
	    Возврат "";
	КонецПопытки; 
	
	Если Поля.Найти("ВПути") <> Неопределено ИЛИ  Поля.Найти("ВПутиСтоимость") <> Неопределено Тогда
		Возврат "ВПути";
	ИначеЕсли Поля.Найти("Остаток") <> Неопределено ИЛИ Поля.Найти("ОстатокСтоимость") <> Неопределено Тогда
		Возврат "Остаток";
	ИначеЕсли Поля.Найти("Заказано") <> Неопределено ИЛИ Поля.Найти("ЗаказаноСтоимость") <> Неопределено Тогда
		Возврат "Заказано";
	ИначеЕсли Поля.Найти("СуммаОборот") <> Неопределено ИЛИ Поля.Найти("СуммаПересчет") <> Неопределено Тогда
		Возврат "Сумма";
	ИначеЕсли Поля.Найти("НаценкаОборот") <> Неопределено ИЛИ Поля.Найти("НаценкаПересчет") <> Неопределено Тогда
		Возврат "Наценка";
	ИначеЕсли Поля.Найти("КоличествоОборот") <> Неопределено Тогда
		Возврат "Количество";
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

