// Возвращает ТЗ партий, имеющихся на складе комиссии
//
Функция ОстаткиПартийНаКомиссии(Серия, Дата = Неопределено, Фирма = Неопределено, Склад = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Серия", 	Серия);
	Запрос.УстановитьПараметр("Фирма", 	?(Фирма=Неопределено, ПараметрыСеанса.Фирма, Фирма));
	Запрос.УстановитьПараметр("Склад", 	Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Серия КАК Серия,
	               |	ТоварыНаКомиссии.Партия КАК Партия,
	               |	ТоварыНаКомиссии.Номенклатура КАК Номенклатура,
	               |	ТоварыНаКомиссии.Номенклатура.Наименование КАК ИмяНоменклатуры,
	               |	ТоварыНаКомиссии.КоличествоОстаток КАК Количество,
	               |	ТоварыНаКомиссии.СуммаОстаток КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ТоварыНаКомиссии.КоличествоОстаток = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТоварыНаКомиссии.СуммаОстаток / ТоварыНаКомиссии.КоличествоОстаток
	               |	КОНЕЦ КАК Цена,
	               |	ТоварыНаКомиссии.СуммаКомиссионераОстаток КАК СуммаКомиссионера
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаКомиссии.Остатки({(&Дата)}, Партия.Серия = &Серия {(Контрагент = &Контрагент
	               |			    И Склад = &Склад) КАК Поле2}) КАК ТоварыНаКомиссии";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
