Процедура ЗарегистрироватьДокументКПроведению(ДокументСсылка, Инициатор) Экспорт
	
	НовЗапись = РегистрыСведений.ДокументыКПроведению.СоздатьМенеджерЗаписи();
	Мен = РегистрыСведений.ДокументыКПроведению.СоздатьМенеджерЗаписи();		
	Мен.Документ 			= ДокументСсылка; 
	Мен.Инициатор 			= Инициатор; 
	Мен.Зарегистрировано 	= ТекущаяДатаСеанса();
	Мен.Записать();
	гоЗаписьЖурналаРегистрации("Регистрация к доп.проведению документом " + Инициатор, ДокументСсылка.Метаданные().Синоним, "Автоматическая запись", ДокументСсылка, 4);
	
КонецПроцедуры
   
Процедура ПроведениеДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	Если ПараметрыСеанса.ГрупповоеПерепроведениеДокументов = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ДвижениеДенег") Тогда
		
		Запр = Новый Запрос;  
		Запр.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ДвижениеДенегИнвойсы.Инвойс КАК Инвойс
		             |ИЗ
		             |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
		             |ГДЕ
		             |	ДвижениеДенегИнвойсы.Ссылка = &Ссылка
		             |	И ДвижениеДенегИнвойсы.Инвойс.Проведен
		             |	И НЕ ДвижениеДенегИнвойсы.НеПересчитыватьПриходТовара
		             |	И НЕ ДвижениеДенегИнвойсы.Инвойс.КурсУстановленВручную";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗарегистрироватьДокументКПроведению(Выборка.Инвойс, Источник.Ссылка);
		КонецЦикла;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроведениеДокументов() Экспорт

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ДокументыКПроведению.Документ КАК Документ,
	             |	ДокументыКПроведению.Документ.ПометкаУдаления КАК ПометкаУдаления,
	             |	ДокументыКПроведению.Инициатор КАК Инициатор
	             |ИЗ
	             |	РегистрСведений.ДокументыКПроведению КАК ДокументыКПроведению
	             |ГДЕ
	             |	ДокументыКПроведению.Документ.Проведен"; 
	Выборка = Запр.Выполнить().Выбрать();    
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
		
			НаборЗаписей = РегистрыСведений.ДокументыКПроведению.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
			НаборЗаписей.Записать();
		
		Иначе
		
		ДокОбъект = Выборка.Документ.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);   
			НаборЗаписей = РегистрыСведений.ДокументыКПроведению.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
			НаборЗаписей.Записать();
			гоЗаписьЖурналаРегистрации("Регламентное проведение: инициатор " + Выборка.Инициатор, СтрЗаменить(ТипЗнч(Выборка.Документ), "ДокументСсылка.", ""), "Проведение", Выборка.Документ, );
		Исключение
			
		КонецПопытки;
		
		КонецЕсли;

	КонецЦикла;
	
	Последовательности.ПартииВалют.Восстановить();
	
КонецПроцедуры

