

&НаКлиенте
Процедура РассчитатьСкидкуПоСуммеДокумента()
	
	ОбщаяСуммаКРаспределению = Объект.Сумма;
	
	Для каждого Стр Из Объект.Документы Цикл
		ЗаполнитьТЧ(Стр);
	КонецЦикла;
	
	ОбщаяСуммаДокументов = Объект.Документы.Итог("СуммаДокумента");
		
	Для каждого Стр Из Объект.Документы Цикл
		ВесоваяЧасть = ?(ОбщаяСуммаДокументов = 0,0,Стр.СуммаДокумента / ОбщаяСуммаДокументов * 100)  ;
		СуммаСкидки = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
		Стр.СуммаСкидки = СуммаСкидки ;
	КонецЦикла;
	
		
КонецПроцедуры
&НаКлиенте
Процедура РассчитатьСкидкуПоКоличеству()
	
	ОбщаяСуммаКРаспределению = Объект.Сумма;
	
	Для каждого Стр Из Объект.Документы Цикл
		ЗаполнитьТЧ(Стр);
	КонецЦикла;
	
	ОбщееКоличествоВДокументах = Объект.Документы.Итог("Количество");
	
	Для каждого Стр Из Объект.Документы Цикл
		ВесоваяЧасть = ?(ОбщееКоличествоВДокументах = 0,0,Стр.Количество / ОбщееКоличествоВДокументах * 100)  ;
		СуммаСкидки = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
		Стр.СуммаСкидки = СуммаСкидки ;
	КонецЦикла;
	
	
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_Инвойс.Сумма
	               |ИЗ
	               |	Документ._Инвойс КАК _Инвойс
	               |ГДЕ
	               |	_Инвойс.Ссылка = &Ссылка
	               |	И _Инвойс.Проведен
	               |	И НЕ _Инвойс.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка",Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.Сумма <> Неопределено И  Выборка.Сумма <>  0 Тогда
			Возврат Выборка.Сумма
		Иначе
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДокумента(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_Инвойс.ВКД_Количество
	               |ИЗ
	               |	Документ._Инвойс КАК _Инвойс
	               |ГДЕ
	               |	_Инвойс.Ссылка = &Ссылка
	               |	И _Инвойс.Проведен
	               |	И НЕ _Инвойс.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.ВКД_Количество <> Неопределено Тогда
			Возврат Выборка.ВКД_Количество
		Иначе
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура  ЗаполнитьТЧ(Стр)
	
	СуммаДокумента = ПолучитьСуммуДокумента(Стр.Документ);
	КоличествоВДокументе = ПолучитьКоличествоДокумента(Стр.Документ);
	Стр.СуммаДокумента = СуммаДокумента;
	Стр.Количество = КоличествоВДокументе;
			
КонецПроцедуры

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Изменен вид расчета!Нажмите кнопку ""Рассчитать скидку""!";
	Сообщение.Сообщить();
	ОчиститьСуммуСкидки();

	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСуммуСкидки()
	
Для каждого Стр Из Объект.Документы Цикл
		Стр.Суммаскидки = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Необходимо пересчитать сумму скидки! Нажмите кнопку ""Рассчитать скидку""!";
	Сообщение.Сообщить();
	
	ОчиститьСуммуСкидки();
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСкидку(Команда)
	
	Если Объект.ВариантРаспределения = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран вариант расчета!";
		Сообщение.Сообщить();
		Для каждого Стр Из Объект.Документы Цикл
			ЗаполнитьТЧ(Стр);
			Стр.СуммаСкидки = 0;
		КонецЦикла;
		
		
	ИначеЕсли Объект.ВариантРаспределения = 1 Тогда
		РассчитатьСкидкуПоСуммеДокумента();
	ИначеЕсли Объект.ВариантРаспределения = 2 Тогда
		РассчитатьСкидкуПоКоличеству() 	
	КонецЕсли;

КонецПроцедуры

