&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Попытка
	//	Период = Новый СтандартныйПериод(НачалоДня(ПараметрыВыполненияКоманды.Источник.НачДата), КонецДня(ПараметрыВыполненияКоманды.Источник.КонДата));
	//Исключение
	//	Период = 0;
	//КонецПопытки; 
	//
	//Если Период = 0 Тогда 
		Отбор = Новый Структура("Касса", ПараметрКоманды);
	//Иначе 
	//	Отбор = Новый Структура("Касса, Период", ПараметрКоманды, Период);
	//КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	
	ОткрытьФорму("Отчет.ОборотыДенег.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
