
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивСсылок = Новый Массив;
	Для Каждого Стр Из Строки Цикл
		МассивСсылок.Добавить(Стр.Ключ);
	КонецЦикла;
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиИнтеграцииСклады.Ссылка КАК Ссылка,
		|	УчетныеЗаписиИнтеграцииСклады.Склад.Наименование КАК Склад
		|ИЗ
		|	Справочник.УчетныеЗаписиИнтеграции.Склады КАК УчетныеЗаписиИнтеграцииСклады
		|ГДЕ
		|	УчетныеЗаписиИнтеграцииСклады.Ссылка В (&Ссылки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	УчетныеЗаписиИнтеграцииСклады.Ссылка,
		|	УчетныеЗаписиИнтеграцииСклады.НомерСтроки";
	
	СкладыПоЗаписям = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СкладыСтрокой = СкладыПоЗаписям.Получить(Выборка.Ссылка);
		Если СкладыСтрокой = Неопределено Тогда
			СкладыСтрокой = Выборка.Склад;
		Иначе
			СкладыСтрокой = СкладыСтрокой + ", " + Выборка.Склад;
		КонецЕсли;
		СкладыПоЗаписям.Вставить(Выборка.Ссылка, СкладыСтрокой);
		
	КонецЦикла;
	
	Для Каждого Стр Из Строки Цикл
		
		СкладыСтрокой = СкладыПоЗаписям.Получить(Стр.Ключ);
		Стр.Значение.Данные.СкладыСтрокой = ?(СкладыСтрокой = Неопределено, "", СкладыСтрокой);
		
	КонецЦикла;
	
КонецПроцедуры
