Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.КлючПараметровПечати = Метаданные().Имя + ".Печать"; 
	
	// © Primus1C  31.08.2024  НАЧАЛО ►  
	
	//Если НЕ ОбщегоНазначенияПовтИсп.ДоступныЦеныЗакупки() Тогда
	//	
	//	МассивСкрываемыхПолейКомпоновкиДанных = Новый Массив;
	//	МассивСкрываемыхПолейКомпоновкиДанных.Добавить(Новый ПолеКомпоновкиДанных("Партия.ЦенаЗакупки"));
	//	МассивСкрываемыхПолейКомпоновкиДанных.Добавить(Новый ПолеКомпоновкиДанных("Партия.Валюта"));
	//	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
	//		ЭтоПолеНужноСкрыть = (МассивСкрываемыхПолейКомпоновкиДанных.Найти(Элемент.Поле) <> Неопределено);
	//		Если ЭтоПолеНужноСкрыть Тогда
	//			Элемент.Использование = Ложь;
	//		КонецЕсли;    
	//	КонецЦикла;
	//	
	//КонецЕсли;    
	
	Настройки = КомпоновщикНастроек.Настройки;
    ЭД = Настройки.ПараметрыДанных.Элементы.Найти("СкрытьЦены");
    ЭД.Значение = НЕ ОбщегоНазначенияПовтИсп.ДоступныЦеныЗакупки();
    ЭД.Использование = Истина;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры
