#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = "ПриходнаяНакладная";
	//Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	//2015.11.24
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	глПокраситьСостояние(ЭтаФорма, ИмяДокумента);
	// © Primus1C  17.10.2023  НАЧАЛО ►
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глУстановитьГраницуВидимости(Список);
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//Элементы.ФормаСлужба.Видимость = гоАдминистратор();
	
	// © Primus1C  10.12.2023  НАЧАЛО ►
	////2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда гоСтандартныйОтбор(Список, 1, Истина, Мас) КонецЕсли;
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	гоСтандартныйОтборПоПолю("Склады", 		Список, "Склад");
	
    Элементы.ПримечаниеДоп.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьПримечаниеТекущегоДокументаВнизуСписка");

	СтруктураПечатныхФорм = Документы.ПриходнаяНакладная.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	ФорматВремени = Истина;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	//ВКД++
	//Список.Параметры.УстановитьЗначениеПараметра("КемСоздан",ПараметрыСеанса.Пользователь);
	//ВКД--
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	Граница = омСервер.ПолучитьРеквизит(гоПользователь(), "ГраницаПросмотра");	
	Если Граница <> Дата(1,1,1) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Граница", Граница);
	КонецЕсли;	
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Элементы.Список.Обновить();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьВсеПараметры()
	//Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	//МожноВКассу = гоКолинко() ИЛИ гоЕстьРоль("ОплатыПоставщикам");
	//Элементы.ВКассу.Видимость = МожноВКассу;
	//Элементы.ВКассу.Доступность = МожноВКассу; 
	
	Если РольДоступна("Менеджер") Тогда        
		Элементы.НомерПоставщика.Видимость = Ложь;
		Элементы.ЕстьЗатраты.Видимость = Ложь;
		Элементы.Долг.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Служба(Команда)
	СлужбаСервер();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СлужбаСервер()
	//КопироватьФайл("v8res://mngbase/StandardDeleteMarkedObjects.epf","D:\ВнешняяОбработка.epf");
	//КопироватьФайл("v8res://mngbase/StandardDocumentsPosting.epf","D:\ВнешняяОбработка.epf");
	КопироватьФайл("v8res://mngbase/StandardActiveUsers.epf","D:\ВнешняяОбработка.epf");
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПолучитьРекв(Стр, ТекКли, ТекВал, ТекОко, ТекПрв, ТекСум, ТекМаг)
	ТекКли = Стр.Контрагент;
	ТекВал = Стр.Валюта;
	ТекОко = Стр.Окончательно;
	ТекПрв = Стр.Проведен;
	ТекСум = омСервер.Долг(Стр, "ДолгПоставщику");
	ТекМаг = Стр.Фирма;
КонецПроцедуры 

&НаКлиенте
Процедура ВКассу(Команда)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список;
	ВыдСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ТекКли = 0;
	ТекВал = 0;
	ТекОко = 0;
	ТекПрв = 0;
	ТекСум = 0;
	ТекМаг = 0;
	
	СохКли = 0;
	СохВал = 0;
	СохМаг = 0;
	
	Сум = 0;
	Спи = Новый СписокЗначений;
	
	Для Каждого Стр Из ВыдСтроки Цикл
		ПолучитьРекв(Стр, ТекКли, ТекВал, ТекОко, ТекПрв, ТекСум, ТекМаг);
		Если ТекСум = 0 Тогда Продолжить КонецЕсли;
		Если НЕ ТекПрв Тогда Продолжить КонецЕсли; 
		Если НЕ ТекОко Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекКли) Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекВал) Тогда Продолжить КонецЕсли; 
		Если гоПЗ(ТекМаг) Тогда Продолжить КонецЕсли; 
		
		Если СохВал = 0 Тогда СохВал = ТекВал КонецЕсли; 
		Если СохКли = 0 Тогда СохКли = ТекКли КонецЕсли; 
		Если СохМаг = 0 Тогда СохМаг = ТекМаг КонецЕсли; 
		
		Если ТекКли <> СохКли Тогда Продолжить КонецЕсли; 
		Если ТекВал <> СохВал Тогда Продолжить КонецЕсли; 
		Если ТекМаг <> СохМаг Тогда Продолжить КонецЕсли; 
		
		гоПлюс(Сум, ТекСум);
		
		Спи.Добавить(Стр);
	КонецЦикла; 
	
	Если Спи.Количество() = 0 Тогда клОшибка(НСтр("ru = 'Нет документов с долгами среди выделенных!'; en = 'There are no documents with debts among the selected ones!'")); Возврат; КонецЕсли; 
	
	Пар = Новый Структура;
	
	Пар.Вставить("Фирма", СохМаг);
	Пар.Вставить("Валюта", СохВал);
	Пар.Вставить("Контрагент", СохКли);
	Пар.Вставить("Накладных", Спи.Количество());
	Пар.Вставить("Сумма", Сум);
	Пар.Вставить("ЭтоПриход", Истина);
	Пар.Вставить("ЭтоОплатаПоставщику", Истина);
	ОткрытьФорму("ОбщаяФорма.ВводОплаты", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ВКассуПослеВводаОплаты", ЭтотОбъект, Новый Структура("СохМаг,СохКли,СохВал,Сум,Спи", СохМаг, СохКли, СохВал, Сум, Спи)));
КонецПроцедуры

&НаКлиенте
Процедура ВКассуПослеВводаОплаты(Рез, Параметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	Сум = Параметры.Сум;
	Спи = Параметры.Спи;
	
	Опл = Рез.Оплата;
	ДСЧ = Рез.ДСчет;
	Бум = Мин(Сум, Опл);
	При = ?(Бум >= Опл, "", НСтр("ru = 'Сдача: '; en = 'Change: '") + гоСуммаВал2(Опл - Бум, СохВал));
	
	//Если клНетДа("Выдать из " + гоИмя(ДСЧ) + " сумму: " + гоСуммаВал2(Бум, СохВал) + " и привязать к выделенным документам (" + Спи.Количество() +")?") Тогда Возврат КонецЕсли; 
	клНетДа(Новый ОписаниеОповещения("ВКассуПослеПодтверждения", ЭтотОбъект, Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Сум,Спи,При", СохМаг, СохКли, СохВал, ДСЧ, Бум, Сум, Спи, При)),
		СтрШаблон(НСтр("ru = 'Выдать из %1 сумму: %2 и привязать к выделенным документам (%3)?'; en = 'Output from %1 the amount: %2 and bind to the selected documents?'"),
							гоИмя(ДСЧ),
							гоСуммаВал2(Бум, СохВал),
							Спи.Количество()));
КонецПроцедуры

&НаКлиенте
Процедура ВКассуПослеПодтверждения(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	ДСЧ = Параметры.ДСЧ;
	Бум = Параметры.Бум;
	Сум = Параметры.Сум;
	Спи = Параметры.Спи;
	При = Параметры.При;
	
	Если Бум < Сум Тогда  
		//Если клНетДа("Для полной оплаты не хватает суммы: " + гоСуммаВал2(Сум - Бум, СохВал) + " (документы будут оплачены частично)! ПРОДОЛЖАТЬ?", , Истина) Тогда Возврат КонецЕсли; КонецЕсли; 
		клНетДа(Новый ОписаниеОповещения("ВКассуЗавершение", 
										ЭтотОбъект, 
										Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Спи,При", СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При)),
				СтрШаблон(НСтр("ru = 'Для полной оплаты не хватает суммы: %1 (документы будут оплачены частично)! ПРОДОЛЖАТЬ?'; en = 'There is not enough amount for full payment: %1 (documents will be paid partially)! CONTINUE?'"), гоСуммаВал2(Сум - Бум, СохВал)),
				, Истина);
		Возврат;
	КонецЕсли;
	
	ВКассуЗавершение(Истина, Новый Структура("СохМаг,СохКли,СохВал,ДСЧ,Бум,Спи,При", СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При));
КонецПроцедуры

&НаКлиенте
Процедура ВКассуЗавершение(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	СохМаг = Параметры.СохМаг;
	СохКли = Параметры.СохКли;
	СохВал = Параметры.СохВал;
	ДСЧ = Параметры.ДСЧ;
	Бум = Параметры.Бум;
	Спи = Параметры.Спи;
	При = Параметры.При;
	
	//все на все согласны, можно вызывать серверную процедуру привязки списка документов
	РезСоо = "";
	СоздатьОплату(СохМаг, СохКли, СохВал, ДСЧ, Бум, Спи, При, РезСоо);
	клЕстьОшибка(РезСоо);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОплату(ТекМаг, ТекКли, ТекВал, ТекСче, Сум, Спи, При, РезСоо)
    Док = Документы.ДвижениеДенег.СоздатьДокумент();
	
	Док.Дата = ТекущаяДата();
	Док.Фирма = ТекМаг;
	Док.Валюта = ТекВал;
	Док.Контрагент = ТекКли;
	Док.Сумма = Сум;
	Док.ДСчет = ТекСче;
	Док.Примечание = При;
	Док.ПриходРасход = Перечисления.ПриходРасход.Расход;
	Док.ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Поставщики;
	Док.Окончательно = Истина;
	
	Есть = Сум;
	
	Для Каждого Эле Из Спи Цикл
		Тек = Эле.Значение;
		Дол = омСервер.Долг(Тек, "ДолгПоставщику");
		Если Дол <= 0 Тогда Продолжить КонецЕсли; 
		
		Если Дол < Есть Тогда 
			Берем = Дол;
		Иначе 
			Берем = Есть;
		КонецЕсли; 
		гоМинус(Есть, Берем);
		
		Стр = Док.Привязки.Добавить();
		Стр.Сумма1 = Берем;
		Стр.Валюта1 = ТекВал;
		Стр.КроссКурс = 1;
		Стр.Сумма2 = Берем;
		Стр.Валюта2 = ТекВал;
		Стр.Док2 = Тек;
		
		Если Есть = 0 Тогда Прервать КонецЕсли;
	КонецЦикла; 
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    гоРезСоо(РезСоо, гоИмя(Док.Ссылка) + ": " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// © Primus1C  25.12.2023  НАЧАЛО ►

&НаКлиенте
Процедура ДатаВремяПриИзменении(Элемент)

	Элементы.Список.ПодчиненныеЭлементы.Дата.Формат = ?(ФорматВремени, "ДФ=dd.MM.yyyy", "ДФ='dd.MM.yyyy HH:mm:ss'");
    Элементы.Список.Обновить();
	
КонецПроцедуры

#Область ПримечаниеТекущегоДокументаАсихрон

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Элементы.ПримечаниеДоп.Заголовок = "";
	Иначе                                
		//	Элементы.Примечание.Заголовок = Примечание(Элементы.Список.ТекущаяСтрока);  // это синхрон
		ДопПараметры = Элементы.Список.ТекущаяСтрока;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеДанныхДокументаЗавершение", ЭтотОбъект, ДопПараметры);
		НачатьПолучениеДанныхДокумента(ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхДокумента(ОписаниеОповещения) Экспорт

	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхДокументаЗавершение(ФормаВызова, ДопПараметры) Экспорт
	
	Элементы.ПримечаниеДоп.Заголовок = Примечание(ДопПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Примечание(ДокСсылка)
	
	Возврат ДокСсылка.Примечание;

КонецФункции 

#КонецОбласти


#Область ПодкдючаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)
	
	ТабДок = Новый ТабличныйДокумент; 
	Если ТекущийЭлемент.ТекущаяСтрока <> Неопределено Тогда
		Документы.ПриходнаяНакладная.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	КонецЕсли;
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти   

// © Primus1C  ОКОНЧАНИЕ ◄