
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Сформировать(Неопределено); 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтрШаблон("%1 (%2 %3)",
							НСтр("ru = 'Контроль ввода данных'; en = 'Data entry control'"),
							НСтр("ru = 'с'; en = 'from'"),
							Формат(НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)), "ДФ=dd.MM.yyyy"));
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаНастройки.Видимость = Ложь;
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВарианты.Видимость = Ложь;

	// 1. Читаем исходный HTML из макета
	//ОбъектДанных = РеквизитФормыВЗначение("Объект"); 
    ОбъектДанных = РеквизитФормыВЗначение("Отчет"); 
    Макет = ОбъектДанных.ПолучитьМакет("МакетДашборда2"); 
    ТекстМакета = Макет.ПолучитьТекст();
    
    // 2. Генерируем текст с данными (обратите внимание: это просто текст!)
	Скрипт = "";
	// Пример: Индикатор заполнен на 85%, но выводится число 1250 
	//         Встречи заполнены на 60%, выводится число 34
	Скрипт = Скрипт + "UpdateIndicator(1, " + 
	"'Справочники', 85, '1 250', " + 
	"'Документы', 60, '34', " + 
	"'Регистры', 90, '8 100', " + 
	"'Планы видов', 40, '12', " + 
	"'', 0, '', " + 
	"'Индекс базы', '75%', '#888888', '#000000');" + Символы.ПС;
	
	// Пример: Если показателя нет, передаем пустые значения
	Скрипт = Скрипт + "UpdateIndicator(2, " + 
	"'Критичные', 10, '5 шт', " + 
	"'Предупреждения', 45, '12 шт', " + 
	"'', 0, '', " + 
	"'', 0, '', " +  
	"'', 0, '', " + 
	"'Статус', 'Тревога', '#FF0000', '#FF0000');" + Символы.ПС; 
	
	// 3. Вклеиваем наши данные внутрь HTML-кода    
    ГотовыйHTML = СтрЗаменить(ТекстМакета, "// %ВСТАВКА_ВЫЗОВОВ_ИЗ_1С%", Скрипт);
    
    // 4. Отдаем HTML на форму
    ЭтаФорма.ТекстHTML = ГотовыйHTML;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто); 
	ПрочитатьТаблицуИОбновитьИндикаторы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборИПереформировать(НомерИндикатора)
    
    ПолеОтбора = Новый ПолеКомпоновкиДанных("НомерИндикатора");
    ЭлементОтбора = Неопределено;
    
    // 1. Ищем, есть ли уже такой отбор в настройках пользователя
    Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
        Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ЛевоеЗначение = ПолеОтбора Тогда
            ЭлементОтбора = Элемент;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    // 2. Если отбора нет, создаем его
    Если ЭлементОтбора = Неопределено Тогда
        ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
        ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    КонецЕсли;
    
    // 3. Логика переключения (Toggle)
    Если ЭлементОтбора.Использование И ЭлементОтбора.ПравоеЗначение = НомерИндикатора Тогда
        // Если кликнули по уже активному индикатору - снимаем фильтр (покажем все)
        ЭлементОтбора.Использование = Ложь; 
    Иначе
        // Применяем фильтр по выбранному индикатору
        ЭлементОтбора.Использование = Истина;
        ЭлементОтбора.ПравоеЗначение = НомерИндикатора;
    КонецЕсли;
    
    // 4. Даем команду платформе переформировать табличный документ "Результат" 
    // с учетом новых настроек отбора
    СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТаблицуИОбновитьИндикаторы()
	
	Если Ложь Тогда
		// светлый вариант	
		ЦветОшибки  = "#9a031e";
		ЦветОК 		= "#006400";
		ЦветПодписи = "#708090";
	Иначе
		// темный вариант
		ЦветОшибки 	= "#c1121f";
		ЦветОК 		= "#0afb89";
		ЦветПодписи = "#AFC7E0";
	КонецЕсли;
	
    Если ЗначениеЗаполнено(Отчет.АдресХранилищаТЗ) Тогда
		
		// Достаем готовую ТЗ из хранилища
		ТаблицаДанных = ПолучитьИзВременногоХранилища(Отчет.АдресХранилищаТЗ);
		
		ОбъектДанных = РеквизитФормыВЗначение("Отчет"); 
		ТекстМакета = ОбъектДанных.ПолучитьМакет("МакетДашборда3").ПолучитьТекст();
		
		// Формируем новые данные для индикаторов 
		Показатели.Очистить();
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Номенклатура без веса", "Незашифров.поставщики", "Не проводятся");
		Показатели.Добавить(СоставПоказателей);
		Скрипт = СтрШаблон("UpdateIndicator(1, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ТОВАРЫ И ДОКУМЕНТЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦветПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);          
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Инвойсы без веса", "Прибывшие ивойсы", "Пересорт инвойс-приход", "Распределение отправок");
		Показатели.Добавить(СоставПоказателей);
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(2, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ИНВОЙСЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦветПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);  
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Приходные не Ок", "Перемещения не Ок", "Даты прих.накладных", "Доп.затраты", "Отправки перемещений");
		Показатели.Добавить(СоставПоказателей);
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(3, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ЗАКУПКИ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦветПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Расходные не Ок", "Неадекватная наценка", "Цены возвратов");
		Показатели.Добавить(СоставПоказателей);
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(4, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ПРОДАЖИ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦветПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);    
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Движения денег не Ок", "Привязки инвойсов", "Неверная валюта");
		Показатели.Добавить(СоставПоказателей);
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(5, %1 '%2', '%3', '%4', '%5');",
							СоставПоказателей.Показатели,
							"ОПЛАТЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦветПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки)
		                    );
							
		ЭтаФорма.ТекстHTML = СтрЗаменить(ТекстМакета, "// %ВСТАВКА_ВЫЗОВОВ_ИЗ_1С%", Скрипт);  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоставПоказателей(тз, Тэг1, Тэг2 = "", Тэг3 = "", Тэг4 = "", Тэг5 = "")
	
	Строк1 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг1)).Количество();
	Строк2 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг2)).Количество();
	Строк3 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг3)).Количество();
	Строк4 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг4)).Количество();
	Строк5 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг5)).Количество();
	МаксСтрок = Макс(Строк1, Строк2, Строк3, Строк4, Строк5);
	
	стр1 = ПодстрокаПоказателя(Тэг1, Строк1, МаксСтрок);
	стр2 = ПодстрокаПоказателя(Тэг2, Строк2, МаксСтрок);
	стр3 = ПодстрокаПоказателя(Тэг3, Строк3, МаксСтрок);
	стр4 = ПодстрокаПоказателя(Тэг4, Строк4, МаксСтрок);
	стр5 = ПодстрокаПоказателя(Тэг5, Строк5, МаксСтрок);
	
	Возврат Новый Структура("Показатели, Ошибки", стр1 + стр2 + стр3 + стр4 + Стр5, Строк1 + Строк2 + Строк3 + Строк4 + Строк5);
	
КонецФункции 

&НаСервере
Функция ПодстрокаПоказателя(Тэг, Строк, СтрокВсего)
	
	Если Тэг = "" Тогда
		Возврат "'', 0, '', "; 
	ИначеЕсли СтрокВсего = 0 Тогда
		Возврат СтрШаблон("'%1', %2, '%3', ", Тэг, 0, 0);
	Иначе	
	    Возврат СтрШаблон("'%1', %2, '%3', ", Тэг, Окр(Строк/СтрокВсего*100), Строк);
	КонецЕсли;

КонецФункции	

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	МасЦветов = Новый Массив;   
	МасЦветов.Добавить(омСервер.ПолучитьЦветИзHEX("#D0E0EE")); 
	МасЦветов.Добавить(омСервер.ПолучитьЦветИзHEX("#FFF1D1")); 
	МасЦветов.Добавить(омСервер.ПолучитьЦветИзHEX("#C3EAF0")); 
	МасЦветов.Добавить(омСервер.ПолучитьЦветИзHEX("#FED2D8")); 
	МасЦветов.Добавить(омСервер.ПолучитьЦветИзHEX("#C6DAE3")); 

	Если ДанныеСобытия.Href <> Неопределено И Найти(ДанныеСобытия.Href, "action://indicator_click") > 0 Тогда
        
        СтандартнаяОбработка = Ложь;
        
        МассивСлов = СтрРазделить(ДанныеСобытия.Href, "=");
        // Получаем номер нажатого индикатора (из ссылки, например: action://indicator_click=1)
        НомерИндикатора = Число(МассивСлов[1]); 
        
        // Вызываем нашу новую процедуру установки фильтра
        УстановитьОтборИПереформировать(НомерИндикатора);
		
		Мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Показатели[НомерИндикатора-1].Значение.Показатели);
		Инд = 0;
		Пока Инд <= Мас.Количество() Цикл
			ТекстДляПоиска = СокрЛП(СтрЗаменить(Мас[Инд], "'", ""));   
			Если ЗначениеЗаполнено(ТекстДляПоиска) Тогда
				ОбластьКолонки = Результат.Область(, 3, , 3);
				НайденнаяОбласть = Результат.НайтиТекст(ТекстДляПоиска, Неопределено, ОбластьКолонки);
				Пока НайденнаяОбласть <> Неопределено Цикл 
					ОбластьПокраски = Результат.Область(НайденнаяОбласть.Низ, 1, НайденнаяОбласть.Низ, 2);
					ОбластьПокраски.ЦветФона = МасЦветов[Инд/3];
					НайденнаяОбласть = Результат.НайтиТекст(ТекстДляПоиска, НайденнаяОбласть, ОбластьКолонки);
				КонецЦикла;	
			КонецЕсли;
			Инд = Инд + 3;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Сбрасываем признак изменения самого варианта отчета
    ВариантМодифицирован = Ложь;
    
    // Сбрасываем признак изменения отборов и параметров пользователем
    ПользовательскиеНастройкиМодифицированы = Ложь;
    
    // На всякий случай сбрасываем и базовую модифицированность формы
    Модифицированность = Ложь;
	
КонецПроцедуры
