&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	// © Primus1C  14.07.2023  НАЧАЛО ► 
	//гоСтандартныйОтборПоПолю("Контрагенты", Список, "Ссылка");
	//гоСтандартныйОтборПоПолю("Контрагенты", Дерево, "Ссылка"); 
	гоОтборФормыКонтрагентов(Список, Дерево);
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);  
	Режим = РольДоступна("ЧтениеИзменениеНаименованийКонтрагентов") ИЛИ РольДоступна("ЧтениеНаименованийКонтрагентов");
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьПсевдоним", НЕ Режим);
	ГруппаПоУмолчанию =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("КонтрагентыПокупатели");
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

// © Primus1C  27.12.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
