&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	
	Попытка
		Серия = СокрЛП(гоРеквизит(ПараметрКоманды, "Серия"));
		Если Серия = "" Тогда Возврат КонецЕсли;              
		// © Primus1C  06.12.2025  НАЧАЛО ►
		Если ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Товары") <> Неопределено Тогда
			Серия = Новый Массив;
			Для каждого Ном Из ПараметрыВыполненияКоманды.Источник.Элементы.Товары.ВыделенныеСтроки Цикл
				Серия.Добавить(ПараметрыВыполненияКоманды.Источник.Объект.Товары[Ном].Серия);
			КонецЦикла;	 
		КонецЕсли;	
		// © Primus1C  ОКОНЧАНИЕ ◄
	Исключение
	    Возврат;
	КонецПопытки; 
	
	Отбор = Новый Структура("Серия, Фирма", Серия, гоФирма());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ОткрытьФорму("Отчет.ОборотыОднойСерии.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
