&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	
	Если гоРеквизит(ПараметрКоманды, "ЭтоГруппа") Тогда Возврат КонецЕсли; 
	
	//Отбор = Новый Структура("Номенклатура, Магазин", ПараметрКоманды, гоМагазин());
	
	Отбор = Новый Структура("Контрагент", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор", Отбор, Истина);	//, СформироватьПриОткрытии
	ОткрытьФорму("Отчет.Долги.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
