// © Primus1C  06.11.2023  НАЧАЛО ►

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеДокумента") Тогда
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;     
	
	Для каждого П Из Метаданные.Перечисления.СтатусыОплаты.ЗначенияПеречисления Цикл  
		ЗначениеПеречисления = Перечисления.СтатусыОплаты[П.Имя]; 
		//ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, ЦветСтатуса(ЗначениеПеречисления),));
		лЦвет = ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка(П.Имя);
		Если лЦвет = Новый Цвет(255, 255, 255) Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления); 
		Иначе
			ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, лЦвет,)); 
		КонецЕсли;
	КонецЦикла;

	КонецЕсли;

КонецПроцедуры 

//Функция ЦветСтатуса(ЗначениеПеречисления) Экспорт

//	Если ЗначениеПеречисления = Перечисления.СтатусыОплаты.Receivded Тогда
//		Цв = Новый Цвет(51, 212, 144);	
//	ИначеЕсли ЗначениеПеречисления = Перечисления.СтатусыОплаты.PaidNotReceivded Тогда
//		Цв = Новый Цвет(254, 188, 101);	
//	ИначеЕсли ЗначениеПеречисления = Перечисления.СтатусыОплаты.NotPaid Тогда
//		Цв = Новый Цвет(121, 126, 146);	
//	Иначе
//		Цв = Новый Цвет(255, 255, 255);	
//	КонецЕсли;	
//    Возврат Цв;  
//	
//КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄
