// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

	Склад = ПараметрыСеанса.Склад;
	
	Выборка = Справочники.ВидыЦен.Выбрать(Новый Структура("ПометкаУдаления", Ложь));
	Пока Выборка.следующий() Цикл
		НовСтрокаТЧ = ВидыЦен.Добавить();
		НовСтрокаТЧ.ВидЦены = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Ошибки = Новый СписокЗначений;
	//ПроведениеДокументов.ПроверитьДубли(Товары, Ошибки, "Номенклатура");  // проверка на дубли производится в форме ПерезЗаписью()
	Для каждого Ош Из Ошибки Цикл
		Сообщить(Ош.Значение);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	Запр.Текст = "ВЫБРАТЬ
	             |	УстановкаЦенТовары.Ссылка.Дата КАК Период,
	             |	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |	УстановкаЦенТовары.Цена0 КАК Цена0,
	             |	УстановкаЦенТовары.Цена1 КАК Цена1,
	             |	УстановкаЦенТовары.Порог1 КАК Порог1,
	             |	УстановкаЦенТовары.Цена2 КАК Цена2,
	             |	УстановкаЦенТовары.Порог2 КАК Порог2,
	             |	УстановкаЦенТовары.Цена3 КАК Цена3,
	             |	УстановкаЦенТовары.Порог3 КАК Порог3,
	             |	УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу,
	             |	УстановкаЦенТовары.Ссылка.Склад КАК Склад
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка";
	Выборка = Запр.Выполнить().Выбрать(); 
	
	Движения.ЦеныПродажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныПродажи.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ЦеныПродажи.Записать();
	
	ЗарегистрироватьИзмененияЦенWebHook(ТаблицаИзмененийЦенИзДокумента(), Дата);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ИзмененияЦен = ТаблицаИзмененийЦенПоРегистратору(Ссылка);
	Если ИзмененияЦен.Количество() = 0 Тогда
		ИзмененияЦен = ТаблицаИзмененийЦенИзДокумента();
	КонецЕсли;
	
	ЗарегистрироватьИзмененияЦенWebHook(ИзмененияЦен, Дата);
	
КонецПроцедуры

Функция ТаблицаИзмененийЦенИзДокумента()
	
	ИзмененияЦен = НоваяТаблицаИзмененийЦенWebHook();
	
	Для Каждого СтрокаТовары Из Товары Цикл
		ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, СтрокаТовары.Номенклатура, Склад, СтрокаТовары.ВидЦены);
	КонецЦикла;
	
	Возврат ИзмененияЦен;
	
КонецФункции

Функция ТаблицаИзмененийЦенПоРегистратору(Регистратор)
	
	ИзмененияЦен = НоваяТаблицаИзмененийЦенWebHook();
	
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда
		Возврат ИзмененияЦен;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныПродажи.Номенклатура КАК Номенклатура,
	               |	ЦеныПродажи.Склад КАК Склад,
	               |	ЦеныПродажи.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	РегистрСведений.ЦеныПродажи КАК ЦеныПродажи
	               |ГДЕ
	               |	ЦеныПродажи.Регистратор = &Регистратор";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, Выборка.Номенклатура, Выборка.Склад, Выборка.ВидЦены);
	КонецЦикла;
	
	Возврат ИзмененияЦен;
	
КонецФункции

Функция НоваяТаблицаИзмененийЦенWebHook()
	
	ИзмененияЦен = Новый ТаблицаЗначений;
	ИзмененияЦен.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИзмененияЦен.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ИзмененияЦен.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	
	Возврат ИзмененияЦен;
	
КонецФункции

Процедура ДобавитьИзменениеЦеныWebHook(ИзмененияЦен, Номенклатура, Склад, ВидЦены)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура)
		Или НЕ ЗначениеЗаполнено(Склад)
		Или НЕ ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	
	НайдСтроки = ИзмененияЦен.НайтиСтроки(Новый Структура("Номенклатура,Склад,ВидЦены", Номенклатура, Склад, ВидЦены));
	Если НайдСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ИзмененияЦен.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Склад = Склад;
	НоваяСтрока.ВидЦены = ВидЦены;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияЦенWebHook(ИзмененияЦен, ДатаДокумента)
	
	Если ИзмененияЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИзмененияЦен", ИзмененияЦен);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ИзмененияЦен.Склад КАК Склад,
	               |	ИзмененияЦен.ВидЦены КАК ВидЦены
	               |ПОМЕСТИТЬ ИзмененияЦен
	               |ИЗ
	               |	&ИзмененияЦен КАК ИзмененияЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УчетныеЗаписи.Ссылка КАК УчетнаяЗапись,
	               |	ИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ИзмененияЦен.Склад КАК Склад,
	               |	ИзмененияЦен.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	ИзмененияЦен КАК ИзмененияЦен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции.Склады КАК СкладыУчетныхЗаписей
	               |		ПО ИзмененияЦен.Склад = СкладыУчетныхЗаписей.Склад
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СправочникСклады
	               |		ПО ИзмененияЦен.Склад = СправочникСклады.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиИнтеграции КАК УчетныеЗаписи
	               |		ПО СкладыУчетныхЗаписей.Ссылка = УчетныеЗаписи.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи КАК БолееПоздниеЦены
	               |		ПО ИзмененияЦен.Номенклатура = БолееПоздниеЦены.Номенклатура
	               |			И ИзмененияЦен.Склад = БолееПоздниеЦены.Склад
	               |			И ИзмененияЦен.ВидЦены = БолееПоздниеЦены.ВидЦены
	               |			И БолееПоздниеЦены.Период > &ДатаДокумента
	               |ГДЕ
	               |	УчетныеЗаписи.Активен
	               |	И УчетныеЗаписи.WebhookАктивен
	               |	И УчетныеЗаписи.ОтправлятьЦены
	               //|	И УчетныеЗаписи.WebhookURL <> """"
	               |	И НЕ СправочникСклады.ПометкаУдаления
	               |	И БолееПоздниеЦены.Номенклатура ЕСТЬ NULL";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	НаборНовыхЗаписей = РегистрыСведений.ОчередьWebHook.СоздатьНаборЗаписей();
	ЕстьНовыеЗаписи = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ПерезаполнитьОчередьWebHookЦены(НаборНовыхЗаписей, Выборка.УчетнаяЗапись, Выборка.Номенклатура, Выборка.Склад, Выборка.ВидЦены);
		ЕстьНовыеЗаписи = Истина;
	КонецЦикла;
	
	Если ЕстьНовыеЗаписи Тогда
		НаборНовыхЗаписей.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьОчередьWebHookЦены(НаборНовыхЗаписей, УчетнаяЗапись, Номенклатура, Склад, ВидЦены)
	
	ТипСобытия = Перечисления.ТипыСобытийWebHooks.Цена;
	ПустаяДатаОтправки = Дата(1, 1, 1);
	
	УдалитьНеотправленныеЗаписиОчередиWebHookЦены(УчетнаяЗапись, Номенклатура, Склад, ВидЦены,
		ТипСобытия, ПустаяДатаОтправки);
	
	НоваяЗапись = НаборНовыхЗаписей.Добавить();
	НоваяЗапись.ИД = Новый УникальныйИдентификатор;
	НоваяЗапись.УчетнаяЗапись = УчетнаяЗапись;
	НоваяЗапись.ТипСобытия = ТипСобытия;
	НоваяЗапись.Номенклатура = Номенклатура;
	НоваяЗапись.Склад = Склад;
	НоваяЗапись.ВидЦены = ВидЦены;
	НоваяЗапись.Отправлен = ПустаяДатаОтправки;
	НоваяЗапись.Создан = ТекущаяДатаСеанса();
	НоваяЗапись.КоличествоПопыток = 0;
	НоваяЗапись.Ошибка = "";
	НоваяЗапись.Инициатор = Ссылка;
	
КонецПроцедуры

Процедура УдалитьНеотправленныеЗаписиОчередиWebHookЦены(УчетнаяЗапись, Номенклатура, Склад, ВидЦены,
	ТипСобытия, ПустаяДатаОтправки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ТипСобытия", ТипСобытия);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Отправлен", ПустаяДатаОтправки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьWebHook.ИД КАК ИД,
	               |	ОчередьWebHook.УчетнаяЗапись КАК УчетнаяЗапись,
	               |	ОчередьWebHook.ТипСобытия КАК ТипСобытия,
	               |	ОчередьWebHook.Номенклатура КАК Номенклатура,
	               |	ОчередьWebHook.Склад КАК Склад,
	               |	ОчередьWebHook.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	РегистрСведений.ОчередьWebHook КАК ОчередьWebHook
	               |ГДЕ
	               |	ОчередьWebHook.УчетнаяЗапись = &УчетнаяЗапись
	               |	И ОчередьWebHook.ТипСобытия = &ТипСобытия
	               |	И ОчередьWebHook.Номенклатура = &Номенклатура
	               |	И ОчередьWebHook.Склад = &Склад
	               |	И ОчередьWebHook.ВидЦены = &ВидЦены
	               |	И ОчередьWebHook.Отправлен = &Отправлен";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьОчереди = РегистрыСведений.ОчередьWebHook.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьОчереди, Выборка);
		ЗаписьОчереди.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
