// © Primus1C  01.07.2023  НАЧАЛО ►

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтобразитьКорректировки(); 
	
	// доп.реквизиты для условного оформления
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
	   	СтрокаТЧ.РасхождениеНоменклатура 	= СтрокаТЧ.Номенклатура <> СтрокаТЧ.НоменклатураДоКорректировки;
	   	СтрокаТЧ.РасхождениеЦена 			= СтрокаТЧ.Цена <> СтрокаТЧ.ЦенаДоКорректировки;
	   	СтрокаТЧ.РасхождениеКоличество 		= СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоДоКорректировки;
	   	СтрокаТЧ.РасхождениеСумма 			= СтрокаТЧ.Сумма <> СтрокаТЧ.СуммаДоКорректировки;
	КонецЦикла;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "" Тогда
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнвойсПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Объект.Инвойс);
		ПоказатьВопрос(Оповещение,
							НСтр("ru = 'Документ будет заполнен новыми данными! Продолжить?'; en = 'The document will be filled with new data! Continue?'"),
							РежимДиалогаВопрос.ДаНетОтмена,
							0, // таймаут в секундах
							КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
							НСтр("ru = 'Заполнить документ корректировки по инвойсу?'; en = 'Fill out an invoice adjustment document?'") // (необ.) заголовок
							);    
	Иначе 
		ЗаполнитьПоИнвойсу();
		ЭтотОбъект.ОбновитьОтображениеДанных();
		ОтобразитьКорректировки();
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура КорректировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура КорректировкиПередУдалением(Элемент, Отказ)
	Отказ = Истина; 
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ПересчитатьСумму(Элемент, Постфикс="")

	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;	
	СтрокаТЧ["Сумма"+Постфикс] = СтрокаТЧ["Цена"+Постфикс] * СтрокаТЧ["Количество"+Постфикс];
	
	Объект.Сумма = Объект.Товары.Итог("Сумма");
	Объект.Количество = Объект.Товары.Итог("Количество")

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦену(Элемент, Постфикс="")

	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТЧ["Количество"+Постфикс] = 0 Тогда
		СтрокаТЧ["Цена"+Постфикс] = 0;
	Иначе
		СтрокаТЧ["Цена"+Постфикс] = СтрокаТЧ["Сумма"+Постфикс] / СтрокаТЧ["Количество"+Постфикс];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаДоКорректировкиПриИзменении(Элемент)
	ПересчитатьСумму(Элемент, "ДоКорректировки");
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКоличествоДоКорректировкиПриИзменении(Элемент)
	ПересчитатьСумму(Элемент, "ДоКорректировки");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаДоИзмененияПриИзменении(Элемент)
	ПересчитатьСумму(Элемент, "ДоИзменения");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоДоИзмененияПриИзменении(Элемент)
	ПересчитатьСумму(Элемент, "ДоИзменения");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДоКорректировкиПриИзменении(Элемент)
	ПересчитатьЦену(Элемент, "ДоКорректировки");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДоИзмененияПриИзменении(Элемент)
	ПересчитатьЦену(Элемент, "ДоИзменения");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ПересчитатьЦену(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		ДобавитьСтрокуКопированием(Неопределено);
	    Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)  
	
	Если Элемент.ТекущиеДанные.ТипСтроки <> ПредопределенноеЗначение("Перечисление.ТипыСтрокИнвойса.БудетДобавленаКорректировкой") Тогда 
		клПредупреждение(НСтр("ru = 'Эта строка присутствует в инвойсе (или корректировках к нему). Ее можно только откорректировать, но не удалить!'; en = 'This line is present in the invoice (or adjustments to it). You can only correct this line, but not delete!'"), , 
						 НСтр("ru = 'Удаление строки в корректировке инвойса'; en = 'Deleting a line in an invoice adjustment'"));
		Отказ = Истина;   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	// доп.реквизиты для условного оформления
	СтрокаТЧ = Элемент.ТекущиеДанные;
	СтрокаТЧ.РасхождениеНоменклатура = СтрокаТЧ.Номенклатура <> СтрокаТЧ.НоменклатураДоКорректировки;
	СтрокаТЧ.РасхождениеЦена 		= СтрокаТЧ.Цена <> СтрокаТЧ.ЦенаДоКорректировки;
	СтрокаТЧ.РасхождениеКоличество 	= СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоДоКорректировки;
	СтрокаТЧ.РасхождениеСумма 		= СтрокаТЧ.Сумма <> СтрокаТЧ.СуммаДоКорректировки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ТипСтроки = ПредопределенноеЗначение("Перечисление.ТипыСтрокИнвойса.БудетДобавленаКорректировкой");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти    


&НаСервере
Процедура ЗаполнитьПоИнвойсу()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьПоИнвойсу(Объект.Инвойс);

КонецПроцедуры

&НаСервере
Процедура ОтобразитьКорректировки()
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Инвойс", Объект.Инвойс);
	Запр.УстановитьПараметр("ЭтаКорректировка", Объект.Ссылка);
	Запр.Текст = 
	//"ВЫБРАТЬ
	//             |	КорректировкаИнвойса.Ссылка
	//             |ИЗ
	//             |	Документ.КорректировкаИнвойса КАК КорректировкаИнвойса
	//             |ГДЕ
	//             |	КорректировкаИнвойса.Инвойс = &Инвойс
	//             |	И КорректировкаИнвойса.Ссылка <> &ЭтаКорректировка
	//             |	И НЕ КорректировкаИнвойса.ПометкаУдаления
	//             |
	//             |УПОРЯДОЧИТЬ ПО
	//             |	КорректировкаИнвойса.Дата"; 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкорректированныеИнвойсы.Регистратор
	|ИЗ
	|	РегистрНакопления.СкорректированныеИнвойсы КАК СкорректированныеИнвойсы
	|ГДЕ
	|	СкорректированныеИнвойсы.Инвойс = &Инвойс
	|	И СкорректированныеИнвойсы.Регистратор <> &ЭтаКорректировка
	|	И НЕ СкорректированныеИнвойсы.Регистратор ССЫЛКА Документ._Инвойс
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкорректированныеИнвойсы.Регистратор.Дата";
	Выгрузка = Запр.Выполнить().Выгрузить();  
	Если Выгрузка.Количество() = 0 Тогда
		Элементы.ГруппаКорректировки.Видимость = Ложь;	
	Иначе
		Корректировки.ЗагрузитьЗначения(Выгрузка.ВыгрузитьКолонку(0));
		Элементы.ГруппаКорректировки.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры	



&НаКлиенте
Процедура ОбновитьКорректировки(Команда)

	ОтобразитьКорректировки();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоИнвойсу();    
		ЭтотОбъект.ОбновитьОтображениеДанных();
	    ОтобразитьКорректировки();
    КонецЕсли;	
 
КонецПроцедуры  


&НаКлиенте
Процедура ДобавитьСтрокуКопированием(Команда)  
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;  
	Если ТекДанные.ТипСтроки = ПредопределенноеЗначение("Перечисление.ТипыСтрокИнвойса.ВходитВИнвойс") Тогда
		НовСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,ТекДанные,"Номенклатура,Цена,Количество,Сумма"); 
		НовСтрока.ТипСтроки = ПредопределенноеЗначение("Перечисление.ТипыСтрокИнвойса.БудетДобавленаКорректировкой"); 
	КонецЕсли;

КонецПроцедуры


// © Primus1C  ОКОНЧАНИЕ ◄