
// Клиент
&НаКлиенте
Перем мШиринаКолонокПоУмолчанию;

&НаКлиенте
Перем мСтрокаПеретаскивания;

&НаКлиенте
Перем мЗаголовокВопросаИзменеиеСтатуса;

&НаКлиенте
Перем мФормаОсобогоТипа;

&НаКлиенте
Перем мЗакрытиеПодтверждено;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТонкийКлиент();
	мШиринаКолонокПоУмолчанию = 15;
	мЗаголовокВопросаИзменеиеСтатуса = "Изменение статуса параметра";
	мФормаОсобогоТипа = ПолучитьФорму(ПутьКФормам + "ФормаОсобогоТипа");
	мФормаОсобогоТипа.Инициализировать();
	ИнициализироватьДеревоЗапросов();
	СоставРезультатов = 1;
	УстановитьФильтрыПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если мЗакрытиеПодтверждено <> Истина Тогда
		Отказ = Истина;
		СохранитьНаработки(Новый ОписаниеОповещения("ПередЗакрытиемПослеСохранения", ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПослеСохранения(ДопПараметры) Экспорт
	мЗакрытиеПодтверждено = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	#Если ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	ЭлементДерева = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ЭлементДерева <> Неопределено Тогда
		Если ЗначениеЗаполнено(ЭлементДерева.ТекстЗапроса) Тогда
			Конструктор = Новый КонструкторЗапроса(ЭлементДерева.ТекстЗапроса);
		Иначе
			Конструктор = Новый КонструкторЗапроса();
		КонецЕсли;
		Конструктор.Показать(Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаПослеРедактирования", ЭтотОбъект, 
			Новый Структура("Конструктор,ИДИ", Конструктор, ЭлементДерева.ПолучитьИдентификатор())));
	Иначе
		ПоказатьПредупреждение(Неопределено, "Запрос не выбран");
		Модифицированность = Ложь;
 	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросаПослеРедактирования(Результат, ДопПараметры) Экспорт
	Если Результат = Истина Тогда
		ЭлементДерева = ДеревоЗапросов.НайтиПоИдентификатору(ДопПараметры.ИДИ);
		Если ЭлементДерева <> Неопределено Тогда
			ЭлементДерева.ТекстЗапроса = ДопПараметры.Конструктор.Текст;
		КонецЕсли;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТонкийКлиент()
	#Если ТонкийКлиент ИЛИ ВебКлиент Тогда
	Заголовок = Заголовок + " (тонкий клиент)";
	Элементы.ОткрытьКонструктор.Доступность = Ложь; 
	Элементы.ОткрытьКонструкторИзКонтекстногоМеню.Доступность = Ложь;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьДеревоЗапросов(Команда = Неопределено)
	СохранитьНаработки(Новый ОписаниеОповещения("ИнициализироватьДеревоЗапросовПослеСохранения", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьДеревоЗапросовПослеСохранения(ДопПараметры) Экспорт
	ПутьКФайлу = "";
	Запросы = ДеревоЗапросов.ПолучитьЭлементы();
	Запросы.Очистить();
	ИнициализироватьЗапрос(Запросы.Добавить(), "Запросы");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ЭлементДерева = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ЭлементДерева <> Неопределено Тогда
		ПараметрыЗапроса = ЭлементДерева.ПараметрыЗапроса;
		ВыполнитьТекстЗапроса(ЭлементДерева.ТекстЗапроса, ПараметрыЗапроса, ЭлементДерева.СпособВыгрузки);
	Иначе
		ПоказатьПредупреждение(Неопределено, "Запрос не выбран");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗапросов(Команда)
	СохранитьНаработки(Новый ОписаниеОповещения("ЗагрузитьФайлЗапросовПослеСохранения", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗапросовПослеСохранения(ДопПараметры) Экспорт
	Диалог = ПолучитьДиалогВыбораФайла();
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлЗапросовПослеВыбораФайла", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗапросовПослеВыбораФайла(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат КонецЕсли;
	
	ПутьКФайлу = РезультатВыбора[0];
	ВызовПолучитьДерево(ПередатьНаСервер(ПутьКФайлу), мШиринаКолонокПоУмолчанию); 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗапросов(Команда = Неопределено, ОписаниеОповещенияОЗавершении = Неопределено)
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Диалог = ПолучитьДиалогВыбораФайла();
		Диалог.Показать(Новый ОписаниеОповещения("СохранитьФайлЗапросовПослеВыбораФайла", ЭтотОбъект, ОписаниеОповещенияОЗавершении));
	Иначе
		ПреобразоватьИСохранитьДерево(ПутьКФайлу);
		Модифицированность = Ложь;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗапросовПослеВыбораФайла(РезультатВыбора, ОписаниеОповещенияОЗавершении) Экспорт
	Если РезультатВыбора <> Неопределено Тогда
		ПутьКФайлу = РезультатВыбора[0];	
		ПреобразоватьИСохранитьДерево(ПутьКФайлу);
		Модифицированность = Ложь;
	КонецЕсли;
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗапрос(Команда)
	ГридДереваЗапросов = Элементы.ДеревоЗапросов;
	ТекущийЗапрос = ГридДереваЗапросов.ТекущиеДанные;
	Если ТекущийЗапрос <> Неопределено Тогда
		ГридДереваЗапросов.ДобавитьСтроку();
		НовыйЗапрос = ГридДереваЗапросов.ТекущиеДанные;
		ИнициализироватьЗапрос(НовыйЗапрос, "<без названия>");
		Модифицированность = Истина;
	Иначе
		ПоказатьПредупреждение(Неопределено, "Запрос-родитель не выбран");
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЗапрос(Команда)
	ГридЗапросов = Элементы.ДеревоЗапросов;
	ТекущийЗапрос = ГридЗапросов.ТекущиеДанные;
	Если ТекущийЗапрос <> Неопределено Тогда
		РодительТекущего = ТекущийЗапрос.ПолучитьРодителя();
		Если РодительТекущего <> Неопределено Тогда
			НовыйЗапрос = РодительТекущего.ПолучитьЭлементы().Добавить();
			СкопироватьСтрокуДереваЗапросов(НовыйЗапрос, ТекущийЗапрос);
			ГридЗапросов.ТекущаяСтрока = НовыйЗапрос.ПолучитьИдентификатор();
		Иначе
			ПоказатьПредупреждение(Неопределено, "Нельзя скопировать корневой элемент");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапрос(Команда)
	ТекущийЗапрос = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекущийЗапрос <> Неопределено Тогда
		Родитель = ТекущийЗапрос.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			Родитель.ПолучитьЭлементы().Удалить(ТекущийЗапрос);
		Иначе
			ПоказатьПредупреждение(Неопределено, "Нельзя удалить корневой элемент");
			Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапросВверх(Команда)
	СдвинутьЗапрос(-1);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросВниз(Команда)
	СдвинутьЗапрос(1);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)
	ТекущиеДанные = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		//Если ТекущиеДанные.ПараметрыЗапроса.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПараметрыПослеВопроса", ЭтотОбъект, ТекущиеДанные.ПолучитьИдентификатор()), 
				"Список параметров будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПослеВопроса(Ответ, Идентификатор) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	
	ТекущиеДанные = ДеревоЗапросов.НайтиПоИдентификатору(Идентификатор);
	Если ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	ЗначениеВозврата = ВызовЗаполнитьПараметры(Идентификатор);
	Если ТипЗнч(ЗначениеВозврата) = Тип("Структура") Тогда
		ТекущиеДанные.ПараметрыЗапроса.Очистить();
		Для каждого ПараметрЗапроса из ЗначениеВозврата Цикл
			НовыйПараметр = ТекущиеДанные.ПараметрыЗапроса.Добавить();
			НовыйПараметр.ИмяПараметра = ПараметрЗапроса.Ключ;
			НовыйПараметр.ЗначениеПараметра = ПараметрЗапроса.Значение.ПривестиЗначение(НовыйПараметр.ЗначениеПараметра);
		КонецЦикла;
	Иначе
		Сообщить(ЗначениеВозврата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультат(Команда)
	Если ПолеРезультатаЗапроса.ВысотаТаблицы > 0 Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Фильтр = "Файл Excel (*.xls)|*.xls|Табличный документ (*.mxl)|*.mxl";
		Диалог.Показать(Новый ОписаниеОповещения("СохранитьРезультатПослеВыбораФайла", ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультатПослеВыбораФайла(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат КонецЕсли;
	
	ПутьКФайлуРезультата = РезультатВыбора[0];
	Файл = Новый Файл(ПутьКФайлуРезультата);
	Если Файл.Расширение = ".mxl" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.MXL;
	ИначеЕсли Файл.Расширение = ".xls" Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.XLS;
	КонецЕсли;
	ПолеРезультатаЗапроса.Записать(ПутьКФайлуРезультата, ТипФайла);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	Диалог = ПолучитьДиалогВыбораФайла();
	Диалог.Показать(Новый ОписаниеОповещения("СохранитьКакПослеВыбораФайла", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакПослеВыбораФайла(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат КонецЕсли;
	
	Путь = РезультатВыбора[0];
	Проверка = Новый Файл(Путь);
	Если Проверка.Существует() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьКакПослеВопросаОЗамене", ЭтотОбъект, Путь), 
			"Файл '" + Путь + "' существует. Заменить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПреобразоватьИСохранитьДерево(Путь);
		ПутьКФайлу = Путь;
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакПослеВопросаОЗамене(Ответ, Путь) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПреобразоватьИСохранитьДерево(Путь);
		ПутьКФайлу = Путь;
	КонецЕсли;
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыделенныйТекст(Команда)
	ЭлементДерева = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ЭлементДерева <> Неопределено Тогда
		ПараметрыЗапроса = ЭлементДерева.ПараметрыЗапроса;
		ВыполнитьТекстЗапроса(Элементы.ТекстЗапроса.ВыделенныйТекст, ПараметрыЗапроса, 1);
	Иначе
		ПоказатьПредупреждение(Неопределено, "Запрос должен быть выделен в дереве");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КакПереподчинить(Команда)
	ПоказатьПредупреждение(Неопределено, "Для изменения подчиненности просто перетащите элемент мышью на нового родителя");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультат(Команда)
	ПолеРезультатаЗапроса = Новый ТабличныйДокумент();
	ВремяВыполнения = "";
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекстЗапроса(Команда)
	ТекущиеДанные = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ТекстЗапроса = "";
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОсобыйТипПараметра(Команда)
	ОткрытьФормуОсобогоПараметра();
КонецПроцедуры

&НаКлиенте
Процедура ПолеРезультатаЗапросаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("ТабличныйДокумент") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаВложеннойТаблицы = ПолучитьФорму(ПутьКФормам + "ФормаВложеннойТаблицы");
		ФормаВложеннойТаблицы.ВладелецФормы                 = ЭтаФорма;
		ФормаВложеннойТаблицы.ЗакрыватьПриЗакрытииВладельца = Истина;
		ФормаВложеннойТаблицы.ШиринаКолонок                 = мШиринаКолонокПоУмолчанию;
		ФормаВложеннойТаблицы.ВложеннаяТаблица              = Расшифровка;
		ФормаВложеннойТаблицы.ВложеннаяТаблица.Область().ШиринаКолонки = мШиринаКолонокПоУмолчанию;
		ФормаВложеннойТаблицы.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмяЗапросаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПолеШиринаКолонокРегулирование(Элемент)
	УстановитьШиринуКолонок();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособВыгрузкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	Элементы.СписокПараметров.ТекущиеДанные.ЗначениеПараметра = Неопределено;
	Элемент.ВыбиратьТип  = Истина;
	Элемент.КнопкаВыбора = Истина;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеПараметраПриИзменении(Элемент)
	ТекущееОписание = Элементы.СписокПараметров.ТекущиеДанные;
	Значение = ТекущееОписание.ЗначениеПараметра;
	Если ТипЗнч(Значение) = Тип("ОписаниеТипов") Тогда
		ЗаданныеТипы = Значение.Типы();
		Если ЗаданныеТипы.Количество() > 1 Тогда
			МассивТипов = Новый Массив();
			МассивТипов.Добавить(ЗаданныеТипы[0]);
			ТекущееОписание.ЗначениеПараметра = Новый ОписаниеТипов(МассивТипов);
			ПоказатьПредупреждение(Неопределено, "Задан составной тип. Будет использован первый из состава типов");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПередНачаломИзменения(Элемент, Отказ)
	ТекущийЭлементГрида = Элемент.ТекущийЭлемент;
	Если ТекущийЭлементГрида.Имя = "СписокПараметровЗначениеПараметра" Тогда
		Если Элемент.ТекущиеДанные.ЗначениеПараметра = Неопределено Тогда
			ТекущийЭлементГрида.ВыбиратьТип = Истина;
		Иначе
			ТекущийЭлементГрида.ВыбиратьТип = Ложь;
		КонецЕсли;
	ИначеЕсли ТекущийЭлементГрида.Имя = "СписокПараметровОсобыйТип" Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокПараметровПередНачаломИзмененияПослеВопроса", ЭтотОбъект), 
			"Параметр будет перемещен в список особых параметров", РежимДиалогаВопрос.ОКОтмена, , мЗаголовокВопросаИзменеиеСтатуса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровПередНачаломИзмененияПослеВопроса(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Элементы.СписокПараметров.ИзменитьСтроку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОсобыхПараметровПередНачаломИзменения(Элемент, Отказ)
	//Если Элемент.ТекущийЭлемент.Имя = "СписокОсобыхПараметровОсобыйТип" Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("СписокОсобыхПараметровПередНачаломИзмененияПослеВопроса", ЭтотОбъект), 
			"Параметр будет перемещен в список общих параметров с неопределенным типом", 
			РежимДиалогаВопрос.ОКОтмена, , мЗаголовокВопросаИзменеиеСтатуса);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОсобыхПараметровПередНачаломИзмененияПослеВопроса(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Элементы.СписокОсобыхПараметров.ИзменитьСтроку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОсобыхПараметровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ДанныеСтроки = Элемент.ТекущиеДанные;
		ДанныеСтроки.ЗначениеПараметра = СтрокаНеопределено;
		ДанныеСтроки.Примечание        = ВРег(Строка(ТипЗнч(Неопределено)));
		ДанныеСтроки.ОсобыйТип         = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровОсобыйТипПриИзменении(Элемент)
	ДанныеСтроки = Элементы.СписокПараметров.ТекущиеДанные;
	ДанныеСтроки.ЗначениеПараметра = СтрокаНеопределено;
	ДанныеСтроки.Примечание = ВРег(Строка(ТипЗнч(Неопределено)));
	УстановитьФильтрыПараметров();
	Элементы.ГруппаОбщиеИОсобые.ТекущаяСтраница = Элементы.СтраницаОсобые;
КонецПроцедуры

&НаКлиенте
Процедура СписокОсобыхПараметровОсобыйТипПриИзменении(Элемент)
	Элементы.СписокОсобыхПараметров.ТекущиеДанные.ЗначениеПараметра = Неопределено;
	УстановитьФильтрыПараметров();
	Элементы.ГруппаОбщиеИОсобые.ТекущаяСтраница = Элементы.СтраницаОбщие;
КонецПроцедуры

&НаКлиенте
Процедура СписокОсобыхПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуОсобогоПараметра();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗапросовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	мСтрокаПеретаскивания = Элемент.ТекущиеДанные;
	ПараметрыПеретаскивания.Значение = "";
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗапросовПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗапросовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если Строка <> Неопределено Тогда
		НовыйРодитель = ДеревоЗапросов.НайтиПоИдентификатору(Строка);
		Потомок = мСтрокаПеретаскивания;
		ПрежнийРодитель = Потомок.ПолучитьРодителя();
		Если НЕ ((ПрежнийРодитель = Неопределено) ИЛИ (Строка = ПрежнийРодитель.ПолучитьИдентификатор())) Тогда
			Если НЕ ВИерархии(НовыйРодитель, Потомок) Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("ДеревоЗапросовПеретаскиваниеПослеВопроса", ЭтотОбъект, 
						Новый Структура("Потомок,НовыйРодитель,ПрежнийРодитель", Потомок, НовыйРодитель, ПрежнийРодитель)),
					"Переподчинить элемент """ + Потомок.Запрос + """ элементу """ + НовыйРодитель.Запрос + """?", 
					РежимДиалогаВопрос.ДаНет);
			Иначе
				ПоказатьПредупреждение(Неопределено, "Зацикливание подчиненности - переподчинение невозможно");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗапросовПеретаскиваниеПослеВопроса(Ответ, ДопПараметры) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	
	Потомок = ДопПараметры.Потомок;
	НовыйРодитель = ДопПараметры.НовыйРодитель;
	ПрежнийРодитель = ДопПараметры.ПрежнийРодитель;
	
	Подчинить(Потомок, НовыйРодитель.ПолучитьЭлементы());
	ПрежняяСемья = ПрежнийРодитель.ПолучитьЭлементы();
	ПрежняяСемья.Удалить(ПрежняяСемья.Индекс(Потомок));
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОсобогоПараметра()
	СтрокаПараметра = Элементы.СписокОсобыхПараметров.ТекущиеДанные;
	Если СтрокаПараметра <> Неопределено Тогда
		Если СтрокаПараметра.ОсобыйТип Тогда
			мФормаОсобогоТипа.ИмяПараметра = СтрокаПараметра.ИмяПараметра;
			мФормаОсобогоТипа.СтроковоеЗначениеПараметра = СтрокаПараметра.ЗначениеПараметра;
			мФормаОсобогоТипа.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОткрытьФормуОсобогоПараметраПослеЗакрытия", 
				ЭтотОбъект, СтрокаПараметра.ПолучитьИдентификатор());
			мФормаОсобогоТипа.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОсобогоПараметраПослеЗакрытия(СтруктураРезультата, ИДИ) Экспорт
	Если ЗначениеЗаполнено(СтруктураРезультата) Тогда
		СтрокаПараметра = СписокОсобыхПараметров.НайтиПоИдентификатору(ИДИ);
		Если СтрокаПараметра = Неопределено Тогда Возврат КонецЕсли;
		СтрокаПараметра.ИмяПараметра      = СтруктураРезультата.ИмяПараметра;
		СтрокаПараметра.ЗначениеПараметра = СтруктураРезультата.Результат;
		СтрокаПараметра.Примечание        = ВРег(СтруктураРезультата.СтрокаТипРезультата);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьСтрокуДереваЗапросов(НовыйЗапрос, ТекущийЗапрос)
	ЗаполнитьЗначенияСвойств(НовыйЗапрос, ТекущийЗапрос, , "ПараметрыЗапроса");
	ПараметрыТекущего = ТекущийЗапрос.ПараметрыЗапроса;
	ПараметрыНового = НовыйЗапрос.ПараметрыЗапроса;
	Для каждого СтрокаПараметр из ПараметрыТекущего Цикл
		СтрокаПараметрНового = ПараметрыНового.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПараметрНового, СтрокаПараметр);
	КонецЦикла;
	ДочерниеЗапросы = ТекущийЗапрос.ПолучитьЭлементы();
	ДочерниеЗапросыНового = НовыйЗапрос.ПолучитьЭлементы();
	Для каждого ДочернийЗапрос из ДочерниеЗапросы Цикл;
		НовыйДочернийЗапрос = ДочерниеЗапросыНового.Добавить();
		СкопироватьСтрокуДереваЗапросов(НовыйДочернийЗапрос, ДочернийЗапрос);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьТекстЗапроса(ТекстЗапроса, ПараметрыЗапроса, СпособВыгрузки)
	ВремяВыполнения = "";
	ОбновитьОтображениеДанных();	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ПолеРезультатаЗапроса = Новый ТабличныйДокумент();
		Начало = ТекущаяДата();
		Результат = ВызовВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса, СпособВыгрузки);
		Окончание = ТекущаяДата();
		ФорматВремени = "ДЛФ=В";
		ВремяВыполнения = "нач." + Формат(Начало, ФорматВремени) + "  оконч." + Формат(Окончание, ФорматВремени);
		Если ТипЗнч(Результат) = Тип("ТабличныйДокумент") Тогда
			ПолеРезультатаЗапроса = Результат;
			Элементы.ПолеРезультатаЗапроса.ТекущаяОбласть = Результат.Область(1, 1, 1, 1);
			УстановитьШиринуКолонок();
		Иначе
			Сообщить(Результат);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(Неопределено, "Текст запроса пустой");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШиринуКолонок()
	ТекущиеДанные = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ШиринаКолонок = ТекущиеДанные.ШиринаКолонок;
		Если ШиринаКолонок > 0 Тогда
			ПолеРезультатаЗапроса.Область().ШиринаКолонки = ШиринаКолонок;
		Иначе
			ПолеРезультатаЗапроса.Область().ШиринаКолонки = мШиринаКолонокПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДиалогВыбораФайла()
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок  = "Выберите файл со списком запросов";
	Диалог.Фильтр     = "Файлы запросов (*.sel)|*.sel|Все файлы (*.*)|*.*";
	Диалог.Расширение = "sel";
	Возврат Диалог;
КонецФункции

&НаКлиенте
Процедура СохранитьНаработки(ОписаниеОповещенияОЗавершении = Неопределено)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНаработкиПослеВопроса", ЭтотОбъект, ОписаниеОповещенияОЗавершении), 
			"Сохранить файл запросов?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаработкиПослеВопроса(Ответ, ОписаниеОповещенияОЗавершении) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьФайлЗапросов(Неопределено, ОписаниеОповещенияОЗавершении);
	Иначе
		Модифицированность = Ложь;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьЗапрос(ЭлементДереваЗапросов, ИмяЗапроса = "")
	ЭлементДереваЗапросов.Запрос         = ИмяЗапроса;
	ЭлементДереваЗапросов.ТекстЗапроса   = "";
	ЭлементДереваЗапросов.СпособВыгрузки = 1;
	ЭлементДереваЗапросов.ШиринаКолонок  = мШиринаКолонокПоУмолчанию;
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьЗапрос(Направление)
	ТекущийЗапрос = Элементы.ДеревоЗапросов.ТекущиеДанные;
	Если ТекущийЗапрос <> Неопределено Тогда
		Родитель = ТекущийЗапрос.ПолучитьРодителя();
		Если Родитель <> Неопределено Тогда
			Семейство = Родитель.ПолучитьЭлементы();
			Индекс = Семейство.Индекс(ТекущийЗапрос);
			Если ((Направление = 1) И (Индекс < Семейство.Количество() - 1)) 
				ИЛИ ((Направление = -1) И (Индекс > 0)) Тогда
					Семейство.Сдвинуть(Индекс, Направление);
					Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьИСохранитьДерево(ПутьКФайлу)
	АдресХранилища = ВызовПреобразоватьДерево();
	ПолучитьФайл(АдресХранилища, ПутьКФайлу, Ложь);
	УдалитьИзВременногоХранилища(АдресХранилища);
КонецПроцедуры

&НаКлиенте
Функция ВИерархии(НовыйРодитель, Потомок)
	ПредокНовогоРодителя = НовыйРодитель.ПолучитьРодителя();
	Проверять = Истина;
	Результат = Ложь;
	Пока Проверять Цикл
		Если ПредокНовогоРодителя <> Неопределено Тогда
			Если ПредокНовогоРодителя = Потомок Тогда
				Проверять = Ложь;
				Результат = Истина;
			Иначе
				ПредокНовогоРодителя = ПредокНовогоРодителя.ПолучитьРодителя();
			КонецЕсли;
		Иначе
			Проверять = Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Подчинить(Потомок, НоваяСемья)
	НоваяСтрока = НоваяСемья.Добавить();
	НоваяСтрока.Запрос         = Потомок.Запрос;
	НоваяСтрока.ТекстЗапроса   = Потомок.ТекстЗапроса;
	НоваяСтрока.СпособВыгрузки = Потомок.СпособВыгрузки;
	НоваяСтрока.ШиринаКолонок  = Потомок.ШиринаКолонок;
	СкопироватьПараметры(НоваяСтрока.ПараметрыЗапроса, Потомок.ПараметрыЗапроса);
	ПотомкиПотомка = Потомок.ПолучитьЭлементы();
	Для Каждого ПотомокПотомка из ПотомкиПотомка Цикл
		Подчинить(ПотомокПотомка, НоваяСтрока.ПолучитьЭлементы());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПараметры(ТаблицаПриемник, ТаблицаИсточник)
	Для каждого СтрокаИсточник из ТаблицаИсточник Цикл
		НоваяСтрока = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьФильтрыПараметров()
	ИмяКолонки = "ОсобыйТип";
	Элементы.СписокПараметров.ОтборСтрок = Новый ФиксированнаяСтруктура(ИмяКолонки, Ложь);	
	Элементы.СписокОсобыхПараметров.ОтборСтрок = Новый ФиксированнаяСтруктура(ИмяКолонки, Истина);	
КонецПроцедуры

&НаКлиенте
Функция ПередатьНаСервер(ПутьКФайлу)
	Перем АдресХранилища;
	
	ПоместитьФайл(АдресХранилища, ПутьКФайлу, ПутьКФайлу, Ложь, УникальныйИдентификатор);
	Возврат АдресХранилища;
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКФормам = ПолучитьОбработку().Метаданные().ПолноеИмя() + ".Форма.";
	СтрокаНеопределено = ЗначениеВСтрокуВнутр(Неопределено);
КонецПроцедуры

&НаСервере
Функция ВызовВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса, СпособВыгрузки)
	Возврат ПолучитьОбработку().ВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса, СпособВыгрузки, СоставРезультатов, ДляСсылокВыводитьГУИД);
КонецФункции

&НаСервере
Процедура ВызовПолучитьДерево(АдресХранилища, ШиринаКолонокПоУмолчанию)
	ПолучитьОбработку().ПолучитьДеревоИзФайла(АдресХранилища, ДеревоЗапросов, ШиринаКолонокПоУмолчанию);
КонецПроцедуры

&НаСервере
Функция ВызовПреобразоватьДерево()
	Возврат ПолучитьОбработку().ПреобразоватьДерево(ДеревоЗапросов);
КонецФункции

&НаСервере
Функция ВызовЗаполнитьПараметры(ИдентификаторТекущихДанных)
	Возврат ПолучитьОбработку().ЗаполнитьПараметрыЗапроса(ДеревоЗапросов, ИдентификаторТекущихДанных);
КонецФункции

&НаСервере
Функция ПолучитьОбработку()
	Возврат РеквизитФормыВЗначение("ОбработкаКонсольЗапросов");
КонецФункции



