// © Primus1C  25.11.2023  НАЧАЛО ►

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//Если ТекущийЯзыкСистемы() = "en" Тогда
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Язык = Метаданные.Языки.Английский Тогда 
		СтандартнаяОбработка = Ложь;
	    Представление = Данные.НаименованиеАнгл;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеАнгл");
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
