// © Primus1C  03.10.2023  НАЧАЛО ►  

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа "Неопределено" возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	Возврат ПроверяемыйТип <> Тип("Неопределено") И ОбщегоНазначенияПовтИсп.ОписаниеТипаВсеСсылки().СодержитТип(ПроверяемыйТип);
	
КонецФункции

Процедура ПроверкаФиксированностиДанных(Данные, ДанныеВЗначенииФиксированныхТипов = Ложь)
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("ХранилищеЗначения")
	 ИЛИ ТипДанных = Тип("ФиксированныйМассив")
	 ИЛИ ТипДанных = Тип("ФиксированнаяСтруктура")
	 ИЛИ ТипДанных = Тип("ФиксированноеСоответствие") Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ДанныеВЗначенииФиксированныхТипов Тогда
		
		Если ТипДанных = Тип("Булево")
		 ИЛИ ТипДанных = Тип("Строка")
		 ИЛИ ТипДанных = Тип("Число")
		 ИЛИ ТипДанных = Тип("Дата")
		 ИЛИ ТипДанных = Тип("Неопределено")
		 ИЛИ ТипДанных = Тип("УникальныйИдентификатор")
		 ИЛИ ТипДанных = Тип("Null")
		 ИЛИ ТипДанных = Тип("Тип")
		 ИЛИ ТипДанных = Тип("ХранилищеЗначения")
		 ИЛИ ТипДанных = Тип("ОбщийМодуль")
		 ИЛИ ТипДанных = Тип("ОбъектМетаданных")
		 ИЛИ ТипДанных = Тип("ТипЗначенияXDTO")
		 ИЛИ ТипДанных = Тип("ТипОбъектаXDTO")
		 ИЛИ ЭтоСсылка(ТипДанных) Тогда
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Ошибка в функции ФиксированныеДанные общего модуля ОбщегоНазначения."
"Данные типа ""%1"" не могут быть зафиксированы.';uk='Помилка у функції ФиксированныеДанные загального модуля ОбщегоНазначения."
"Дані типу ""%1"" не можуть бути зафіксовані.'"),
		Строка(ТипДанных) );
	
КонецПроцедуры

// Фиксирует данные типов Структура, Соответствие, Массив с учетом вложенности.
//
// Параметры:
//  Данные - Структура
//         - Соответствие
//         - Массив - коллекции, значения которых являются примитивными типами,
//           хранилищем значения или не могут быть изменены. Поддерживаются типы значений:
//           Булево, Строка, Число, Дата, Неопределено, УникальныйИдентификатор, Null, Тип,
//           ХранилищеЗначения, ОбщийМодуль, ОбъектМетаданных, ТипЗначенияXDTO, ТипОбъектаXDTO,
//           ЛюбаяСсылка.
//
//  ВызыватьИсключение - Булево - начальное значение Истина. Когда установлено Ложь, тогда в случае наличия
//                                нефиксируемых данных исключение не будет вызвано, при этом данные будут
//                                зафиксированы на сколько возможно.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, ФиксированноеСоответствие, ФиксированныйМассив - фиксированные данные, аналогичные
//    переданным в параметре Данные.
// 
Функция ФиксированныеДанные(Данные, ВызыватьИсключение = Истина) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Массив = Новый Массив;
		
		Для каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Массив.Добавить(ФиксированныеДанные(Значение, ВызыватьИсключение));
			Иначе
				Если ВызыватьИсключение Тогда
					ПроверкаФиксированностиДанных(Значение, Истина);
				КонецЕсли;
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый ФиксированныйМассив(Массив);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
	      ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Коллекция = Новый Структура;
		Иначе
			Коллекция = Новый Соответствие;
		КонецЕсли;
		
		Для каждого КлючИЗначение Из Данные Цикл
			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
			 ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
			 ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(
					КлючИЗначение.Ключ, ФиксированныеДанные(Значение, ВызыватьИсключение));
			Иначе
				Если ВызыватьИсключение Тогда
					ПроверкаФиксированностиДанных(Значение, Истина);
				КонецЕсли;
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			Возврат Новый ФиксированнаяСтруктура(Коллекция);
		Иначе
			Возврат Новый ФиксированноеСоответствие(Коллекция);
		КонецЕсли;
		
	ИначеЕсли ВызыватьИсключение Тогда
		ПроверкаФиксированностиДанных(Данные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

// Функция СтрокаТаблицыЗначенийВСтруктуру создает
// структуру со свойствами, как колонки таблицы
// значений передаваемой строки
// и устанавливает этим свойствам значения
// из строки таблицы значений.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// ВозвращаемоеЗначение:
//  Структура
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений, ИсключитьПоля = "") Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл 
		Если СтрНайти(ИсключитьПоля, Колонка.Имя) = 0 Тогда
			Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

// Функция - Разделяет строку на массив по указанному разделителю 
//
// Параметры:
//  ВходящаяСтрока	 - Строка - Строка для разделения
//  Разделитель		 - Строка - Строка разделитель
// 
// Возвращаемое значение:
// Массив  - Массив строк, которые получились в результате разделения входной строки
//
Функция СтрРазделить_(ВходящаяСтрока, Разделитель, ВключатьПустые=Истина) Экспорт
						   
	Рез = Новый Массив();
	ВрСтрока = СтрЗаменить(ВходящаяСтрока, Разделитель, Символы.ПС);	
	Для Сч = 1 По СтрЧислоСтрок(ВрСтрока) Цикл
		Стр = СтрПолучитьСтроку(ВрСтрока, Сч);
		Если Разделитель = " " и СокрЛП(Стр) = "" Тогда
			Продолжить;
		КонецЕсли;
		Рез.Добавить(Стр);
	КонецЦикла;  	
	Возврат Рез;

КонецФункции 

Функция ПолучитьРасширение(ИмяФайла) Экспорт

	л_МассивЧастейИмени = СтрРазделить(ИмяФайла,".");

	Возврат "." + л_МассивЧастейИмени[л_МассивЧастейИмени.ВГраница()];
	
КонецФункции // ПолучитьРасширение()

Функция ПолучитьИмяБезРасширения(ИмяФайла) Экспорт
	
	л_ИмяБезРасширения = "";
	
	л_МассивЧастейИмени = СтрРазделить(ИмяФайла, ".");
	Для л_Сч = 0 По л_МассивЧастейИмени.ВГраница() - 1 Цикл //цикл по всем частям кроме последней, где расширение имени
		л_ЧастьИмени		= л_МассивЧастейИмени[л_Сч];
		л_ИмяБезРасширения	= л_ИмяБезРасширения + "." + л_ЧастьИмени;
	КонецЦикла;
	
	Возврат Прав(л_ИмяБезРасширения, СтрДлина(л_ИмяБезРасширения) - 1); //удалить первую точку в имени
	
КонецФункции // ПолучитьРасширение()

// Преобразует расширение файла в нижний регистр без точки.
//
// Параметры:
//  Расширение - Строка - расширение для преобразования.
//
// Возвращаемое значение:
//  Строка - преобразованное расширение.
//
Функция РасширениеБезТочки(Знач Расширение) Экспорт
	
	Расширение = НРег(СокрЛП(Расширение));
	
	Если Сред(Расширение, 1, 1) = "." Тогда
		Расширение = Сред(Расширение, 2);
	КонецЕсли;
	
	Возврат Расширение;
	
КонецФункции

// Получается индекс пиктограммы файла - индекс в картинке КоллекцияПиктограммФайлов.
Функция ПолучитьИндексПиктограммыФайла(Знач РасширениеФайла) Экспорт
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
		ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
		Возврат 0;
	КонецЕсли;
	
	РасширениеФайла = РасширениеБезТочки(РасширениеФайла);
	
	Расширение = "." + НРег(РасширениеФайла) + ";";
	
	Если Найти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; // Файлы BAF.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; // Табличный Файл.
		
	ИначеЕсли Найти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; // Внешние обработки.
		
	ИначеЕсли Найти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли Найти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли Найти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли Найти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли Найти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли Найти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли Найти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли Найти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли Найти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли Найти(".msg;.eml;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли Найти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли Найти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли Найти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли Найти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли Найти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли Найти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли Найти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли Найти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли Найти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли Найти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли Найти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли Найти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли Найти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли Найти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли Найти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли Найти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли Найти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли Найти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли Найти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли Найти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли Найти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли Найти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьВСписокБезДублирования(Список, Значение, Представление=Неопределено, Пометка=Неопределено, Картинка=Неопределено) Экспорт
	
	Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
		Список.Добавить(Значение,
						?(Представление=Неопределено, Строка(Значение), Представление),
	                    ?(Пометка=Неопределено, Ложь, Пометка),
		                ?(Картинка=Неопределено, Новый Картинка(), Картинка));
	КонецЕсли;

КонецПроцедуры

Процедура ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СостояниеДокумента			= НСтр("ru = 'Новый'; en = 'New'"); 
		КартинкаСостоянияДокумента	= 4;
		
	Иначе
		
		Если Объект.Проведен Тогда
			СостояниеДокумента 			=  НСтр("ru = 'Проведен'; en = 'Posted'");
			КартинкаСостоянияДокумента	= 0;
			
		ИначеЕсли Объект.ПометкаУдаления Тогда
			СостояниеДокумента 			= НСтр("ru = 'Помечен на удаление'; en = 'Marked as deleted'");
			КартинкаСостоянияДокумента	= 2;   
			
		ИначеЕсли РазрешеноПроведение Тогда
			СостояниеДокумента 			= НСтр("ru = 'Не проведен'; en = 'Not posted'");
			КартинкаСостоянияДокумента	= 1;
			
		Иначе
			СостояниеДокумента 			= НСтр("ru = 'Записан'; en = 'Saved'");
			КартинкаСостоянияДокумента	= 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// функция перенесена в общ.модуль ОбщегоНазначенияСервер
//
//Функция ТекстHTMLВФорматированнуюСтроку(ТекстHTML) Экспорт
//	
//    ФорматированныйДокумент = Новый ФорматированныйДокумент;
//    ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Новый Структура);
//    Возврат ФорматированныйДокумент.ПолучитьФорматированнуюСтроку(); 
//	
//КонецФункции

Функция ПредставлениеДокументаДляПечати(ДокСсылка, ДопСведения = "") Экспорт
	
	Номер = СокрЛП(ДокСсылка.Номер);
	Пока Лев(Номер,1) = "0" Цикл
		Номер = Сред(Номер,2);
	КонецЦикла;
	
	Результат = СтрШаблон(НСтр("ru = '%1 № %2 от %3'; en = '%1 №2 (%3)'"), 
							ДокСсылка.Метаданные().Синоним, 
							Номер, 
							Формат(ДокСсылка.Дата,"ДФ=dd.MM.yyyy"));
	Если ДопСведения <> "" Тогда
		Результат = СтрШаблон("%1 (%2)", Результат, НРег(ДопСведения));
	КонецЕсли;						
							
	Возврат Результат;
	
КонецФункции 

Функция ИндексКартинкиСпецификации(Спецификация) Экспорт

	Спис = ОбщегоНазначенияПовтИсп.СписокСпецификаций();   
	Найд = Спис.НайтиПоЗначению(Строка(Спецификация));
	Если Найд = Неопределено Тогда
		Возврат 0;
	Иначе
	  Возврат Число(Найд.Представление);
	КонецЕсли;

КонецФункции 

Процедура ДополнитьТекстЗапросаСпецификациями(ТекстЗапроса, ИмяПоля) Экспорт
	
	ДопТекст = "ВЫБОР";
	Список = ОбщегоНазначенияПовтИсп.СписокСпецификаций();
	Для каждого Элт Из Список Цикл
		ДопТекст = ДопТекст + СтрШаблон(" КОГДА %1 = ""%2"" ТОГДА %3 ", ИмяПоля, Элт.Значение, Элт.Представление);
	КонецЦикла;	 
	ДопТекст = ДопТекст + " ИНАЧЕ 0 КОНЕЦ ";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИмяПоля, ДопТекст);
	
КонецПроцедуры

Функция ВыборкуВСтрокуСРазделителями(Выборка, ИмяПоля, Разделитель=",") Экспорт

	Стр = "";
	Пока Выборка.Следующий() Цикл
		Стр = Стр + Выборка[ИмяПоля] + Разделитель + " ";
	КонецЦикла; 
	Если Стр <> "" Тогда
		Стр	= Лев(Стр, СтрДлина(Стр)-2);
	КонецЕсли;
    Возврат Стр;

КонецФункции // КоллекциюВСтрокуСРазделителями()

// © Primus1C  ОКОНЧАНИЕ ◄
