&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	// © Primus1C  10.12.2023  НАЧАЛО ►  
	////2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда гоСтандартныйОтбор(Список, 0, Истина, Мас) КонецЕсли; 
	
	гоСтандартныйОтборПоПолю("Склады", Список, "Ссылка");   
	
	англ = ПользователиИнформационнойБазы.ТекущийПользователь().Язык = Метаданные.Языки.Английский;
    Элементы.Наименование.Видимость 	= НЕ англ;
    Элементы.НаименованиеАнгл.Видимость = англ;

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры
