&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = "Перемещение";
	Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	
	// © Primus1C  23.12.2023  НАЧАЛО ►
	
	//2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда 
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[0].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[0].ПравоеЗначение = Мас;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[1].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[1].ПравоеЗначение = Мас;
	//КонецЕсли;
	
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	гоСтандартныйОтборПоПолю("Склады", Список, "Склад");
	
	СтруктураПечатныхФорм = Документы.Перемещение.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Перемещение.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти 
