&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)    
	
	// © Primus1C  23.03.2025  НАЧАЛО ►    
	Отбор = Новый Структура("Кассы", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ФормаОтчета = ПолучитьФорму("Отчет.ОборотыДенег.Форма.ФормаОтчетаНовая", ПараметрыФормы);
	ЭлементыОтбора = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	ПолеКасса = Новый ПолеКомпоновкиДанных("Касса");
	Для каждого ЭлОтбора Из ЭлементыОтбора Цикл
		Если ЭлОтбора.ЛевоеЗначение = ПолеКасса Тогда
			ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлОтбора.ПравоеЗначение = ПараметрКоманды;	
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	ФормаОтчета.Открыть();
	Возврат;
	// © Primus1C  ОКОНЧАНИЕ ◄
	

	Попытка
		Период = Новый СтандартныйПериод(НачалоДня(ПараметрыВыполненияКоманды.Источник.НачДата), КонецДня(ПараметрыВыполненияКоманды.Источник.КонДата));
	Исключение
		Период = 0;
	КонецПопытки; 
	
	Если Период = 0 Тогда 
		Отбор = Новый Структура("Кассы", ПараметрКоманды);
	Иначе 
		Отбор = Новый Структура("Кассы, Период", ПараметрКоманды, Период);
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	
	ОткрытьФорму("Отчет.ОборотыДенег.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
