Перем клСканерШК Экспорт;
Перем клСканерШКВключен Экспорт;
//2016.02.02
Перем клБуферДокумент Экспорт;
Перем клБуферНомераСтрок Экспорт;

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Рез = омСервер.ЕстьЕщеСеансы();
	Если НЕ (Рез = "") Тогда клОшибка(Рез); Отказ = Истина; Возврат; КонецЕсли; 
	
	Если (гоПользовательКод() = "Регистрация") И (гоПараметрСеанса("Настройка") <> "ОК") Тогда
		Отказ = Истина;
		ОткрытьФорму("ОбщаяФорма.Настройка", , , , , , Новый ОписаниеОповещения("ПередНачаломРаботыСистемыПослеНастройки", ОбработчикиКомандКлиент));
	// © Primus1C  07.02.2024  НАЧАЛО ► 
	ИначеЕсли НЕ омСервер.ВходВПрограммуРазрешен() Тогда   
		клВнимание(НСтр("ru = 'Вход в программу запрещен! Обратитесь к администратору'; en = 'Entry to the program is prohibited! Contact your administrator'"),,
				   НСтр("ru = 'Авторизация: '; en = 'Authorization: '")+гоПользователь());
		Отказ = Истина;  
	ИначеЕсли омСервер.ПотребоватьСменуПароляПриВходе() Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВернутьПарольБезУстановки", Ложь);
		ПараметрыФормы.Вставить("СтарыйПароль", Неопределено);
		ПараметрыФормы.Вставить("Пользователь", Неопределено);
	
		ОткрытьФорму("ОбщаяФорма.СменаПароля", ПараметрыФормы,,,,, );
											
	// © Primus1C  ОКОНЧАНИЕ ◄	
	КонецЕсли;
	
	омСервер2.ПередНачалоРаботыСистемыНаСервере(Отказ);
	
	// © Primus1C  08.08.2025  НАЧАЛО ►
	УстановитьПараметрыФункциональныхОпцийИнтерфейса(Новый Структура("Пользователь", гоПользователь()));
	// © Primus1C  ОКОНЧАНИЕ ◄   
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	клУстановитьЗаголовокПриложения();
	
	омСервер.УстановитьНастройкиПоУмолчанию();
	
	клСканерШК = Неопределено;
	клСканерШКВключен = Ложь;
	
	//2016.02.02
	клБуферДокумент = Неопределено;
	клБуферНомераСтрок = Новый Массив;  
	
	// © Primus1C  06.09.2023  НАЧАЛО ► 
		//***Подключение подсистемы "Сообщения"
		ПроверитьПодключениеОбработчикаОжиданияИнформированияОНовыхСообщениях();
		//===Подключение подсистемы "Сообщения" 
	ПроверитьПодключениеОбработчикаОжиданияИнформированияОНовыхСообщенияхВнеОчереди();	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ) 
	
	//омСервер.СЗН("Старт", "Фирма", гоПараметрСеанса("Фирма"));
	
	//Если ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ПодтверждениеЗакрытияПрограммы") Тогда
	//	ТекстПредупреждения = НСтр("ru = 'Завершить работу?'; en = 'Close program?'");
	//	Отказ = Истина;
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	Если клСканерШКВключен Тогда РаботаСоСканеромШК.ОтключитьСканер(клСканерШК) КонецЕсли;
КонецПроцедуры


// © Primus1C  06.09.2023  НАЧАЛО ► 

#Область Подсистема_Сообщения
	
	//***Подключение подсистемы "Сообщения"
	
	Процедура ПроверитьПодключениеОбработчикаОжиданияИнформированияОНовыхСообщениях() ЭКСПОРТ
		
		СистемаИспользуется = Сооб_Сервер.ПроверитьИспользованиеСистемыСообщений();
		
		ИнтервалПроверкиНапоминаний = Сооб_Сервер.ПолучитьВремяПовторения()*60;
		
		Если (ИнтервалПроверкиНапоминаний > 0) И СистемаИспользуется Тогда
			
			ПодключитьОбработчикОжидания("ПроверитьНапоминанияОбСообщениях", ИнтервалПроверкиНапоминаний);
			
		Иначе
			
			ОтключитьОбработчикОжидания("ПроверитьНапоминанияОбСообщениях");
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ПроверитьНапоминанияОбСообщениях() ЭКСПОРТ
		
		СписокНапоминаний = Сооб_Сервер.СформироватьСписокНовыхСообщений();
		
		Если СписокНапоминаний <> НЕОПРЕДЕЛЕНО Тогда
			
			ТекСообщНом = 0;
			ВсегоСообщ = СписокНапоминаний.Количество();
			
			Для КАЖДОГО текНапоминание ИЗ СписокНапоминаний Цикл
				
				ТекСообщНом = ТекСообщНом + 1;
				
				ВыВестиТекНапоминание(текНапоминание, ТекСообщНом, ВсегоСообщ);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ВыВестиТекНапоминание(ТекН, ТекНом, ВсегоН) ЭКСПОРТ
		
		ТекСообСсылка = ПолучитьНавигационнуюСсылку(ТекН.Ключ);
		Если ТекН.Реквизиты["ТипСообщения"] = ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Сообщение") Тогда
			лКартинка = БиблиотекаКартинок.СообщениеСинее;	
		ИначеЕсли ТекН.Реквизиты["ТипСообщения"] = ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Напоминание") Тогда
			лКартинка = БиблиотекаКартинок.СообщениеЗеленое;	
		Иначе // поручение	
			лКартинка = БиблиотекаКартинок.СообщениеКрасное;	
		КонецЕсли;
		Сооб_Сервер.ПолучитьКартинкуДляСообщения(ТекН.Реквизиты["ТипСообщения"]);
		
		ПоказатьОповещениеПользователя(
		//НСтр("ru = 'Новое: '; en = 'New: '")+СокрЛП(ТекН.Реквизиты["ТипСообщения"]), 
		СтрШаблон("%1 %2: № %3 (%4)", 
					НСтр("ru = 'Новое: '; en = 'New: '"), СокрЛП(ТекН.Реквизиты["ТипСообщения"]), ТекНом, ВсегоН), 
		ТекСообСсылка, 
		//"№ "+ТекНом+" ("+ВсегоН+")"+Символы.ПС+"Тема: "+СокрЛП(ТекН.Реквизиты["Тема"])+Символы.ПС+"Автор: "+СокрЛП(ТекН.Реквизиты["Автор"]),
		СтрШаблон("%1: %2
					|%3: %4", 
					НСтр("ru = 'Тема'; en = 'Theme'"), СокрЛП(ТекН.Реквизиты["Тема"]), 
					НСтр("ru = 'Автор'; en = 'Author'"), СокрЛП(ТекН.Реквизиты["Автор"])),
					лКартинка,
					СтатусОповещенияПользователя.Важное,
					);
		
	КонецПроцедуры
	
	//===Подключение подсистемы "Сообщения"
	
	
Процедура ПроверитьПодключениеОбработчикаОжиданияИнформированияОНовыхСообщенияхВнеОчереди() Экспорт 

	ПодключитьОбработчикОжидания("ПроверитьНапоминанияОбСообщенияхВнеОчереди", 60);	

КонецПроцедуры

Процедура ПроверитьНапоминанияОбСообщенияхВнеОчереди() Экспорт

	мас = Сооб_Сервер.СформироватьСписокНовыхСообщенийВнеОчереди();
	
	Для КАЖДОГО эл ИЗ мас Цикл
		
		ПоказатьОповещениеПользователя(эл.Реквизиты.Тема,,
										эл.Реквизиты.Сообщение,
										БиблиотекаКартинок.ДиалогВосклицание, 
										СтатусОповещенияПользователя.Важное);
		Отбор = Новый Структура("Получатель,Автор,ЗапланированнаяДатаДоставки,ТипСообщения,Категория,УникИдент");
		ЗаполнитьЗначенияСвойств(Отбор, эл.реквизиты);
		Сооб_Сервер.УдалитьЗапись(Отбор);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄