
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	Если ТребуемыеПараметры = Неопределено Тогда

		ПараметрыСеанса.Пользователь 			= омСервер.ПолучитьПользователя();
		ПараметрыСеанса.Администратор 			= СокрЛП(ПараметрыСеанса.Пользователь) = "Администратор" И РольДоступна("Администратор");  
		// © Primus1C  06.02.2024  НАЧАЛО ►
		ПараметрыСеанса.Администратор 			= РольДоступна("Администратор");   
		ПараметрыСеанса.БезусловноеПроведениеДокументов = Ложь;
		// © Primus1C  ОКОНЧАНИЕ ◄
		ПараметрыСеанса.Валюта 					= омСервер.ПолучитьВалюту("руб");
		ПараметрыСеанса.Фирма 					= омСервер.ПолучитьФирму();

		ПараметрыСеанса.Склад 					= Справочники.Склады.ПустаяСсылка();
		ПараметрыСеанса.Номенклатура 			= Справочники.Номенклатура.ПустаяСсылка();

		ПараметрыСеанса.ДСчет 					= Справочники.ДенежныеСчета.ПустаяСсылка();

		ПараметрыСеанса.ВалютаВыбора 			= Справочники.Валюты.ПустаяСсылка();

		ПараметрыСеанса.ПоставщикВыбора 		= Справочники.Контрагенты.ПустаяСсылка();
		
		ПараметрыСеанса.ДоступныНаименованияКонтрагентов = ОбщегоНазначенияПовтИсп.ДоступныНаименованияКонтрагентов();
		
		// © Primus1C  10.09.2023  НАЧАЛО ► 
		
		//УстановитьПривилегированныйРежим(Истина);
		//лПользовательИБ = ПараметрыСеанса.Пользователь.ИдентификаторПользователяИБ;
		//Если лПользовательИБ = Неопределено Тогда
		//	ПараметрыСеанса.Язык	= "ru";
		//Иначе	
		//	ПараметрыСеанса.Язык	=  ?(лПользовательИБ.Язык=Неопределено, "ru", Строка(лПользовательИБ.Язык.Имя));
		//КонецЕсли;
		//УстановитьПривилегированныйРежим(Ложь);
		
		ПараметрыСеанса.НачальнаяДатаПлатежногоКалендаряЗакупок = Дата(2024, 05, 27);
		
		ПараметрыСеанса.БазоваяВалюта					= Константы.БазоваяВалюта.Получить();	
		ПараметрыСеанса.ВалютаУстановкиЦенПродажи		= Константы.ВалютаУстановкиЦенПродажи.Получить();	
		ПараметрыСеанса.ДатаЗапретаРедактирования		= Константы.ДатаЗапретаРедактирования.Получить();
		ПараметрыСеанса.Сооб_ПериодПроверкиСообщений 	= Константы.Сооб_ПериодПроверкиСообщений.Получить();
		ПараметрыСеанса.Сооб_ПериодОбновленияЧата		= Константы.Сооб_ПериодОбновленияЧата.Получить();  
		
		ПараметрыСеанса.ВидетьТолькоСвоиДокументы		= ПараметрыСеанса.Пользователь.НеВидетьЧужиеНакладные;
			
		ПараметрыСеанса.ОграничитьДоступПоДенежнымСчетам		= ПараметрыСеанса.Пользователь.ДенежныеСчета.Количество() > 0;
		ПараметрыСеанса.ОграничитьДоступПоСкладам       		= ПараметрыСеанса.Пользователь.Склады.Количество() > 0;
		ПараметрыСеанса.ОграничитьДоступПоСкладамКонтрагентов 	= ПараметрыСеанса.Пользователь.СкладыКонтрагентов.Количество() > 0;
		ПараметрыСеанса.ОграничитьДоступПоКонтрагентам 			= ПараметрыСеанса.Пользователь.Контрагенты.Количество() > 0;
        ПараметрыСеанса.ВариантДоступаККонтрагентамРазрешить   	= ПараметрыСеанса.Пользователь.ВариантДоступаККонтрагентам = Перечисления.ВариантДоступа.Разрешить;
		
		ПараметрыСеанса.ГрупповоеПерепроведениеДокументов = Ложь;  
	
		Массив = Новый Массив;
		Для Каждого СтрокаТЧ Из ПараметрыСеанса.Пользователь.Контрагенты Цикл
			Массив.Добавить(СтрокаТЧ.Группа);   
		КонецЦикла;
		ПараметрыСеанса.ОграниченныеКонтрагенты = Новый ФиксированныйМассив(Массив);
		
		//Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Стиль) Тогда
		//	ГлавныйСтиль = БиблиотекаСтилей[ПараметрыСеанса.Пользователь.Стиль];
		//КонецЕсли;       
		лСтиль = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СтильПрограммы", Ложь);
		Если ЗначениеЗаполнено(лСтиль) Тогда
			ГлавныйСтиль = БиблиотекаСтилей[Строка(лСтиль)];
		КонецЕсли;
		// © Primus1C  ОКОНЧАНИЕ ◄
		
		омСервер2.ПроверитьНастройку();

		омСервер.ПроверитьНастройку();  
		
	КонецЕсли;

КонецПроцедуры 



