&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Фирма.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.Фирма) Тогда Запись.Фирма = гоФирма() КонецЕсли;     
	
	// © Primus1C  06.07.2023  НАЧАЛО ► 
	ЗаполнитьКэшДанных(); 
	ОтобразитьБазовуюВалюту();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

// © Primus1C  06.07.2023  НАЧАЛО ►

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьЦветВалюты();
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 

&НаСервере
Процедура ОтобразитьБазовуюВалюту()

	БазоваяВалюта = Запись.Валюта.БазоваяВалюта;
	Если НЕ ЗначениеЗаполнено(БазоваяВалюта) Тогда
		БазоваяВалюта = Запись.Фирма.Валюта;	
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона 		= КэшДанных.ЦветаВалют.Получить(Запись.Валюта);    
		Элементы.БазоваяВалюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(омСервер.ПолучитьРеквизит(Запись.Валюта,"БазоваяВалюта"));    
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ФирмаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Запись.КурсОбратный = 1 / Запись.Курс;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетСреднийКурс(Команда)
	
	ФормаОтчета = ПолучитьФорму("Отчет.СреднийКурс.Форма");
	
	ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Дата", Запись.Период);
	ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Валюта", Запись.Валюта);
	
	//ФормаОтчета.Элементы.ФормаВарианты.Видимость = Ложь;
	ФормаОтчета.Открыть();
	ФормаОтчета.СкомпоноватьРезультат();  

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄