&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Фирма.Видимость = Ложь;
	
	Попытка
		ЭтаФорма.Элементы.ФормаИзменитьФорму.Видимость = Ложь;
		ЭтаФорма.Элементы.ФормаНастройкаСписка.Видимость = Ложь;
		
		ЭтаФорма.Элементы.ФормаОбновить.ТолькоВоВсехДействиях = Ложь;
		ЭтаФорма.Элементы.ФормаОбновить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Исключение
	КонецПопытки; 
	
	//гоСтандартныйОтбор(Список, 0, Истина, гоФирма());

	// © Primus1C  11.11.2023  НАЧАЛО ► 
	Если Параметры.Свойство("Валюта") Тогда
		//гоСтандартныйОтбор(Список, 1, Истина, Параметры.Валюта);  
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Валюта");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Параметры.Валюта;

		//Элементы.КурсЗакупкиСредний.Видимость = Параметры.Валюта.ВестиПартионныйУчет;
		//Элементы.КурсПродажиСредний.Видимость = Параметры.Валюта.ВестиПартионныйУчет;
	КонецЕсли;   
	глПокраситьВалюты(ЭтаФорма, "Валюта"); 
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ОтчетСреднийКурс(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Пожалуйста, выберите строку в списке.");
		Возврат;
	КонецЕсли;
	ФормаОтчета = ПолучитьФорму("Отчет.СреднийКурс.Форма");
	
	УстановитьПараметрВФормеОтчета(ФормаОтчета, "Дата", ТекущиеДанные.Период);
	УстановитьПараметрВФормеОтчета(ФормаОтчета, "Валюта", ТекущиеДанные.Валюта);
	
	//ФормаОтчета.Элементы.ФормаВарианты.Видимость = Ложь;
	ФормаОтчета.Открыть();
	ФормаОтчета.СкомпоноватьРезультат();  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрВФормеОтчета(ФормаОтчета, ИмяПараметра, Значение)
	
	ПараметрКД = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	
	// Ищем параметр в базовых настройках СКД отчета
	ЭлементНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКД);
	
	Если ЭлементНастройки <> Неопределено Тогда
		ЭлементНастройки.Значение = Значение;
		ЭлементНастройки.Использование = Истина;
		
		// Обязательно проталкиваем в пользовательские настройки, чтобы параметры появились в шапке
		Идентификатор = ЭлементНастройки.ИдентификаторПользовательскойНастройки;
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ПользНастройка = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
			Если ПользНастройка <> Неопределено Тогда
				ПользНастройка.Значение = Значение;
				ПользНастройка.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры