
//Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДиалогВыбораЦвета = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ТекстДиалогаВыбораЦвета").ПолучитьТекст();
	
	Если ТипЗнч(Этаформа.Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Если Этаформа.Параметры.Свойство("ТекущийЦвет") Тогда
			Объект.ВыбранныйЦвет = гоЦветРГБ(Этаформа.Параметры.ТекущийЦвет);	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры


//Обработчики команд
&НаКлиенте
Процедура ДиалогВыбораЦветаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СоставляющиеВыбранногоЦвета = Элемент.Документ;
	
	Если СоставляющиеВыбранногоЦвета = Неопределено Тогда Возврат; КонецЕсли;
	
	colorR		= СоставляющиеВыбранногоЦвета.getElementById("colorR");
	colorG		= СоставляющиеВыбранногоЦвета.getElementById("colorG");
	colorB		= СоставляющиеВыбранногоЦвета.getElementById("colorB");
	
	Красный 	= ?(colorR = Неопределено, 0, colorR.Value);
	Зеленый 	= ?(colorG = Неопределено, 0, colorG.Value);
	Синий 		= ?(colorB = Неопределено, 0, colorB.Value);
	
	Объект.ВыбранныйЦвет = Новый Цвет(Красный, Зеленый, Синий);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Объект.ВыбранныйЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры
