&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Партия, Фирма, Номенклатура", ПараметрКоманды, гоФирма(), гоРеквизит(ПараметрКоманды, "Владелец"));
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ОткрытьФорму("Отчет.ОборотыОднойПартии.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
