
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
СтандартнаяОбработка = Ложь;

Поиск = Новый Структура("ФИО",ВыбраннаяСтрока); 
МассивСтрок = Таблица.НайтиСтроки(Поиск);
Если МассивСтрок.Количество() = 0 Тогда
Строка = Таблица.Добавить();
Строка.ФИО = ВыбраннаяСтрока;

Иначе
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Этот сотрудник уже выбран в список!";
Сообщение.Сообщить();
КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
СтандартнаяОбработка = Ложь;
Для каждого Элемент Из ПараметрыПеретаскивания.Значение Цикл
Поиск = Новый Структура("ФИО",Элемент); 
МассивСтрок = Таблица.НайтиСтроки(Поиск);
Если МассивСтрок.Количество() = 0 Тогда
Строка = Таблица.Добавить();
Строка.ФИО = Элемент;
Иначе
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Этот сотрудник уже выбран в список!";
Сообщение.Сообщить();
КонецЕсли
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВсех(Команда)
	
	ЗаполнитьСписокНаСервере()
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СправочникПользователи.Ссылка КАК ФИО
	               |ИЗ
	               |	Справочник.Пользователи КАК СправочникПользователи
	               |ГДЕ
	               |	НЕ СправочникПользователи.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СправочникПользователи.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФИО
	               |АВТОУПОРЯДОЧИВАНИЕ";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		НовСтр = Таблица.Добавить();
		НовСтр.ФИО = Выборка.ФИО;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	ОповеститьОВыборе(Таблица);
	Закрыть();
КонецПроцедуры




