
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы.КомпоновщикНастроекПользовательскиеНастройкиОсновные.РастягиватьПоВертикали = Истина;
	элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы.КомпоновщикНастроекПользовательскиеНастройкиОсновные.Высота = 80;
	
	//элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент1.ПодчиненныеЭлементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент1Значение.СписокВыбора = СписокОтправителей();

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокОтправителей()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	СкладыКонтрагентов.Ссылка
	             |ИЗ
	             |	Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	             |ГДЕ
	             |	СкладыКонтрагентов.Отправитель
	             |	И НЕ СкладыКонтрагентов.ПометкаУдаления";
	Спис = Новый СписокЗначений;
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Спис.Добавить(Выборка.Ссылка);
	КонецЦикла;	
	
	Возврат Спис;
	
КонецФункции	