
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для каждого Стр Из Строки Цикл  
		
		лЗначение = "";
		Для каждого СтрокаТЧ Из Стр.Ключ.Товары Цикл
			лЗначение = лЗначение + СтрокаТЧ.Номенклатура + "; ";	
		КонецЦикла;
		Стр.Значение.Данные.ГруппыТоваров = Лев(лЗначение, СтрДлина(лЗначение) - 2);
		
	КонецЦикла;                                

КонецПроцедуры


&НаКлиенте
Процедура Скопировать(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьПослеВыбораКонтрагента", ЭтотОбъект), Неопределено, НСтр("ru = 'Выберите перевозчика'; en = 'Select the carrier'"), Тип("СправочникСсылка.Контрагенты"));
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПослеВыбораКонтрагента(Выб, ДопПараметры) Экспорт
	Если Выб = Неопределено Тогда Возврат КонецЕсли;
	СкопироватьНаСервере(Выб);
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура СкопироватьНаСервере(Контрагент)

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ТоварныеГруппыПеревозчиков.Ссылка КАК Ссылка,
	             |	ТоварныеГруппыПеревозчиков.Наименование КАК Наименование,
	             |	ТоварныеГруппыПеревозчиков.Товары.(
	             |		Номенклатура КАК Номенклатура
	             |	) КАК Товары
	             |ИЗ
	             |	Справочник.ТоварныеГруппыПеревозчиков КАК ТоварныеГруппыПеревозчиков
	             |ГДЕ
	             |	ТоварныеГруппыПеревозчиков.Владелец = &Владелец
	             |	И НЕ ТоварныеГруппыПеревозчиков.ПометкаУдаления";
	Запр.УстановитьПараметр("Владелец", Контрагент);
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Нов = Справочники.ТоварныеГруппыПеревозчиков.СоздатьЭлемент();
		Нов.Владелец = ЭтотОбъект.Список.Отбор.Элементы[0].ПравоеЗначение;
		Нов.Наименование = Выборка.Наименование;
		ВыборкаТов = Выборка.Товары.Выбрать();
		Пока ВыборкаТов.Следующий() Цикл
			НовТов = Нов.Товары.Добавить();	
			НовТов.Номенклатура = ВыборкаТов.Номенклатура;
		КонецЦикла;
	    Нов.Записать();
	КонецЦикла;

КонецПроцедуры
