&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	// © Primus1C  10.12.2023  НАЧАЛО ► 
	//2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда гоСтандартныйОтбор(Список, 0, Истина, Мас) КонецЕсли;  
	
	гоСтандартныйОтборПоПолю("Склады", Список, "Ссылка");   
	
	англ = ПользователиИнформационнойБазы.ТекущийПользователь().Язык = Метаданные.Языки.Английский;
    Элементы.Наименование.Видимость 	= НЕ англ;
    Элементы.НаименованиеАнгл.Видимость = англ;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	//СтандартнаяОбработка = Ложь;  
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивСсылок = Новый Массив;
	Для Каждого Стр Из Строки Цикл
		МассивСсылок.Добавить(Стр.Ключ);
	КонецЦикла;
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиСклады.Склад КАК Склад,
		|	Сотрудники.Наименование КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники.Склады КАК СотрудникиСклады
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СотрудникиСклады.Ссылка = Сотрудники.Ссылка
		|ГДЕ
		|	СотрудникиСклады.Склад В (&Ссылки)
		|	И НЕ Сотрудники.ЭтоГруппа
		|	И НЕ Сотрудники.ПометкаУдаления
		|	И (Сотрудники.ДатаУвольнения = &ПустаяДата
		|		ИЛИ Сотрудники.ДатаУвольнения >= &ТекущаяДата)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникиСклады.Склад,
		|	Сотрудники.Наименование";
	
	СотрудникиПоСкладам = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СотрудникиСтрокой = СотрудникиПоСкладам.Получить(Выборка.Склад);
		Если СотрудникиСтрокой = Неопределено Тогда
			СотрудникиСтрокой = Выборка.Сотрудник;
		Иначе
			СотрудникиСтрокой = СотрудникиСтрокой + ", " + Выборка.Сотрудник;
		КонецЕсли;
		СотрудникиПоСкладам.Вставить(Выборка.Склад, СотрудникиСтрокой);
		
	КонецЦикла;
	
	Для Каждого Стр Из Строки Цикл
		
		СотрудникиСтрокой = СотрудникиПоСкладам.Получить(Стр.Ключ);
		Стр.Значение.Данные.СотрудникиСтрокой = ?(СотрудникиСтрокой = Неопределено, "", СотрудникиСтрокой);
		
	КонецЦикла;
	
КонецПроцедуры

