Процедура ЗаполнитьНастройки()
	
	МожноСеансов = 1;
	ВариантДоступаККонтрагентам = Перечисления.ВариантДоступа.Запретить;
	
	Макет = Справочники.Пользователи.ПолучитьМакет("НачальноеЗаполнение");
	Для К = 1 По Макет.ШиринаТаблицы Цикл
		Режим = Макет.Область(1, К).Текст;
		Для инд = 2 По Макет.ВысотаТаблицы Цикл
			стр = Макет.Область(инд, К).Текст;
			Если НЕ ЗначениеЗаполнено(стр) Тогда
				Продолжить;
			КонецЕсли; 
			Если Режим = "Контрагенты.Запретить" Тогда
				Контрагенты.Добавить().Группа = Справочники.Контрагенты.НайтиПоНаименованию(стр, Истина);		
			ИначеЕсли Режим = "Склады.Запретить" Тогда

			Иначе
			
			КонецЕсли;
		КонецЦикла; 	
	КонецЦикла;

КонецПроцедуры


Процедура ПередЗаписью(Отказ)  

	// © Primus1C  27.02.2024  НАЧАЛО ►   
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
    Если ЭтоНовый() Тогда
		ВходВПрограммуРазрешен = Истина;	
		//ПотребоватьСменуПароляПриВходе = Истина; 
		ЗаполнитьНастройки();
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	Сохранен = ТекущаяДата();
	
	//2015.11.12
	Попытка
		//здесь пользователь может быть не определен еще и будет ошибка
		//такое происходит при создании новых автоматически
		Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
		КемСохранен = гоПользователь();
	Исключение
	    //Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	//2017.03.20
	Складов = Склады.Количество();
	ДенежныхСчетов = ДенежныеСчета.Количество(); 
	// © Primus1C  30.11.2023  НАЧАЛО ►
	СкладовОтправителя = СкладыКонтрагентов.Количество();
	Контрагентов = Контрагенты.Количество();
	
	УстановитьПривилегированныйРежим(Истина);
	ПользИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	УстановитьПривилегированныйРежим(Ложь);
	Попытка	
		Если ЗначениеЗаполнено(ПользИБ.Имя) Тогда
			ИдентификаторПользователяИБ = ПользИБ.УникальныйИдентификатор;
		КонецЕсли; 
	Исключение	
	КонецПопытки;
	ПользовательИБ = ЗначениеЗаполнено(ИдентификаторПользователяИБ); 
	Если ПометкаУдаления Тогда
		ВходВПрограммуРазрешен = Ложь;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОписаниеПользователяИБ") Тогда
	     Если ДополнительныеСвойства.ОписаниеПользователяИБ.Свойство("Действие") И ДополнительныеСвойства.ОписаниеПользователяИБ.Свойство("Пароль") Тогда
		 	Попытка
				ПользИБ.Пароль = ДополнительныеСвойства.ОписаниеПользователяИБ.Пароль;
			    ПользИБ.Записать();   
				//Т = "Пароль сохранен";
			Исключение
			    //Т = "Ошибка сохранения пароля! Пароль не изменен";
			КонецПопытки;            
		 КонецЕсли;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИдентификаторПользователяИБ = Неопределено;

КонецПроцедуры
