
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Партия", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина); 
	
	Попытка
		ДанныеИсточника = ПараметрыВыполненияКоманды.Источник.Объект;
		ПараметрыФормы.Вставить("Дата", ДанныеИсточника.Дата);
		ПараметрыФормы.Вставить("Валюта", ДанныеИсточника.Валюта);
	Исключение
		
	КонецПопытки;
	
	ОткрытьФорму("Отчет.ЗатратыПартии.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
