Процедура ПередЗаписью(Отказ)   
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	//КемСохранен = гоПользователь();
	//Сохранен = ТекущаяДата(); 
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);
	
	ЦенаЗакупкиВБазВалюте = РаботаСВалютой.Пересчитать2025(ЦенаЗакупки, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, ДатаПартии);
	
КонецПроцедуры
