
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Приоритет = Перечисления.Важность.ВРабочемПорядке;
	Пользователь = гоПользователь();
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)           
	
	ДатаВыполнения = ТекущаяДатаСеанса();  
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Тэги = СокрЛП(Тэги);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаВыполнения = Дата(1,1,1);
КонецПроцедуры
