
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	гоСтандартныйОтбор(Список, 0, Истина, гоФирма());
	
	// © Primus1C  13.12.2023  НАЧАЛО ►
	////2017.03.22
	//Мас = омСервер.МассивКасс();
	//Если Мас.Количество() <> 0 Тогда гоСтандартныйОтбор(Список, 1, Истина, Мас) КонецЕсли;
  	гоСтандартныйОтборПоПолю("ДенежныеСчета", Список, "Ссылка");
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры
