&НаСервере
Функция Штрихкод(Код)


	Возврат 0;

КонецФункции // ()
  
 
 
&НаСервере
Процедура ПечатьНаСервере()
	
	Запр = Новый Запрос;
	Запр.Текст = "";
	Запр.УстановитьПараметр("", );
	Запр.УстановитьПараметр("", ); 
	
	Для Инд = 1 По Количество Цикл
		ШК = Штрихкод(Номенклатура.Код);
		
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	
	Количество = 1;
	
КонецПроцедуры
