
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Деньги Расход
	Движения.Деньги.Записывать = Истина;
	Движения.Деньги.Очистить();
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Касса = Касса;
	Движение.Валюта = Валюта;
	Движение.Остаток = Сумма;
	
	// регистр Долги Расход
	Движения.Долги.Записывать = Истина;
	Движения.Долги.Очистить();
	Движение = Движения.Долги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Док = Ссылка;
	Движение.Валюта = Валюта;
	Движение.Контрагент = Контрагент;
	Движение.ДолгПоставщику = Сумма;
	
	// регистр ВКД_ПоступлениеСписаниеДС Расход
	Движения.ВКД_ПоступлениеСписаниеДС.Записывать = Истина;
	Движения.ВКД_ПоступлениеСписаниеДС.Очистить();
	Движение = Движения.ВКД_ПоступлениеСписаниеДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Документ = Ссылка;
	Движение.Контрагент = Контрагент;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр РасходыДоходы 
	Если НЕ НеУчитыватьВРасходы Тогда
	Движения.РасходыДоходы.Записывать = Истина;
	Движения.РасходыДоходы.Очистить();
	Движение = Движения.РасходыДоходы.Добавить();
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Вид = ВидДвижения;
	Движение.Статья = Статья;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
    КонецЕсли;
	КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры




