&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры    

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаWebHookПодч.Доступность = Объект.WebhookАктивен;
	
КонецПроцедуры
		  

&НаКлиенте
Процедура СгенерироватьТокен(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияГенерации", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Токен уже существует. Сгенерировать новый? Доступ по старому токену будет закрыт.", РежимДиалогаВопрос.ДаНет);
	Иначе
		Объект.ТокенАвторизации = StockAPI_Утилиты.СгенерироватьТокенSHA256();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияГенерации(Результат, Параметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТокенАвторизации = StockAPI_Утилиты.СгенерироватьТокенSHA256();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура WebhookАктивенПриИзменении(Элемент)
	
	Если Объект.WebhookАктивен и Не ЗначениеЗаполнено(Объект.WebhookURL) Тогда
		Объект.WebhookАктивен = ложь;
		Сообщить("Не заполнен URL");
	КонецЕсли;                  
	
	УстановитьВидимостьДоступность();  
	
КонецПроцедуры

