#Область ДействияФормы        

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// © Primus1C  07.10.2023  НАЧАЛО ►
	Если Объект.ВКД_НеСоздаватьПриходную Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда Сообщить(НСтр("ru = 'Копирование приходных накладных запрещено!'; en = 'Incoming waybills copying is prohibited!'")); Отказ = Истина; Возврат; КонецЕсли; 
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	ЧислоЗнаковКоличество = Объект.Фирма.ЧислоЗнаковКоличество;
	ЧислоЗнаковЦенаЗакупки = Объект.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	Элементы.ТоварыКоличество.Формат = "ЧДЦ=" + ЧислоЗнаковКоличество;
	Элементы.ТоварыЦенаЗакупки.Формат = "ЧДЦ=" + ЧислоЗнаковЦенаЗакупки;
	Элементы.ТоварыНоменклатураРодитель.Видимость = Объект.Фирма.ВыводитьГруппа;
	Элементы.ТоварыНоменклатураПроизводитель.Видимость = Объект.Фирма.ВыводитьПроизводитель;
	Элементы.ТоварыСерия.Видимость = Объект.Фирма.ВыводитьСерия;
	Элементы.ТоварыПартияСрокГодности.Видимость = Объект.Фирма.ВыводитьСрокГодности;
	
	//Элементы.ТоварыУдалитьВсе.Видимость = гоАдминистратор();
	//2016.10.21
	//ХОТЯТ ВСЕМ
	
	Попытка
		Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	Исключение
	КонецПопытки; 
	
	//2017.02.05
	ДобавлениеСерийВПриходеВТранзакцииНаСервере = Объект.Фирма.ДобавлениеСерийВПриходеВТранзакцииНаСервере;
	
	//2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда
	//Если Мас.Найти(Объект.Склад) = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;
	
	//ВКД++
	ВКД_УстановитьВидимостьПолей();
	//ВКД--  
	
	// © Primus1C  25.07.2023  НАЧАЛО ►   
	ЗаполнитьКэшДанных();
	
	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	//глПокраситьУслуги(ЭтаФорма, "Товары");
	
	Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда // ввод на основании
		НеоприходованныеТоварыИнвойса = Документы.ПриходнаяНакладная.НеоприходованныеТоварыИнвойса(Объект.ВКД_Инвойс, Объект.Поставка);
	КонецЕсли;	
	//Элементы.Поставка.Видимость = Объект.Поставка > 0;
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  
	
	//ОбщегоНазначенияСервер.ПроверитьВозможностьРедактированияПоДатеДокумента(Объект, ЭтаФорма);  

	//глПокраситьУслуги(ЭтаФорма, "Товары");
	
	Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) И НЕ ОбщегоНазначенияПовтИсп.ДоступныЦеныЗакупки() Тогда
		//Элементы.ВКД_Инвойс.Доступность 			= Ложь;
		Элементы.ТоварыЦенаЗакупки.Видимость 		= Ложь;
		Элементы.ТоварыСуммаЗакупки.Видимость 		= Ложь;
		Элементы.ТоварыВКД_ЦенаСоСкидкой.Видимость 	= Ложь;
		Элементы.ТоварыВКД_СуммаСоСкидкой.Видимость = Ложь;
		Элементы.ТоварыВКД_ЦенаСЗатратами.Видимость = Ложь;
		Элементы.ТоварыВКД_СуммаСЗатратами.Видимость= Ложь;
		Элементы.ГрЗатраты.ТолькоПросмотр 			= Истина;
	КонецЕсли; 
	
	СтруктураПечатныхФорм = Документы.ПриходнаяНакладная.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   
	
	Если Объект.Проведен Тогда
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ОстаткиТовара.Партия КАК Партия
		             |ИЗ
		             |	РегистрНакопления.ОстаткиТовара КАК ОстаткиТовара
		             |ГДЕ
		             |	ОстаткиТовара.Период > &Период
		             |	И ОстаткиТовара.Партия В(&Партии)
		             |	И ОстаткиТовара.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)";
		Запр.УстановитьПараметр("Период", Объект.Дата);
		Запр.УстановитьПараметр("Партии", Объект.Товары.Выгрузить(,"Партия").ВыгрузитьКолонку(0));
	    Выборка = Запр.Выполнить().Выбрать();
	    Пока Выборка.Следующий() Цикл
			ПартииИмеющиеДвижения.Добавить(Выборка.Партия);
		КонецЦикла;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	//Если НЕ клФормаДокументаПриОткрытии(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли; 
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	ТолПро = ЭтаФорма.ТолькоПросмотр; 
	
	ЕстьОплата = Ложь;
	//2016.08.26
	//этоЧужой = Ложь;
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		ЕстьОплата = омСервер.ЕстьОплатаДокумента(Объект.Ссылка); 
		//2016.08.26
		//этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный ИЛИ ЕстьОплата ИЛИ (Объект.СуммаПривязано <> 0) 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	УстановитьВидимостьДоступность();
	МоиИтоги();
	
	Если Объект.ВКД_НеСоздаватьПриходную Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
  	// © Primus1C  24.07.2023  НАЧАЛО ►  
	
	ОтобразитьЦветВалюты();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ВКД_Инвойс) И Объект.ВариантРаспределения = -1 Тогда // новый, введен на основании инвойса, требует заполнения
		ЗаполнитьПоИнвойсуНаКлиенте();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) И НЕ ТолПро Тогда 
		лКвоПоставокИнвойса = ПоставкиИнвойса(Объект.ВКД_Инвойс).Количество(); 
		ТекстВопроса = "";
		Если лКвоПоставокИнвойса = 0 И Объект.Поставка > 0 Тогда
			ТекстВопроса = стрШаблон("Номер поставки текущей накладной: %1. Но инвойс не разделен на поставки. Сбросить номер поставки в накадной?", Объект.Поставка);
			ПараметрыВопроса = Новый Структура("Действие", "Сброс");
		ИначеЕсли лКвоПоставокИнвойса > 0 И Объект.Поставка = 0 Тогда  
		    ТекстВопроса = "Инвойс разделен на поставки. Но в текущей накладной номер поставки не указан. Установить номер поставки в накладной?";
			ПараметрыВопроса = Новый Структура("Действие,КоличествоПоставок", "Выбор", лКвоПоставокИнвойса);
		ИначеЕсли лКвоПоставокИнвойса > 0 И Объект.Поставка > лКвоПоставокИнвойса Тогда  
		    ТекстВопроса = стрШаблон("Инвойс разделен на %1 поставок. Но в текущей накладной указана поставка %2. Изменить номер поставки в накладной?", лКвоПоставокИнвойса, Объект.Поставка);
			ПараметрыВопроса = Новый Структура("Действие,КоличествоПоставок", "Выбор", лКвоПоставокИнвойса);
		КонецЕсли;   
		Если ТекстВопроса <> "" Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоставки", ЭтотОбъект, ПараметрыВопроса);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, , "Некорректная поставка");
		КонецЕсли;
	КонецЕсли;
	
	ОтобразитьПоказателиЗатрат();  
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги(); 
	// © Primus1C  25.07.2023  НАЧАЛО ►
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

#КонецОбласти         


// © Primus1C  17.10.2023  НАЧАЛО ►

&НаСервере
Процедура ОтобразитьПоказателиЗатрат()

	Для каждого СтрокаТЧ Из Объект.Затраты Цикл
		СтрокаТЧ.СтатусПроведения = ОбщегоНазначенияСервер.СтатусПроведения(СтрокаТЧ.ДокументЗатрат);
	КонецЦикла;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция РольПриходование()

	Возврат РольДоступна("ПриходованиеВводомНаОсновании");	

КонецФункции 

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если РольПриходование() Тогда
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;                      
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПоставкиИнвойса(Инвойс)
	
	Список = Новый СписокЗначений;
	запр = Новый Запрос;  
	запр.УстановитьПараметр("Ссылка", Инвойс);
	запр.Текст = "ВЫБРАТЬ
	             |	СУММА(_ИнвойсПоставки.Количество) КАК Количество,
	             |	_ИнвойсПоставки.Поставка КАК Поставка
	             |ИЗ
	             |	Документ._Инвойс.Поставки КАК _ИнвойсПоставки
	             |ГДЕ
	             |	_ИнвойсПоставки.Ссылка = &Ссылка
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	_ИнвойсПоставки.Поставка"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Поставка, 
						СтрШаблон("     Поставка %1 ( %2 шт. )     ", Выборка.Поставка, Выборка.Количество), ,
						БиблиотекаКартинок.Доставка);
	КонецЦикла;
	Возврат Список;

КонецФункции 

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоставки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        Если Параметры.Действие = "Сброс" Тогда
			Объект.Поставка = 0;	
			клНамекнуть("Поставка", "Номер поставки сброшен", БиблиотекаКартинок.ДиалогИнформация);
		    Модифицированность = Истина; 
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораПоставки", ЭтотОбъект, Новый Структура());
			ПоказатьВыборИзСписка(Оповещение, ПоставкиИнвойса(Объект.ВКД_Инвойс), Элементы.Поставка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПоставки(Результат, Параметры) Экспорт

	Если Результат <> Неопределено Тогда
		Если ТолькоПросмотр Тогда 
			УстановитьНомерПоставкиБезусловно(Результат.Значение); 
			доп = "(Чтобы обновить отображение, откройте документ заново)";
		Иначе
			Объект.Поставка = Результат.Значение;  
			Модифицированность = Истина;    
			доп = "";
		КонецЕсли;
		клНамекнуть("Поставка приходной накладной", 
					СтрШаблон("Установлен номер поставки: %1.
					  		  |%2", Результат.Значение, доп), 
					БиблиотекаКартинок.ДиалогИнформация); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНомерПоставкиБезусловно(П)
	
	УстановитьПривилегированныйРежим(Истина);
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокОбъект.Поставка = П;
	ДокОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИнвойсуНаКлиенте()

	// НеоприходованныеТоварыИнвойса уже рассчитаны
	
	Если НеоприходованныеТоварыИнвойса.КоличествоНеоприходованныхПоставок = 0 Тогда
		клПредупреждение(НСтр("ru = 'Все поставки инвойса оприходованы!'; en = 'All invoice deliveries have been capitalized!'"), , 
						НСтр("ru = 'Ввод приходной накладной на основании инвойса'; en = 'Creating incoming waybill based on an invoice'"));
		Возврат;
	ИначеЕсли НеоприходованныеТоварыИнвойса.КоличествоНеоприходованныхПоставок = 1 Тогда
		ВыбПоставка = НеоприходованныеТоварыИнвойса.НомерНеоприходованнойПоставки; 
		Объект.ВариантРаспределения = 0;
		Объект.Поставка = ВыбПоставка;	
		ЗаполнитьПоПоставке();
	Иначе                      
		спис = Новый СписокЗначений; 
		Для каждого Пост Из НеоприходованныеТоварыИнвойса.Поставки Цикл
			спис.Добавить(Пост.НомерПоставки,
			СтрШаблон(НСтр("ru = 'Поставка %1: не оприходовано %2 из %3 шт.'; en = 'Delivery %1: not capitalized %2 of %3'"), Пост.НомерПоставки, Пост.Количество, Пост.КоличествоИсх), ,
			?(Пост.Количество=0, БиблиотекаКартинок.ДоставкаНеактивна, БиблиотекаКартинок.Доставка));
		КонецЦикла;
		клВариантСписка(Новый ОписаниеОповещения("ЗаполнитьПоИнвойсуНаКлиентеЗавершение", ЭтотОбъект), НСтр("ru = 'Выберите поставку'; en = 'Select delivery'"), спис);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИнвойсуНаКлиентеЗавершение(ВыбПоставка, ДопПараметры) Экспорт
	Если ВыбПоставка <> Неопределено Тогда
		Объект.ВариантРаспределения = 0;
		Объект.Поставка = ВыбПоставка;	
		ЗаполнитьПоПоставке();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшДанных()
	
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", 	ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", 			ОбщегоНазначенияПовтИсп.ЦветаВалют()); 
	 
	 Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда
		 КэшДанных.Вставить("ЗатратыОтправки", Документы.ПриходнаяНакладная.ЗатратыОтправки(Объект.ВКД_Инвойс, Объект.Поставка));
 	 КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄


&НаКлиенте
Процедура МоиИтоги()
	// © Primus1C  02.12.2023  НАЧАЛО ►
	//стрИтого = "";
	//стрОплата = "";
	//омСервер.МоиИтоги(Объект, стрИтого, стрОплата);
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "?";
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда 
		Элементы.ДекорацияИнфоСтроки.Заголовок = "";
		Возврат; 
	КонецЕсли; 
	стрОстатки = омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, Стр.Партия);   
	// © Primus1C  04.10.2025  НАЧАЛО ►
	Если Элементы.Товары.ТекущаяСтрока <> Неопределено Тогда
		Ит = 0;
		НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		Для каждого НайдСтрока Из НайдСтроки Цикл
			Ит = Ит + НайдСтрока.Количество;
		КонецЦикла;
		Если Ит > 0 Тогда
			//Элементы.ДекорацияИнфоСтроки.Заголовок = СтрШаблон("%1: %2", 
			//													НСтр("ru = 'Количество товара текущей строки'; en = 'Quantity of the current line good'"),
			//													Ит);
			Стр = СтрШаблон("%1: %2", 
							НСтр("ru = 'Количество товара текущей строки'; en = 'Quantity of the current line good'"),
							омСервер.Фрмт(Ит, "ЧИСЛОЦЕЛ_ЦВ1"));
			Элементы.ДекорацияИнфоСтроки.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(Стр));				
		Иначе
		КонецЕсли;	
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина, ЗаписатьБезусловно = Ложь)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	//ВКД++
	Если Не ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда  
		Если ЗаписатьБезусловно Тогда
			омСервер.УстановитьПараметрСеанса("БезусловноеПроведениеДокументов", Истина);
		КонецЕсли;
		Записать(РежимЗаписиПроведение);
		Если ЗаписатьБезусловно Тогда
			омСервер.УстановитьПараметрСеанса("БезусловноеПроведениеДокументов", Ложь);
		КонецЕсли;
	КонецЕсли;
	//ВКД--

	МоиОстатки();
	МоиИтоги();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность() 
	
	// © Primus1C  01.02.2024  НАЧАЛО ►
	Если ТолькоПросмотр Тогда
		Элементы.Установить.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	НетСтрок = Объект.Товары.Количество() = 0;
	ЕстьСтроки = НЕ НетСтрок;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	//2015.12.08 попробуем только по закрыто
	Элементы.Дата.ТолькоПросмотр = Закрыто;		//Объект.Проведен ИЛИ 
	Элементы.Склад.ТолькоПросмотр = Закрыто;
	
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	//2016.10.22
	Элементы.ИзменитьВалюту.Видимость = ЕстьСтроки И НеЗакрыто;
	
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;
	
	//2015.12.12
	Элементы.Контрагент.ТолькоПросмотр = Закрыто;
	
	//2016.01.30
	Если гоАдминистратор() Тогда 
		Элементы.ТоварУжеОплачен.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Иначе 
		Элементы.ТоварУжеОплачен.ТолькоПросмотр = Закрыто;
	КонецЕсли;
	
	//ВКД++
	Элементы.ВКД_Инвойс.ТолькоПросмотр = Закрыто;
	Элементы.ВКД_ДокументЗатрат.ТолькоПросмотр = Закрыто;
	Элементы.ВКД_Скидка.ТолькоПросмотр = Закрыто;
	Элементы.ВариантРаспределения.ТолькоПросмотр = Закрыто;
	Элементы.РассчитатьЗатраты.Доступность = Не Закрыто; 
	Элементы.Затраты.ТолькоПросмотр = Закрыто;  
	
	Элементы.Товары.ТолькоПросмотр = Закрыто; 
	Элементы.ТоварыУдалитьВыделенные.Видимость = НЕ Закрыто;
	Элементы.ТоварыУдалитьВсе.Видимость = НЕ Закрыто;
	//ВКД--
	
	//2016.01.31
	Если гоАдминистратор() Тогда 
		Элементы.Консигнация.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	Иначе 
		Элементы.Консигнация.ТолькоПросмотр = Закрыто;
	КонецЕсли;  
	
КонецПроцедуры


// © Primus1C  08.05.2024  НАЧАЛО ►

&НаСервере
Процедура ЗаменаАдминНаСервере(Было, Стало)
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл 
		Если СтрокаТЧ.Номенклатура = Было Тогда
			Если ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда  
				СтрокаТЧ.Номенклатура = Стало;	
				ОбП = СтрокаТЧ.Партия.ПолучитьОбъект();	
				ОбП.Владелец = Стало;
				ОбП.Записать();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;                          
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаАдмин(Команда)

	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	лНоменклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	клВопрос(Новый ОписаниеОповещения("ЗаменаАдминПослеВопроса", ЭтотОбъект, лНоменклатура),
		СтрШаблон(НСтр("ru = 'Во всей табличной части номенклатура %1 будет заменена! Продолжить?'; en = 'The good %1  will be replaced in the entire table part! Continue?'"), лНоменклатура));

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаАдминПослеВопроса(Результат, лНоменклатура) Экспорт
	Если НЕ Результат Тогда
		Прочитать();
		Возврат;
	КонецЕсли;
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ЗаменаАдминПослеВводаЗначения", ЭтотОбъект, лНоменклатура),
		Неопределено, НСтр("ru = 'Выберите номенклатуру для замены '; en = 'Select good for exchange '") + лНоменклатура, Тип("СправочникСсылка.Номенклатура"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаАдминПослеВводаЗначения(ВыбНоменклатура, лНоменклатура) Экспорт
	Если ВыбНоменклатура <> Неопределено Тогда
		ЗаменаАдминНаСервере(Элементы.Товары.ТекущиеДанные.Номенклатура, ВыбНоменклатура);
		//Модифицированность = Истина;
	КонецЕсли;
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПоставке()
	
	Для каждого Пост Из НеоприходованныеТоварыИнвойса.Поставки Цикл
		Если Пост.НомерПоставки = Объект.Поставка Тогда
			Для каждого Стр Из Пост.Товары Цикл
				Для Ном = 1 По Стр.Количество Цикл
					НовСтрока = Объект.Товары.Добавить();	
					НовСтрока.Номенклатура 	= Стр.Номенклатура;	
					НовСтрока.Количество 	= 1;
					НовСтрока.ЦенаЗакупки 	= Стр.СуммаЗакупки / Стр.Количество;
					НовСтрока.СуммаЗакупки 	= НовСтрока.ЦенаЗакупки;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	Если Объект.Поставка = 0 Тогда 
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Заполнено товарами инвойса № %1'; en = 'Filled with invoice № %1 goods'"), Объект.ВКД_ИнвойсПоставщика); 
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Заполнено товарами поставки № %1'; en = 'Filled with delivery № %1 goods'"), Объект.Поставка);
	КонецЕсли; 
	//клПредупреждение(ТекстСообщения, , "Ввод приходной накладной на основании инвойса");
	Сообщить(ТекстСообщения);   
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ТекстСообщения;
		//Сообщение.Поле = "Объект.Поставка";
		//Сообщение.Сообщить();
	//Элементы.Поставка.Видимость = Объект.Поставка > 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвободныеПоставкиИнвойса(Инвойс)
	
	СписокПоставок = Новый СписокЗначений;

	//// если по инвойсу были прих.накладные, распределение по поставкам невозможно
	//ЗапрПН = Новый Запрос; 
	//ЗапрПН.УстановитьПараметр("Инвойс", Инвойс);
	//ЗапрПН.Текст = "ВЫБРАТЬ
	//               |	Оприходование.Регистратор
	//               |ИЗ
	//               |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК Оприходование
	//               |ГДЕ
	//               |	Оприходование.Регистратор ССЫЛКА Документ.ПриходнаяНакладная
	//               |	И Оприходование.Документ = &Инвойс"; 
	//ВыборкаПН = ЗапрПН.Выполнить().Выбрать();
	//Если ВыборкаПН.Следующий() Тогда
	//	Возврат СписокПоставок;
	//КонецЕсли;
	

	СписокПоставок.Добавить(-1, НСтр("ru = 'Все товары текущего инвойса, отсутствующие в приходных накладных'; en = 'All goods on the current invoice that are not included in incoming waybills'")); 
	
	// получим поставки инвойса
	ЗапрПоставки = Новый Запрос;
	ЗапрПоставки.УстановитьПараметр("Инвойс", Инвойс);
	ЗапрПоставки.Текст = "ВЫБРАТЬ
	                     |	ИнвойсПоставки.Поставка КАК Поставка,
	                     |	СУММА(ИнвойсПоставки.Количество) КАК Количество,
	                     |	СУММА(ИнвойсПоставки.Сумма) КАК Сумма
	                     |ИЗ
	                     |	Документ._Инвойс.Поставки КАК ИнвойсПоставки
	                     |ГДЕ
	                     |	ИнвойсПоставки.Ссылка = &Инвойс
	                     |	И ИнвойсПоставки.Поставка > 0
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ИнвойсПоставки.Поставка
	                     |
	                     |УПОРЯДОЧИТЬ ПО
	                     |	Поставка"; 
	ВыборкаПоставки = ЗапрПоставки.Выполнить().Выбрать();
	Пока ВыборкаПоставки.Следующий() Цикл                       
		СписокПоставок.Добавить(ВыборкаПоставки.Поставка, СтрШаблон(НСтр("ru = 'Поставка %1: кол-во %2 шт., сумма %3'; en = 'Delivery %1: quant. %2 pc., sum %3'"), 
																	ВыборкаПоставки.Поставка, 
																	ВыборкаПоставки.Количество, 
																	Формат(ВыборкаПоставки.Сумма,"ЧДЦ=2")));
	КонецЦикла;
	
	Возврат СписокПоставок;
	
КонецФункции 

&НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
		Элементы.Валюта1.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнвойс(Команда)

	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Документ._Инвойс.ФормаВыбора",ПараметрыФормы,ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.ВКД_Инвойс = ВыбранноеЗначение;
	    ЗаполнитьРеквизитыШапкиИнвойса();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыШапкиИнвойса()

	Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда
		Объект.ВКД_ИнвойсПоставщика			= Объект.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика;	
		Объект.ВКД_ДатаИнвойсаПоставщика	= Объект.ВКД_Инвойс.ВКД_ДатаИнвойсаПоставщика;
	Иначе
		Объект.ВКД_ИнвойсПоставщика			= "";	
		Объект.ВКД_ДатаИнвойсаПоставщика	= Дата(1, 1, 1);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитыИнвойса(Команда) 
	
	ЗаполнитьРеквизитыШапкиИнвойса(); 
	Модифицированность = Истина;  
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатратыОтправки(СтрокаТЧ = Неопределено)
	
	Если НЕ КэшДанных.Свойство("ЗатратыОтправки") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТЧ = Неопределено Тогда
		Для каждого СтрокаТ Из Объект.Товары Цикл
			лЗатратаОтправки = КэшДанных.ЗатратыОтправки.Получить(СтрокаТ.Номенклатура); 
			Если лЗатратаОтправки <> Неопределено Тогда
				СтрокаТ.ВКД_ЦенаСЗатратами = СтрокаТ.ЦенаЗакупки + лЗатратаОтправки;
			КонецЕсли;
		КонецЦикла;
	Иначе
		лЗатратаОтправки = КэшДанных.ЗатратыОтправки.Получить(СтрокаТЧ.Номенклатура); 
		Если лЗатратаОтправки <> Неопределено Тогда
			СтрокаТЧ.ВКД_ЦенаСЗатратами = СтрокаТЧ.ЦенаЗакупки + лЗатратаОтправки;
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры


#Область ПодкдючаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		клОшибка(НСтр("ru = 'Документ еще не записан!'; en = 'The document is not saved yet!'"), , НСтр("ru = 'Печать'; en = 'Print'"));	
		Возврат;
	КонецЕсли;
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.ПриходнаяНакладная.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄


#Область СобытияТаблЧастиТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	МоиОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	//ВКД++	
	//МоеДобавление();
	Если Не ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда 
		МоеДобавление();
	КонецЕсли;                                         
	//ВКД--
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// © Primus1C  26.01.2025  НАЧАЛО ►
	Если омСервер.ЕстьРоль("Разработка") Тогда
	//	Возврат;	
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Отказ = Истина;
	МоеРедактирование(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Товары", "")); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// © Primus1C  13.05.2026  НАЧАЛО ►
	// заменен код Ви-Кода
	//Если НЕ ТолькоПросмотр Тогда
	//	СканированиеШтрихкода();
	//КонецЕсли;
	Если ТолькоПросмотр ИЛИ Объект.Окончательно Тогда 
		Возврат;	
	КонецЕсли; 
	Если Поле.Имя = "ТоварыСерия" Тогда
		СканированиеШтрихкода();
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)  
	
	// © Primus1C  14.06.2025  НАЧАЛО ►
	Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) И Объект.Проведен Тогда
		//Если ЗначениеЗаполнено() Тогда
		//
		//	
		//
		//КонецЕсли;	
	КонецЕсли;	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//ВКД++
	Отказ = Истина;
	ОчиститьКолонкуЗатрат();//****************
	МоеУдаление();
	//Если ЗначениеЗаполнено(Объект.ВКД_Инвойс)И Объект.Проведен Тогда
	//	Отказ = Истина;
	//	Предупреждение("Документ проведен! Для удаления строки отмените проведение!",10,"Внимание!");
	//	МоеУдаление();
	//Иначе
	//	Отказ = Истина;
	//	МоеУдаление();
	//КонецЕсли;
	//Модифицированность = Истина;
	//ВКД--
	
КонецПроцедуры

#КонецОбласти


&НаСервереБезКонтекста
Функция СоздатьПартию(Ссылка, НовНом, НовЦен, НовСер = "", Валюта, Дата, Фирма) 
	
	Спр = Справочники.Партии.СоздатьЭлемент();
	
	Спр.Владелец = НовНом;
	Спр.Док = Ссылка;
	Спр.Наименование = "ПН_" + Лев(гоМгновение(Дата), 8);
	Спр.Контрагент = Ссылка.Контрагент;
	Спр.ЦенаЗакупки = НовЦен;
	Спр.Валюта = Валюта;
	Спр.ДатаПартии = Дата;
	Спр.Фирма = Фирма;
	Спр.Серия = НовСер;
	Спр.ЦенаЗакупкиВБазВалюте = РаботаСВалютой.Пересчитать2025(Спр.ЦенаЗакупки, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата);
	Спр.Записать();
	
	Возврат Спр.Ссылка; 
	
КонецФункции

&НаКлиенте
Процедура ИзменитьВалюту(Команда) 
	
//2016.10.22
//у нас так сделано, что при записи документа валюта во всех партиях обновляется сама

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли;
	
	НовВал = Объект.Валюта;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ИзменитьВалютуПослеВыбора", ЭтотОбъект), НовВал, НСтр("ru = 'Выберите новую валюту:'; en = 'Select new currency:'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВалютуПослеВыбора(НовВал, ДопПараметры) Экспорт
	Если НовВал = Неопределено Тогда Возврат КонецЕсли;
	Если НовВал = Объект.Валюта Тогда Возврат КонецЕсли;
	клНетДа(Новый ОписаниеОповещения("ИзменитьВалютуЗавершение", ЭтотОбъект, НовВал),
		НСтр("ru = 'Изменить валюту документа и каждой партии (цены пересчитываться не будут)?'; en = 'Change the currency of the document and each batch (prices will not be recalculated)?'"));
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВалютуЗавершение(Результат, НовВал) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Валюта = НовВал;
	МояЗаписать(Ложь);  
	
	// © Primus1C  27.12.2023  НАЧАЛО ►
	ОтобразитьЦветВалюты();
	// © Primus1C  ОКОНЧАНИЕ ◄   
	
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавление()   
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Попытка
		НовНом = Элементы.Товары.ТекущиеДанные.Номенклатура;
		НовПар = Элементы.Товары.ТекущиеДанные.Партия;
	Исключение 
		НовНом = гоПустой("Номенклатура");
		НовПар = гоПустой("Партии");
	КонецПопытки;
	
	МоеДобавлениеШаг(НовНом);
	
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеШаг(НовНом)
	//вроде бы пока и так работает
	//гоУстановитьПараметрСеанса("СтатьНа", НовНом);
	//а вот склад нужно передать обязательно
	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораНоменклатуры", ЭтотОбъект), НовНом, НСтр("ru = 'Выберите номенклатуру'; en = 'Select good'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораНоменклатуры(НовНом, ДопПараметры) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	
	УчетТовараПоСериям = гоРеквизит(НовНом, "УчетПоСериям");    
	Если НЕ УчетТовараПоСериям Тогда  
		Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если НЕ (Нашли.Количество() = 0) Тогда 
			//клВнимание(гоИмя(НовНом) + ": уже есть в документе!" + гоРС() + "Возможно, нужно просто отредактировать количество!!!") 
			клВнимание(СтрШаблон("%1: %2!
								|%3!!!", 
								гоИмя(НовНом), 
								НСтр("ru = 'уже есть в документе'; en = 'already is in the document'"),
								НСтр("ru = 'Возможно, нужно просто отредактировать количество'; en = 'Perhaps you just need to edit the quantity'")));
		КонецЕсли;
	КонецЕсли; 
	
	НовЦен = 0;
		 
	Пар = Новый Структура;
	Пар.Вставить("Фирма", Объект.Фирма);
	Пар.Вставить("Номенклатура", НовНом);
	Пар.Вставить("Валюта", Объект.Валюта);
	Пар.Вставить("Количество", 0);
	Пар.Вставить("Цена", НовЦен);
	Пар.Вставить("Док", Объект.Ссылка);
	Пар.Вставить("Контрагент", Объект.Контрагент);
	Пар.Вставить("Склад", Объект.Склад);
	Пар.Вставить("Партия", 0);
	Пар.Вставить("ДатаДок", Объект.Дата);
	
	ОткрытьФорму("ОбщаяФорма.ВводСтрокиПН", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоеДобавлениеПослеВводаСтроки", ЭтотОбъект, Новый Структура("НовНом,УчетТовараПоСериям", НовНом, УчетТовараПоСериям)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВводаСтроки(НовПар, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	УчетТовараПоСериям = Параметры.УчетТовараПоСериям;
	
	Если гоПЗ(НовПар) Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	НовЦен = НовПар.Цена;
	//2016.01.30
	//разрешаем нулевую цену
	//Если НовЦен = 0 Тогда клОшибка("Не введена цена закупки!"); Продолжить; КонецЕсли;
	
	НовКол = НовПар.Количество;
	Если НовКол = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity is not specified!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	клСохранитьИзменения(Новый ОписаниеОповещения("МоеДобавлениеПослеПодтверждения", ЭтотОбъект, 
		Новый Структура("НовНом,НовПар,НовЦен,НовКол,УчетТовараПоСериям", НовНом, НовПар, НовЦен, НовКол, УчетТовараПоСериям)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеПодтверждения(Результат, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	НовЦен = Параметры.НовЦен;
	НовКол = Параметры.НовКол;
	УчетТовараПоСериям = Параметры.УчетТовараПоСериям;
	
	Если НЕ Результат Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	Если УчетТовараПоСериям Тогда
		Серии = СокрЛП(НовПар.Серии);
		Если Серии = "" Тогда Возврат КонецЕсли;
		
		//2017.02.05
		Если ДобавлениеСерийВПриходеВТранзакцииНаСервере Тогда 
			ИДИ = 0;
			ДобавитьСерии(Серии, ИДИ, НовНом, НовЦен);
		Иначе 
			Для Н = 1 По СтрЧислоСтрок(Серии) Цикл
				НовСер = СокрЛП(СтрПолучитьСтроку(Серии, Н));
				Если НовСер = "" Тогда Продолжить КонецЕсли; 
				
				Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Серия", НовСер));
				Если НЕ (Нашли.Количество() = 0) Тогда 
					клВнимание(гоИмя(НовСер) + ": уже есть в документе!" + гоРС() + "Значение пропускается!!!"); 
					Продолжить; 
				КонецЕсли;
				
				НовПар = СоздатьПартию(Объект.Ссылка, НовНом, НовЦен, НовСер, Объект.Валюта, Объект.Дата, Объект.Фирма);
				
				НовСтр = Объект.Товары.Добавить();
				
				НовСтр.Номенклатура = НовНом;
				НовСтр.Партия = НовПар;
				НовСтр.Количество = 1;
				
				ИДИ = НовСтр.ПолучитьИдентификатор();
			КонецЦикла; 
		КонецЕсли; 
	Иначе 
		НовПар = СоздатьПартию(Объект.Ссылка, НовНом, НовЦен, , Объект.Валюта, Объект.Дата, Объект.Фирма);
		
		НовСтр = Объект.Товары.Добавить();
		
		НовСтр.Номенклатура = НовНом;
		НовСтр.Партия = НовПар;
		НовСтр.Количество = НовКол;
		
		ИДИ = НовСтр.ПолучитьИдентификатор();
	КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	МоеДобавлениеШаг(НовНом);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСерии(Серии, ИДИ, НовНом, НовЦен)
	
	НачатьТранзакцию();
	
	Для Н = 1 По СтрЧислоСтрок(Серии) Цикл
		НовСер = СокрЛП(СтрПолучитьСтроку(Серии, Н));
		Если НовСер = "" Тогда Продолжить КонецЕсли; 
		
		Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Серия", НовСер));
		Если НЕ (Нашли.Количество() = 0) Тогда 
			Сообщить(СтрШаблон("%1: %2!%3%4!!!", гоИмя(НовСер), НСтр("ru = 'уже есть в документе'; en = 'is already in the document'"), гоРС(), НСтр("ru = 'Значение пропускается'; en = 'Value is omitted'"))); 
			Продолжить; 
		КонецЕсли;
		
		НовПар = СоздатьПартию(Объект.Ссылка, НовНом, НовЦен, НовСер, Объект.Валюта, Объект.Дата, Объект.Фирма);
		
		НовСтр = Объект.Товары.Добавить();
		
		НовСтр.Номенклатура = НовНом;
		НовСтр.Партия = НовПар;
		НовСтр.Количество = 1;
		НовСтр.ЦенаЗакупки = НовЦен;
		ИДИ = НовСтр.ПолучитьИдентификатор();
	КонецЦикла;
	
	Записать(РежимЗаписиПроведение);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЦеныПартииСервер(НовПар, НовЦен, Вариант = "ЦенаЗакупки")
    Спр = НовПар.ПолучитьОбъект();
	
	Если Вариант = "ЦенаЗакупки" Тогда
		Спр.ЦенаЗакупки = НовЦен;
	КонецЕсли; 
	
	Спр.Записать();
КонецПроцедуры 

&НаКлиенте
Функция ЕстьЕще(ТекИДИ, ТекНом)
//2016.04.07
	
	Рез = Новый Массив;
	
	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекНом));
	Если НЕ (Нашли.Количество() = 0) Тогда
		Для Каждого Стр Из Нашли Цикл
			Если Стр.ПолучитьИдентификатор() = ТекИДИ Тогда Продолжить КонецЕсли;
			Рез.Добавить(Стр);
		КонецЦикла; 
	КонецЕсли;

	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура МоеРедактирование(Кол)    
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//2016.02.22
	//ну мы тут слишком жестко, почему нельзя редактировать даже после окончательно?
	//а вот менеджерам не нужно
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно И гоМенеджер() Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	
	Партия = Стр.Партия;
	Нельзя = НельзяРедактироватьЦену(Партия);
	
	Если гоЭто("ЦенаЗакупки", Кол) Тогда
		//2016.04.14
		//у нас массовое изменение возможно, поэтому проверяем тут окончательно, а не есть движения одной партии или нет
		//Если Нельзя Тогда 
		Если Объект.Окончательно Тогда 
			//2016.02.22
			Если гоМонопольныйРежим() Тогда
				клНетДа(Новый ОписаниеОповещения("МоеРедактированиеПослеВопросаПроведения", ЭтотОбъект, Новый Структура("Кол,ИДИ,Нельзя", Кол, ИДИ, Нельзя)),
					НСтр("ru = 'Внимание! Документ закрыт {Окончательно}! Будем редактировать цену закупки и проводить связанные документы? ВСЕ ЛИШНИЕ ОКНА ДОЛЖНЫ БЫТЬ ЗАКРЫТЫ!'; en = 'Attention! The document is closed <Finally>! Will You edit the purchase price and post related documents? ALL EXTRA WINDOWS MUST BE CLOSED!'"));
				Возврат;
			Иначе 
				//2016.04.14
				//клОшибка("Внимание! Есть движения партии, редактирование цены запрещено! Нужен МОНОПОЛЬНЫЙ РЕЖИМ!"); 
				клОшибка(НСтр("ru = 'Внимание! Документ закрыт {Окончательно}, редактирование цены закупки запрещено! Нужен МОНОПОЛЬНЫЙ РЕЖИМ!'; en = 'Attention! The document is closed <Finaly>, editing the purchase price is prohibited! You need a MONOPOLY MODE!'")); 
				Возврат; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	МоеРедактированиеШагВвода(Кол, ИДИ, Нельзя, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВопросаПроведения(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли; 
	МоеРедактированиеШагВвода(Параметры.Кол, Параметры.ИДИ, Параметры.Нельзя, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеШагВвода(Кол, ИДИ, Нельзя, БудемПроводить)
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	Партия = Стр.Партия;
	
	Если Кол = "ЦенаЗакупки" Тогда
		Цена = гоРеквизит(Партия, Кол);	
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаЦены", ЭтотОбъект, Новый Структура("ИДИ,Кол,БудемПроводить,Было", ИДИ, Кол, БудемПроводить, Цена)),
			Цена, НСтр("ru = 'Цена закупки'; en = 'Purchase price'"), 19, ЧислоЗнаковЦенаЗакупки);
	ИначеЕсли Кол = "Количество" Тогда
		УчетПоСериям = гоРеквизит(Стр.Номенклатура, "УчетПоСериям");
		Если УчетПоСериям Тогда клОшибка(НСтр("ru = 'Включен учет по сериям, просто удалите строку!'; en = 'Series accounting is enabled, just delete the line!'")); Возврат; КонецЕсли; 
		
		Если Нельзя Тогда клОшибка(НСтр("ru = 'Внимание! Есть движения партии, осторожнее с количеством!'; en = 'Attention! The batches movements are recorded, be careful with quantity!'")) КонецЕсли;
		Колв = Стр.Количество;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаКоличества", ЭтотОбъект, Новый Структура("ИДИ,Было", ИДИ, Колв)),
			Колв, НСтр("ru = 'Количество'; en = 'Quantity'"), 14, ЧислоЗнаковКоличество);
	Иначе
		МоеРедактированиеЗавершение(ИДИ, БудемПроводить, Новый СписокЗначений);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаЦены(Цена, Параметры) Экспорт
	Если Цена = Неопределено Тогда Возврат КонецЕсли; 
	Если Параметры.Было = Цена Тогда Возврат КонецЕсли; 
	
	ИДИ = Параметры.ИДИ;
	Кол = Параметры.Кол;
	БудемПроводить = Параметры.БудемПроводить;
	
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	Партия = Стр.Партия;
	
	УстановитьЦеныПартииСервер(Партия, Цена, Кол); 
	// © Primus1C  05.03.2025  НАЧАЛО ►
	Стр.ЦенаЗакупки = Цена;  
	Стр.СуммаЗакупки = Цена * Стр.Количество;
	// © Primus1C  ОКОНЧАНИЕ ◄

	//2016.04.14
	СпиПар = Новый СписокЗначений;
	СпиПар.Добавить(Партия);
	
	//2016.04.07
	//2016.04.14 + ИЛИ гоМонопольныйРежим()
	//не проверяем на окончательно, точнее, для монопольного режима нам все равно, будем перепроводить
	Если (НЕ Объект.Окончательно) ИЛИ гоМонопольныйРежим() Тогда  
		Нашли = ЕстьЕще(ИДИ, Стр.Номенклатура);
		Если НЕ (Нашли.Количество() = 0) Тогда
			клДаНет(Новый ОписаниеОповещения("МоеРедактированиеПослеВопросаОстальных", ЭтотОбъект, Новый Структура("ИДИ,Кол,Цена,БудемПроводить,СпиПар", ИДИ, Кол, Цена, БудемПроводить, СпиПар)),
				НСтр("ru = 'В документе есть еще такая же номенклатура! Проставить новую цену закупки и на нее тоже?'; en = 'The document also contains the same good! Set a new purchase price on it too?'"));
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	МоеРедактированиеЗавершение(ИДИ, БудемПроводить, СпиПар);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВопросаОстальных(Результат, Параметры) Экспорт
	ИДИ = Параметры.ИДИ;
	Кол = Параметры.Кол;
	Цена = Параметры.Цена;
	СпиПар = Параметры.СпиПар;
	
	Если Результат Тогда
		Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
		Нашли = ЕстьЕще(ИДИ, Стр.Номенклатура);
		Для Каждого Стр Из Нашли Цикл
			БылЦен = гоРеквизит(Стр.Партия, Кол);
			Если БылЦен = Цена Тогда Продолжить КонецЕсли; 
			УстановитьЦеныПартииСервер(Стр.Партия, Цена, Кол); 
			// © Primus1C  05.03.2025  НАЧАЛО ►
			Стр.ЦенаЗакупки = Цена;
			Стр.СуммаЗакупки = Цена * Стр.Количество;
			// © Primus1C  ОКОНЧАНИЕ ◄
			ОповеститьОбИзменении(Стр.Партия);
			//2016.04.14
			СпиПар.Добавить(Стр.Партия);
		КонецЦикла;
		МояЗаписать(Ложь);
	КонецЕсли;
	
	МоеРедактированиеЗавершение(ИДИ, Параметры.БудемПроводить, СпиПар);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаКоличества(Колв, Параметры) Экспорт
	Если Колв = Неопределено Тогда Возврат КонецЕсли; 
	Было = Параметры.Было;
	Если Было = Колв Тогда Возврат КонецЕсли; 
	
	ИДИ = Параметры.ИДИ;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	Если Объект.Окончательно Тогда
		Ост = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия) - Было + Колв;
		Если Ост < 0 Тогда 
			клОшибка(НСтр("ru = 'Остаток СТАНЕТ ОТРИЦАТЕЛЬНЫМ! Такое количество вводить запрещено!'; en = 'The remainder WILL BE NEGATIVE! This quantity is prohibited!'")); 
			
			Номен =	Стр.Номенклатура;
			гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колв) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Попытка исправить в минус", Номен, 2);
			гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колв) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Попытка исправить в минус", Объект.Ссылка, 2);
			
			Если НЕ гоАдминистратор() Тогда Возврат КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Стр.Количество = Колв;
	
	Колич =	Колв;
	СЦена = Стр.ЦенаЗакупки;
	Номен =	Стр.Номенклатура;
	гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Редактирование количества", Номен, 2);
	гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Редактирование количества", Объект.Ссылка, 2);
	
	МоеРедактированиеЗавершение(ИДИ, Ложь, Новый СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеЗавершение(ИДИ, БудемПроводить, СпиПар)
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	//2016.02.22
	СпиДок = 0;
	//2016.04.14 + СпиПар вместо 
	Если БудемПроводить Тогда СпиДок = гоЕстьДвиженияПартии(СпиПар, Объект.Ссылка, Истина) КонецЕсли; 
	
	ОповеститьОбИзменении(Стр.Партия);
	МояЗаписать(Ложь);
	
	//2016.02.22
	Если БудемПроводить Тогда
		Если СпиДок.Количество() <> 0 Тогда  
			РезСче = 0;
			РезСоо = "";
			гоПровестиДокументыСервер(СпиДок, РезСоо, РезСче);
			Если НЕ (РезСоо = "") Тогда клОшибка(РезСоо) КонецЕсли;
			клВнимание(НСтр("ru = 'Обработано документов: '; en = 'Processed documents: '") + РезСче + "...");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция НельзяРедактироватьЦену(ТекПар)
	Возврат омСервер.ЕстьДвиженияПартии(ТекПар, Объект.Ссылка);
КонецФункции

&НаКлиенте
Процедура МоеУдаление()     
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	//2016.02.22
	//та пусть удаляет, если надо, но менеджерам запретим
	//Если Объект.Окончательно Тогда 
	//	Если гоАдминистратор() Тогда 
	//		Сообщить("Под ответственность Администратора!");
	//	Иначе 
	//		Возврат;
	//	КонецЕсли; 
	//КонецЕсли; 
	Если Объект.Окончательно И гоМенеджер() Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	//ПРОВЕРКА ПО ПАРТИИ
	Если НельзяРедактироватьЦену(Стр.Партия) Тогда клОшибка(НСтр("ru = 'Удаление запрещено! Есть движения партии!'; en = 'Removal is prohibited! The batches movements are posted!'")); Возврат; КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("МоеУдалениеЗавершение", ЭтотОбъект, ИДИ),
		СтрШаблон("%1 %2: %3 ?", НСтр("ru = 'Удалить строку'; en = 'Delete a line'"), ИДИ+1, Стр.Номенклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура МоеУдалениеЗавершение(Результат, ИДИ) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли; 
	
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	Номен = Стр.Номенклатура;
	СЦена = Стр.ЦенаЗакупки;
	Колич = Стр.Количество;
	
	Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	
	Объект.Товары.Удалить(Удаляем);
	
	гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);
	
	//партия сама пометится на удаление при записи
	МояЗаписать(Ложь, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли;
	Если омСервер.ЕстьНезакрытыеДокументы(Объект.Контрагент, Объект.Ссылка) Тогда клВнимание(НСтр("ru = 'ВНИМАНИЕ! Есть незакрытые документы!!!'; en = 'ATTENTION! There are unclosed documents!!!'")) КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерПоставщикаПриИзменении(Элемент)
	Если СокрЛП(Объект.НомерПоставщика) = "" Тогда Возврат КонецЕсли;
	Если гоНПЗ(Объект.ДатаПоставщика) Тогда Возврат КонецЕсли;
	Объект.ДатаПоставщика = Объект.Дата;
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда) 
	
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	//2016.01.31
	//вводится новый тип прихода - консигнация, он допускает нулевые цены, но количество в строке должно быть = 1
	//и наоборот, не может быть нулевых цен без этого флага
	Сч = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		Если Объект.Консигнация Тогда
			Если (Стр.ЦенаЗакупки = 0) И (Стр.Количество <> 1) Тогда Сообщить(СокрЛП(Стр.НомерСтроки) + ": кол-во <> 1 при нулевой цене!"); гоПлюс(Сч); КонецЕсли;
		Иначе 
			Если Стр.ЦенаЗакупки = 0 Тогда Сообщить(СтрШаблон(НСтр("ru = 'Строка %1: нулевая цена!'; en = 'Line %1: zero price!'"), СокрЛП(Стр.НомерСтроки))); гоПлюс(Сч); КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	Если Сч <> 0 Тогда  
		Если Объект.Консигнация Тогда 
			клОшибка("Есть строки: " + Сч + " с количеством <> 1 при нулевой цене!");
		Иначе 
			клОшибка(СтрШаблон(НСтр("ru = 'Есть строки: %1 с нулевыми ценами!'; en = 'There are lines: %1 with zero prices!'"), Сч));
		КонецЕсли; 
		Возврат;
	КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("УстановитьЗавершение", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Истина;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(СтрШаблон("Установили. Строк %1, сумма %2",Объект.Товары.Количество(),Формат(Объект.Сумма,"ЧДЦ=2")), ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);	// + ?(НеНадоБЦена, " (без обновления цен)", "")  
	
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	// © Primus1C  06.02.2024  НАЧАЛО ►
	Если ОбщегоНазначенияПовтИсп.ДоступБухгалтерии() Тогда
		клНетДа(Новый ОписаниеОповещения("СнятьЗавершениеБухгалтерия", ЭтотОбъект), НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));
		Возврат;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄

	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Сч = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		Нельзя = ?(НельзяРедактироватьЦену(Стр.Партия), 1, 0);
		Сч = Сч + Нельзя;
		Если Нельзя = 0 Тогда Продолжить КонецЕсли;
		Сообщить(НСтр("ru = 'Есть движения партии: '; en = 'Batches movements are posted: '") + гоИмя(Стр.Партия));
	КонецЦикла;
	
	//Если НЕ гоЕстьРоль("Оператор") Тогда
		Если Сч <> 0 Тогда клОшибка(НСтр("ru = 'Есть движения партий '; en = 'Batches movements are posted '") + гоИмя(Сч) + "!"); Возврат; КонецЕсли;
	//КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьЗавершение", ЭтотОбъект), НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьЗавершениеБухгалтерия(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);    
	МоиИтоги();
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);    
КонецПроцедуры

&НаКлиенте
Процедура СнятьЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), НСтр("ru = 'Удалить все строки?'; en = 'Delete all lines?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	//2016.10.21
	//предлагаю по всем строкам пройтись и записать в журнал
	Для Каждого Стр Из Объект.Товары Цикл
		Номен = Стр.Номенклатура;
		СЦена = Стр.ЦенаЗакупки;
		Колич = Стр.Количество;
		гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удалить все", Объект.Ссылка, 2);
	КонецЦикла;
	
	Объект.Товары.Очистить();
	
	//партии сами пометятся на удаление при записи
	МояЗаписать(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПривязки(Откуда)
	локПривязки = ЗначениеИзСтрокиВнутр(Откуда);
	
	Если Объект.Привязки.Количество() <> 0 Тогда Объект.Привязки.Очистить() КонецЕсли; 
	
	Для Каждого Стр Из локПривязки Цикл
		Если Стр.СуммаДокумента = 0 Тогда Продолжить КонецЕсли;
		
		Нов = Объект.Привязки.Добавить();
		
		Нов.Сумма1 = Стр.СуммаДокумента;
		Нов.Валюта1 = Стр.ВалютаДокумента;
		Нов.Сумма2 = Стр.СуммаДолга;
		Нов.Валюта2 = Стр.ВалютаДолга;
		Нов.КроссКурс = Стр.КроссКурс;
		Нов.ОбратныйКурс = Стр.ОбратныйКурс;
		Нов.Док2 = Стр.Док;
		Нов.Примечание = Стр.Примечание;
		Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязки()
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли;
	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли;
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли;
	//2016.01.30
	//есть флаг, когда долги не возникают, поэтому привязки не трогаем
	Если Объект.ТоварУжеОплачен Тогда Возврат КонецЕсли;
	//2016.08.26
	//Если гоЧужойДокумент(Объект.КемСоздан) Тогда Возврат КонецЕсли; 
	
	лПривязать = Объект.Сумма;
	Если лПривязать = 0 Тогда Возврат КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	Если НЕ Объект.Проведен Тогда клОшибка(НСтр("ru = 'Документ не проведен!'; en = 'Document is not posted!'")); Возврат; КонецЕсли;
	
	Пар = Новый Структура("Док, Привязки, ТолькоПривязки", Объект.Ссылка, Объект.Привязки, 0);
	
	ОткрытьФорму("Обработка.ПривязкаДолгов.Форма.Форма", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоиПривязкиЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязкиЗавершение(Рез, ДопПараметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли; 
	
	//2015.11.27
	//сохраним старые связи, чтобы потом оповестить об их изменении
	СохМасПривязки = клПривязкиВМассив(Объект);
	
	ЗаполнитьПривязки(Рез.ПривязкиСтрока);
	
	МояЗаписать(Ложь);
	
	//2015.11.27
	//вот тут только мы можем оповестить все связанные документы об изменении и прошлые, что сохранились в массиве
	клОповеститьПривязки(Объект, СохМасПривязки);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыЗачет(Команда)
	МоиПривязки();
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагента(Команда)
//2016.06.09

	клИскатьКонтрагента(Новый ОписаниеОповещения("ИскатьКонтрагентаЗавершение", ЭтотОбъект), Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагентаЗавершение(НовКон, ДопПараметры) Экспорт
	Если НовКон = Неопределено Тогда Возврат КонецЕсли; 
	Объект.Контрагент = НовКон;  
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенные(Команда)
//2017.05.30
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ВыдСтр = Элементы.Товары.ВыделенныеСтроки;
	ВыдКол = ВыдСтр.Количество();
	Если ВыдКол <= 1 Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВыделенныеЗавершение", ЭтотОбъект, ВыдСтр),
		стрШаблон(НСтр("ru = 'Удалить выделенные (%1) строки?'; en = 'Delete selected (%1) lines?'"), ВыдКол));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныеЗавершение(Результат, ВыдСтр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удалить = Новый Массив;
	
	Для Каждого ИДИ Из ВыдСтр Цикл
		Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
		Если Стр = Неопределено Тогда клОшибка("Странно, не нашли текущую строку по ИДИ=" + ИДИ + "!"); Продолжить; КонецЕсли;
		Удалить.Добавить(Стр);
	КонецЦикла;
		
	Для Каждого Стр Из Удалить Цикл
		Номен = Стр.Номенклатура;
		СЦена = Стр.ЦенаЗакупки;
		Колич = Стр.Количество;
		гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удалить выделенные", Объект.Ссылка, 2);
		
		Объект.Товары.Удалить(Стр);
	КонецЦикла;
	
	//партии сами пометятся на удаление при записи
	МояЗаписать(Ложь);
КонецПроцедуры

// © Primus1C  08.05.2026  НАЧАЛО ►

&НаКлиенте
Процедура УстановитьЦенуЗакупки(Команда)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ц = ТекущиеДанные.ЦенаЗакупки;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("УстановитьЦенуЗакупкиЗавершение", ЭтотОбъект, ТекущиеДанные), Ц, "Цена закупки", 19, 5);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦенуЗакупкиЗавершение(Ц, ТекущиеДанные) Экспорт
	Если Ц = Неопределено Тогда Возврат КонецЕсли;
	ТекущиеДанные.ЦенаЗакупки = Ц;
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

# Область ВиКод

&НаКлиенте
Процедура ВКД_ИнвойсПриИзменении(Элемент)
	
	//Если Объект.Проведен Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Документ проведен! Для изменения инвойса необходимо отменить проведение!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//Иначе
	//	ВКД_ИнвойсПриИзмененииНаСервере();
	//	Если Объект.Товары.Количество() > 0 Тогда 
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Изменен инвойс! Необходимо выбрать документ затрат!";
	//		Сообщение.Сообщить();
	//		ОчиститьДокументЗатрат();
	//	КонецЕсли;
	//	
	//	ВКД_УстановитьВидимостьПолей();
	//КонецЕсли;
	
	Если Объект.Проведен Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Документ проведен! Для изменения инвойса необходимо отменить проведение!'; en = 'The document is posted! To change the invoice, you must cancel the posting!'");
		//Сообщение.Сообщить(); 
		клОшибка(Сообщение.Текст);
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) И Объект.Дата < ПолучитьДатуИнвойса(Объект.ВКД_Инвойс) Тогда
		//Предупреждение("Приходная накладная создана раньше инвойса. Выбор номенклатуры невозможен! Измените дату создания Приходной	накладной!",,"Внимание!");
		клОшибка(НСтр("ru = 'Приходная накладная создана раньше инвойса. Выбор номенклатуры невозможен! Измените дату создания Приходной накладной!'; en = 'The incoming waybill was created before the invoice. Nomenclature selection is not possible! Change the date of the incoming waybill'"));
		Возврат;
    Иначе
		//ВКД_ИнвойсПриИзмененииНаСервере();
		//Если Объект.Товары.Количество() > 0 Тогда 
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Изменен инвойс! Необходимо выбрать документ затрат!";
		//	Сообщение.Сообщить();
		//	ОчиститьДокументЗатрат();
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда
			НеоприходованныеТоварыИнвойса = НеоприходованныеТоварыИнвойса(Объект.ВКД_Инвойс);
		    ЗаполнитьПоИнвойсуНаКлиенте();
		КонецЕсли;
		ВКД_УстановитьВидимостьПолей();
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НеоприходованныеТоварыИнвойса(СсылкаИнвойс) 
	Возврат	Документы.ПриходнаяНакладная.НеоприходованныеТоварыИнвойса(СсылкаИнвойс);
КонецФункции	

&НаСервере
Процедура ВКД_ИнвойсПриИзмененииНаСервере()	
	
	//Объект.Товары.Очистить();  
	
	// © Primus1C  24.07.2023  НАЧАЛО ►
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВКД_ОприходованиеНоменклатурыОстатки.Номенклатура,
	//               |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток, 0) КАК Количество,
	//               |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаЗакупкиОстаток, 0) КАК СуммаЗакупки,
	//               |	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаСоСкидкойОстаток, 0) КАК СуммаЗакупкиСоСкидкой
	//			   //|	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаЗакупкиОстаток, 0) / ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток, 0) КАК ЦенаЗакупки,
	//			   //|	ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.СуммаСоСкидкойОстаток, 0) / ЕСТЬNULL(ВКД_ОприходованиеНоменклатурыОстатки.КоличествоОстаток, 0) КАК ЦенаСоСкидкой
	//               |ИЗ
	//               |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки(, Документ = &Ссылка) КАК ВКД_ОприходованиеНоменклатурыОстатки";

	//Запрос.УстановитьПараметр("Ссылка",Объект.ВКД_Инвойс);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "По инвойсу приходные накладные уже созданы!";
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если Выборка.Количество = 0 Тогда
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "По номенклатуре: " + Выборка.Номенклатура + " приходные накладные созданы!";
	//		Сообщение.Сообщить();
	//		
	//	ИначеЕсли Выборка.Количество > 0 Тогда //если не все оприходовано	
	//    	Разница = Выборка.Количество;
	//			Сч = 0;
	//			Пока Сч < Разница Цикл  //построчно выводим перечень номенклатуры
	//				НоваяСтрока = Объект.Товары.Добавить();
	//				НоваяСтрока.Количество = 1;	 
	//				НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	//				НоваяСтрока.СуммаЗакупки = Выборка.СуммаЗакупки ; // сумма равна цене закупки 
	//				НоваяСтрока.ЦенаЗакупки = Выборка.СуммаЗакупки/ Выборка.Количество;
	//				НоваяСтрока.ВКД_ЦенаСоСкидкой = Выборка.СуммаЗакупкиСоСкидкой/Выборка.Количество;
	//				Сч = Сч + 1;
	//			КонецЦикла;
	//	КонецЕсли;			
	//			
	//КонецЦикла;
	//
	//Объект.Валюта = Объект.ВКД_Инвойс.Валюта;
	//Объект.Контрагент = Объект.ВКД_Инвойс.Контрагент;
	//Объект.ВКД_ДокументСкидки = Объект.ВКД_Инвойс.ВКД_ДокументСкидки;
	//Объект.ВКД_ИнвойсПоставщика = Объект.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика;
	//Объект.ВКД_ДатаИнвойсаПоставщика = Объект.ВКД_Инвойс.ВКД_ДатаИнвойсаПоставщика;
	//Объект.ВКД_СуммаСкидки = Объект.ВКД_Инвойс.ВКД_Скидка;

	НеоприходованныеТоварыИнвойса = Документы.ПриходнаяНакладная.НеоприходованныеТоварыИнвойса(Объект.ВКД_Инвойс);
	Если НеоприходованныеТоварыИнвойса = Неопределено Тогда 
		
		ОбщегоНазначенияСервер.СообщитьОбОшибке(Объект, НСтр("ru = 'По инвойсу приходные накладные уже созданы!'; en = 'Incoming waybills notes have already been created for the invoice!'"));
		Возврат;  
		
	Иначе
		
		////Для каждого Остаток Из НеоприходованныеТоварыИнвойса Цикл
		////	Если Остаток.Количество > 0 Тогда
		////		Для Инд = 1 По Остаток.Количество Цикл
		////			НоваяСтрока = Объект.Товары.Добавить();
		////			НоваяСтрока.Количество 			= 1;	 
		////			НоваяСтрока.Номенклатура 		= Остаток.Номенклатура;
		////			НоваяСтрока.СуммаЗакупки 		= Остаток.СуммаЗакупки ; // сумма равна цене закупки 
		////			НоваяСтрока.ЦенаЗакупки 		= Остаток.СуммаЗакупки/ Остаток.Количество;
		////			НоваяСтрока.ВКД_ЦенаСоСкидкой 	= Остаток.СуммаСоСкидкой/Остаток.Количество;
		////		КонецЦикла;
		////	Иначе	
		////		ОбщегоНазначенияСервер.СообщитьОбОшибке(Объект, "Приходные накладные уже созданы по номенклатуре: " + Остаток.Номенклатура);
		////	КонецЕсли;
		////КонецЦикла;

		//Если НеоприходованныеТоварыИнвойса.КоличествоНеоприходованныхПоставок = 0 Тогда
		// 	ОбщегоНазначенияСервер.СообщитьОбОшибке(Объект, "Приходные накладные уже созданы по номенклатуре: " + Остаток.Номенклатура);
		//ИначеЕсли НеоприходованныеТоварыИнвойса.КоличествоНеоприходованныхПоставок > 1 Тогда
		// 	ОбщегоНазначенияСервер.СообщитьОбОшибке(Объект, "Приходные накладные уже созданы по номенклатуре: " + Остаток.Номенклатура);
		//Иначе	
		//	
		//	// Шапка
		//	Объект.Валюта 				= Объект.ВКД_Инвойс.Валюта;
		//	Объект.Контрагент 			= Объект.ВКД_Инвойс.Контрагент;
		//	Объект.ВКД_ДокументСкидки 	= Объект.ВКД_Инвойс.ВКД_ДокументСкидки;
		//	Объект.ВКД_ИнвойсПоставщика = Объект.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика;
		//	Объект.ВКД_ДатаИнвойсаПоставщика = Объект.ВКД_Инвойс.ВКД_ДатаИнвойсаПоставщика;
		//	Объект.ВКД_СуммаСкидки 		= Объект.ВКД_Инвойс.ВКД_Скидка;
		//	// ТЧ
		//	Объект.Товары.Очистить();  
		//	
		//	
		//КонецЕсли; 
		
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Установите курсор на нужную строку табличной части!'; en = 'Place the cursor on the desired line of the tabular part!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Все строки табличной части заполнены!'; en = 'All lines of the tabular section are filled!'"), 5, НСтр("ru = 'Внимание!'; en = 'Attention!'"));
		Возврат;
	Иначе  // проверка на дубль серии 
		Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Серия", ВыбранноеЗначение));
		НашлиНаСкладе = НайтиКоличествоСерийНаСкладе(ВыбранноеЗначение);  
		Если (Нашли.Количество() > 0) Тогда 
			//клВнимание(гоИмя(ВыбранноеЗначение) + ": уже есть в документе!" + гоРС() + "Значение пропускается!!!");
			клВнимание(СтрШаблон(НСтр("ru = '%1: уже есть в документе! %2Значение пропускается!!!'; en = '%1: already in the document! %2Value skipped!!!'"), гоИмя(ВыбранноеЗначение), гоРС())); 
			Стр.Серия = "";
			Возврат; 
		ИначеЕсли НашлиНаСкладе = 1 Тогда
			//клВнимание(гоИмя(ВыбранноеЗначение) + ": уже было оприходовано ранее!" + гоРС() + "Значение пропускается!!!");
			клВнимание(СтрШаблон(НСтр("ru = '%1: уже было оприходовано ранее! %2Значение пропускается!!!'; en = '%1: has already been capitalized before! %2Value skipped!!!'"), гоИмя(ВыбранноеЗначение), гоРС()));
			Стр.Серия = "";
			Возврат; 

		Иначе
			Стр.Серия = ВыбранноеЗначение;
			// Стр.Партия = СоздатьПартию(Объект.Ссылка,Стр.Номенклатура,Стр.ЦенаЗакупки,Стр.Серия);     
			// © Primus1C  09.07.2024  НАЧАЛО ► 
			РаспределитьЗатратыОтправки(Стр);
			// © Primus1C  ОКОНЧАНИЕ ◄
			Стр.Партия = ВКД_СоздатьПартию(Объект.Ссылка, Стр.Номенклатура, Стр.ЦенаЗакупки, Стр.Серия, Стр.ВКД_ЦенаСоСкидкой, Стр.ВКД_ЦенаСЗатратами);
			
			Элементы.Товары.ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока + 1;
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура F7(Команда)
	
	Если НЕ Объект.Окончательно Тогда
		СканированиеШтрихкода();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ВКД_УстановитьВидимостьПолей()
	
	// © Primus1C  12.11.2023  НАЧАЛО ►

	//Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда
	//	Элементы.ТоварыF7.Видимость = Истина;
	//	Элементы.ВКД_СуммаСкидки.Видимость = Истина;
	//	Элементы.ВКД_Скидка.Видимость = Истина;
	//Иначе
	//	Элементы.ТоварыF7.Видимость = Ложь;
	//	Элементы.ВКД_СуммаСкидки.Видимость = Ложь;
	//	Элементы.ВКД_Скидка.Видимость = Ложь;
	//КонецЕсли;
	
	лРежим = ЗначениеЗаполнено(Объект.ВКД_Инвойс);
	Попытка
		Элементы.ТоварыF7.Видимость 		= лРежим;
	Исключение
	КонецПопытки;
	Элементы.ВКД_СуммаСкидки.Видимость 		= лРежим;
	Элементы.ВКД_Скидка.Видимость 			= лРежим; 
	Элементы.ГруппаИнвойсСведения.Видимость = лРежим;	
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗатраты(Команда)
	РассчитатьЦенуСЗатратами();
КонецПроцедуры

&НаКлиенте
Процедура ВКД_ДокументЗатратПриИзменении(Элемент)
	
// РассчитатьЦенуСЗатратами();	
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = НСтр("ru = 'Изменен документ затрат. Нажмите кнопку <Рассчитать затраты>!'; en = 'Cost document has been changed. Click the <Calculate costs> button!'");
Сообщение.Сообщить();
ОчиститьКолонкуЗатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСЗатратами()
	
	Объект.ВКД_СуммаЗатрат = ПолучитьСуммуЗатратПоДокументу();
	
	ОбщаяСуммаКРаспределению = Объект.ВКД_СуммаЗатрат;
	Если ОбщаяСуммаКРаспределению <> 0 Тогда 
		Если Объект.ВариантРаспределения = 0 Тогда
			клПредупреждение(НСтр("ru = 'Скидка не будет распределена! Не выбран вид расчета!'; en = 'The discount will not be distributed! Distributed option not selected!'"));
		ИначеЕсли Объект.ВариантРаспределения = 1 Тогда
			РассчитатьЦенуСЗатратамиПоСумме(ОбщаяСуммаКРаспределению);	
		ИначеЕсли Объект.ВариантРаспределения = 2 Тогда
			РассчитатьЦенуСЗатратамиПоКоличеству(ОбщаяСуммаКРаспределению);
		КонецЕсли;
	КонецЕсли;
	
	// © Primus1C  12.03.2024  НАЧАЛО ► 
	РаспределитьЗатратыОтправки();
	МоиИтоги();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры 

&НаСервере
Функция ПолучитьСуммуЗатратПоДокументу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ВКД_ДополнительныеЗатратыДокументы.СуммаНаценки) КАК СуммаНаценки
	               |ИЗ
	               |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ВКД_ДополнительныеЗатратыДокументы
	               |ГДЕ
	               |	ВКД_ДополнительныеЗатратыДокументы.Ссылка В(&Ссылка)
	               |	И ВКД_ДополнительныеЗатратыДокументы.Документ = &Приходная";
	// CN_^ - 12.02.2020 - начало.
	//было
	//Запрос.УстановитьПараметр("Ссылка",Объект.ВКД_ДокументЗатрат);
	ВтЗатрат = Объект.Затраты.Выгрузить(, "ДокументЗатрат");
	ВтЗатрат.Свернуть("ДокументЗатрат");
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(ВтЗатрат.ВыгрузитьКолонку("ДокументЗатрат"));
	Если НЕ Объект.Ссылка.Метаданные().Реквизиты.Найти("ВКД_ДокументСкидки") = Неопределено Тогда
		Если СписокОтбора.НайтиПоЗначению(Объект.ВКД_ДокументЗатрат) = Неопределено И ЗначениеЗаполнено(Объект.ВКД_ДокументЗатрат) Тогда
			СписокОтбора.Добавить(Объект.ВКД_ДокументЗатрат);
			Стр = ВтЗатрат.Добавить();
			Стр.ДокументЗатрат = Объект.ВКД_ДокументЗатрат;
		КонецЕсли;	
	КонецЕсли;
	Объект.Затраты.Загрузить(ВтЗатрат);
	Если СписокОтбора.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", СписокОтбора);
	// CN_^ - 12.02.2020 - конец.
	Запрос.УстановитьПараметр("Приходная",Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.СуммаНаценки <> Неопределено Тогда
			Возврат Выборка.СуммаНаценки; 
		Иначе
			Возврат 0;
		КонецЕсли;		
	КонецЕсли;
				   	
КонецФункции

&НаКлиенте
Процедура ОчиститьКолонкуЗатрат()
	
	Для каждого Стр Из Объект.Товары Цикл
		Стр.ВКД_ЦенаСЗатратами = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументЗатрат()
	Объект.ВКД_ДокументЗатрат = Документы.ВКД_ДополнительныеЗатраты.ПустаяСсылка();	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьЦенуСЗатратамиПоСумме(ОбщаяСуммаКРаспределению)
	
	СуммаПриходной = Объект.Товары.Итог("СуммаЗакупки");
	Если ОбщаяСуммаКРаспределению <> 0 Тогда
		Для каждого Стр из Объект.Товары Цикл	
			ВесоваяЧасть = Стр.СуммаЗакупки / СуммаПриходной * 100  ;
			СуммаКРаспределению = ОбщаяСуммаКРаспределению * ВесоваяЧасть / 100;
			ДельтаЦены = СуммаКРаспределению / Стр.Количество;
			ЦенаСЗатратами = ?(ЗначениеЗаполнено(Стр.ВКД_ЦенаСоСкидкой),Стр.ВКД_ЦенаСоСкидкой + ДельтаЦены,Стр.ЦенаЗакупки + ДельтаЦены);
			Стр.ВКД_ЦенаСЗатратами = ЦенаСЗатратами;
			Стр.ВКД_СуммаСЗатратами = Стр.Количество * ЦенаСЗатратами;
		КонецЦикла;
	Иначе
		клПредупреждение(НСтр("ru = 'Расчет не проведен. Сумма затрат равна 0! Воможно, не выбран документ затрат!'; en = 'The calculation has not been carried out. The total expenses is 0! The expenses document may not have been selected!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСЗатратамиПоКоличеству(ОбщаяСуммаКРаспределению) 
	
	ОбщееКоличество = Объект.ВКД_Количество;
	
	Если ОбщаяСуммаКРаспределению <> 0 Тогда
		
		ДельтаЦены = ОбщаяСуммаКРаспределению / ОбщееКоличество;
		
		Для каждого Стр из Объект.Товары Цикл		
			ЦенаСЗатратами = ?(ЗначениеЗаполнено(Стр.ВКД_ЦенаСоСкидкой), Стр.ВКД_ЦенаСоСкидкой + ДельтаЦены, Стр.ЦенаЗакупки + ДельтаЦены);
			//Стр.ЦенаЗакупки + ДельтаЦены;
			Стр.ВКД_ЦенаСЗатратами = ЦенаСЗатратами;
			Стр.ВКД_СуммаСЗатратами = Стр.Количество * ЦенаСЗатратами;			
		КонецЦикла;
	Иначе
		клПредупреждение(НСтр("ru = 'Расчет не проведен. Сумма затрат равна 0! Воможно, не выбран документ затрат!'; en = 'The calculation has not been carried out. The total expenses is 0! The expenses document may not have been selected!'"));
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Изменен вид расчета! Нажмите кнопку <Рассчитать затраты>!'; en = 'The type of calculation has been changed! Click the <Calculate costs> button!'");
	Сообщение.Сообщить();
	ОчиститьЦенуСЗатратами();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЦенуСЗатратами()
	
	Для каждого Стр Из Объект.Товары Цикл
		Стр.ВКД_ЦенаСЗатратами = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВКД_СоздатьПартию(Ссылка, НовНом, НовЦен, НовСер = "", ВКД_ЦенаСоСкидкой, ВКД_ЦенаСЗатратами)
	Спр = Справочники.Партии.СоздатьЭлемент();
	
	Спр.Владелец = НовНом;
	Спр.Док = Ссылка;
	Спр.Наименование = "ПН_" + Лев(гоМгновение(Ссылка.Дата), 8);
	Спр.Контрагент = Ссылка.Контрагент;
	Спр.ЦенаЗакупки = НовЦен;
	Спр.Валюта = Ссылка.Валюта;
	Спр.ДатаПартии = Ссылка.Дата;
	Спр.Фирма = Ссылка.Фирма;
	Спр.Серия = НовСер;
	Спр.ВКД_ЦенаСоСкидкой = ВКД_ЦенаСоСкидкой;
	
	Спр.Записать();
	
	Возврат Спр.Ссылка;
КонецФункции

&НаКлиенте
Процедура СканированиеШтрихкода()
	
	 Если ЗначениеЗаполнено(Объект.ВКД_Инвойс) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		ОткрытьФорму("ОбщаяФорма.ВКД_Сканирование",ПараметрыФормы,ЭтаФорма.Элементы.Товары,Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	Записать();
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Функция НайтиКоличествоСерийНаСкладе(Серия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТовараОстатки.ОстатокОстаток,
	               |	ОстаткиТовараОстатки.РезервОстаток,
	               |	ОстаткиТовараОстатки.Партия.Серия
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Остатки(, Партия.Серия = &Серия) КАК ОстаткиТовараОстатки
	               |ГДЕ
	               |	(ОстаткиТовараОстатки.ОстатокОстаток > 0
	               |			ИЛИ ОстаткиТовараОстатки.РезервОстаток > 0)";
	Запрос.УстановитьПараметр("Серия", Серия);

	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат 1
	Иначе
		Возврат 0
	КонецЕсли;

КонецФункции

&НаСерверебезКонтекста
Функция ПолучитьДатуИнвойса(Инвойс)
	Возврат Инвойс.Дата;
КонецФункции

#КонецОбласти

// CN_^ - 12.02.2020 - начало.

#Область ПроцедурыИФункцииТЧЗатрат

&НаКлиенте
Процедура ЗатратыДокументЗатратПриИзменении(Элемент)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Изменен документ затрат. Нажмите кнопку <Рассчитать затраты>!'; en = 'Expenses document has been changed. Click the <Calculate costs> button!'");
	Сообщение.Сообщить();
	ОчиститьКолонкуЗатрат();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыДокументЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокОтбора = Новый СписокЗначений;
	ПолучитьСписокОтбораДокументовЗатрат(СписокОтбора);
	Если Не СписокОтбора.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Форма = ОткрытьФорму("Документ.ВКД_ДополнительныеЗатраты.ФормаВыбора", , Элемент); //Открываем форму
		ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
		ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; //Как будем сравнивать
		ОтборВладелец.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
		ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); //По какому реквизиту будем делать отбор
		ОтборВладелец.ПравоеЗначение = СписокОтбора; // И само значение отбора
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОтбораДокументовЗатрат(СписокОтбора)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВКД_ДополнительныеЗатратыДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ВКД_ДополнительныеЗатратыДокументы
		|ГДЕ
		|	ВКД_ДополнительныеЗатратыДокументы.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Попытка
		СписокОтбора.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("Ссылка"));
	Исключение
	КонецПопытки;	
КонецПроцедуры // ПолучитьСписокОтбораДокументовЗатрат(СписокОтбора)

// © Primus1C  09.12.2025  НАЧАЛО ►

&НаКлиенте
Процедура ЗатратыПриИзменении(Элемент)
	ОтобразитьПоказателиЗатрат();
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄

#КонецОбласти

// CN_^ - 12.02.2020 - конец.


