// © Primus1C  13.07.2023  НАЧАЛО ► 


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Поля.Добавить("Наименование");
    Поля.Добавить("Псевдоним");
    
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
	Если ОбщегоНазначенияПовтИсп.ДоступныНаименованияКонтрагентов() Тогда
		Представление = Данные.Наименование;
	Иначе
		Если ЗначениеЗаполнено(Данные.Псевдоним) Тогда
			Представление = Данные.Псевдоним;
		Иначе
			Представление = Данные.Наименование;
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ПараметрыСеанса.ДоступныНаименованияКонтрагентов Тогда 
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;  
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	Контрагенты.Ссылка,
		             |	ВЫБОР
		             |		КОГДА Контрагенты.Псевдоним = """"
		             |			ТОГДА Контрагенты.Наименование
		             |		ИНАЧЕ Контрагенты.Псевдоним
		             |	КОНЕЦ КАК Псевдоним
		             |ИЗ
		             |	Справочник.Контрагенты КАК Контрагенты
		             |ГДЕ
		             |	ВЫБОР
		             |			КОГДА Контрагенты.Псевдоним = """"
		             |				ТОГДА Контрагенты.Наименование ПОДОБНО &Псевдоним
		             |			ИНАЧЕ Контрагенты.Псевдоним ПОДОБНО &Псевдоним
		             |		КОНЕЦ
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Псевдоним";
		Запр.УстановитьПараметр("Псевдоним", СокрЛП("%" + Параметры.СтрокаПоиска + "%")); 
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Псевдоним);
		КонецЦикла;
	
	КонецЕсли;
		
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄