Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект, Ложь);
	
	// © Primus1C  15.07.2023  НАЧАЛО ► 
	Если НЕ ЭтоГруппа Тогда
		Псевдоним = СокрЛП(Псевдоним);  
		Если ЗначениеЗаполнено(Псевдоним) Тогда
			Если Не ОбщегоНазначенияСервер.ПройденКонтрольУникальностиСправочникаПоРеквизиту(
				ЭтотОбъект.Метаданные().Имя,
				Новый Структура("Псевдоним", Псевдоним), 
				Ссылка) Тогда
				Сообщить(стрШаблон(НСтр("ru = 'Контрагент с псевдонимом <%1> уже существует!'; en = 'A counterparty with the alias <%1> already exists!'"), Псевдоним));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Префикс) Тогда
			Если Не ОбщегоНазначенияСервер.ПройденКонтрольУникальностиСправочникаПоРеквизиту(
				ЭтотОбъект.Метаданные().Имя,
				Новый Структура("Префикс", Префикс), 
				Ссылка) Тогда
				Сообщить(стрШаблон(НСтр("ru = 'Контрагент с префиксом <%1> уже существует!'; en = 'A counterparty with the prefix <%1> already exists!'"), Префикс));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

КонецПроцедуры
