
&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	ТекстДляПоиска = СокрЛП(РучнойШК);
    
   // 1. Ограничиваем область поиска строго 3-й колонкой (R1C5:R99999C5)
    ОбластьКолонки = Результат.Область(, 3, , 3);
    
	// 2. Ищем первый раз, передавая нашу область третьим параметром
	НайденнаяОбласть = Результат.НайтиТекст(ТекстДляПоиска, Неопределено, ОбластьКолонки);
	
	Если НайденнаяОбласть = Неопределено Тогда

		клПроизнестиГолосом(НСтр("ru = 'Нет серии'; en = 'No series'"));     

	Иначе	
		
		// 3. Закрашиваем все совпадения
		Пока НайденнаяОбласть <> Неопределено Цикл
			
			//НомерСтроки = НайденнаяОбласть.Верх;
			//СтрокаТабДока = Результат.Область("R" + Формат(НомерСтроки, "ЧГ="));
			//СтрокаТабДока.ЦветФона = WebЦвета.СветлоЗеленый;
			НайденнаяОбласть.ЦветФона = WebЦвета.СветлоЗеленый;
			
			// 4. Ищем следующее совпадение (Начало поиска - предыдущая находка, Граница - наша 5 колонка)
			НайденнаяОбласть = Результат.НайтиТекст(ТекстДляПоиска, НайденнаяОбласть, ОбластьКолонки);
			
		КонецЦикла;	 
		
	КонецЕсли;

	РучнойШК = "";
	ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто); 

КонецПроцедуры


&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;

КонецПроцедуры
