
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ОжидаемоеПоступлениеДС") Тогда
		ОжидаемоеПоступлениеДС = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВЗАИМОРАСЧЕТЫ С КЛИЕНТАМИ
	Движения._ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движение						 = Движения._ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения			 = ВидДвиженияНакопления.Расход;
	Движение.Период					 = Дата;
	Движение.ОжидаемоеПоступлениеДС	 = ОжидаемоеПоступлениеДС;
	Движение.Контрагент				 = ОжидаемоеПоступлениеДС.Контрагент;
	Движение.СуммаОплаты			 = Сумма;
	Движение.Валюта					 = Валюта;
	
	//ДЕНЬГИ
	Движения._ДенежныеСредства.Записывать = Истина;
	Движение			 = Движения._ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период		 = Дата;
	Движение.Валюта		 = Валюта;
	Движение.Сумма		 = Сумма;
	
КонецПроцедуры


