
Процедура клВопросЗавершение(РезультатВыбора, ОписаниеОповещенияОЗавершении) Экспорт
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, ?(РезультатВыбора = Неопределено, Ложь, РезультатВыбора));
КонецПроцедуры

Процедура клНетДаЗавершение(РезультатВопроса, ОписаниеОповещенияОЗавершении) Экспорт
	//ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, НЕ РезультатВопроса);
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, РезультатВопроса);
КонецПроцедуры

Процедура клЖурналНашИнтервалЗавершение(РезультатРедактирования, Параметры) Экспорт
	
	Если РезультатРедактирования = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	Форма = Параметры.Форма;
	Диалог = Параметры.Диалог;
	Форма.НачДата = Диалог.Период.ДатаНачала;
	Форма.КонДата = Диалог.Период.ДатаОкончания;
	
	гоЗаголовокИнтервал(Форма);
	Форма.ТекущийЭлемент = Форма.Элементы.Список; 
	
КонецПроцедуры

Процедура клНайтиНомерЗавершение(ИщемНомер, Параметры) Экспорт
	Форма = Параметры.Форма;
	
	Если ИщемНомер <> Неопределено Тогда
		ИщемПрефикс = Параметры.ИщемПрефикс;
		ИщемВсе = ?(ИщемПрефикс = "", ИщемНомер, ИщемПрефикс + гоЧислоНулиСлева(ИщемНомер, 7));
		
		Тек = омСервер.ДокументПоНомеру(ИщемВсе, Форма.ИмяДокумента);
		Если гоПЗ(Тек) Тогда
			клОшибка(СтрШаблон("%1 %2!", НСтр("ru = 'Не найден документ по номеру'; en = 'Document number not found'"), гоИмя(ИщемВсе))); 
		Иначе
			Форма.Элементы.Список.ТекущаяСтрока = Тек;
		КонецЕсли; 
	КонецЕсли; 
	
	Форма.ТекущийЭлемент = Форма.Элементы.Список;
КонецПроцедуры

Процедура клДокументВБуферПослеПодтверждения(ОтветНетДа, Параметры) Экспорт
	Если ОтветНетДа Тогда Возврат КонецЕсли;
	РаботаСоСканеромШК.ЗаписатьБуфер(Параметры.Тек, Параметры.ВыдСтр, Параметры.Форма);
КонецПроцедуры

Процедура клПечатьДокументаРасходнаяПослеПроверкиЦен(ОтветНетДа, Тек) Экспорт
	Если ОтветНетДа Тогда Возврат КонецЕсли; 
	клПечатьДокументаВариантРасходная(Тек);
КонецПроцедуры

Процедура клПечатьДокументаЗавершениеРасходная(Поз, Тек) Экспорт
	Если Поз = 0 Тогда Возврат КонецЕсли; 
	
	Имя = "РасходнаяНакладная";
	Пар = Новый Структура;
	Таб = Новый ТабличныйДокумент;
	омСервер.ПечатьДокумента(Имя, Тек, Поз, Таб, Пар);
	
	Таб.ПолеСверху = 10;
	Таб.ПолеСлева = 10;
	Таб.ПолеСнизу = 10;
	Таб.ПолеСправа = 0;
	
	Таб.РазмерКолонтитулаСверху = 8;
	Таб.РазмерКолонтитулаСнизу = 8;	
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Таб.ВерхнийКолонтитул.Выводить = Истина;
	Таб.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	Таб.ВерхнийКолонтитул.ТекстСправа = НСтр("ru = 'стр. [&НомерСтраницы] из [&СтраницВсего]'; en = 'page [&НомерСтраницы] of [&СтраницВсего]'");
	
	Таб.НижнийКолонтитул.Выводить = Истина;
	Таб.НижнийКолонтитул.НачальнаяСтраница = 1;
	Таб.НижнийКолонтитул.ТекстСлева = гоПользовательКод();
	Таб.НижнийКолонтитул.ТекстСправа = "[&Дата] [&Время]";
	
	Пар = Новый Структура("Таб", Таб);
	Пар.Вставить("Имя", гоИмя(Тек, Ложь));
	Пар.Вставить("НеДляПечати", Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", Пар, , Истина); 	//не искать окно вообще, всегда открывать новое
КонецПроцедуры

Процедура клПечатьДокументаЗавершениеПриходная(Поз, Тек) Экспорт
	Если Поз = 0 Тогда Возврат КонецЕсли; 
	
	Имя = "ПриходнаяНакладная";
	Пар = Новый Структура;
	Таб = Новый ТабличныйДокумент;
	омСервер.ПечатьДокумента(Имя, Тек, Поз, Таб, Пар);
	
	Таб.ПолеСверху = 10;
	Таб.ПолеСлева = 10;
	Таб.ПолеСнизу = 10;
	Таб.ПолеСправа = 0;
	
	Таб.РазмерКолонтитулаСверху = 8;
	Таб.РазмерКолонтитулаСнизу = 8;	
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Таб.ВерхнийКолонтитул.Выводить = Истина;
	Таб.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	Таб.ВерхнийКолонтитул.ТекстСправа = "стр. [&НомерСтраницы] из [&СтраницВсего]";
	
	Таб.НижнийКолонтитул.Выводить = Истина;
	Таб.НижнийКолонтитул.НачальнаяСтраница = 1;
	Таб.НижнийКолонтитул.ТекстСлева = гоПользовательКод();
	Таб.НижнийКолонтитул.ТекстСправа = "[&Дата] [&Время]";
	
	Пар = Новый Структура("Таб", Таб);
	Пар.Вставить("Имя", гоИмя(Тек, Ложь));
	Пар.Вставить("НеДляПечати", Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", Пар, , Истина); 	//не искать окно вообще, всегда открывать новое
КонецПроцедуры

Процедура клВариантЗавершение(РезПар, Параметры) Экспорт
	Если РезПар = Неопределено Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, 0); 
		Возврат;
	КонецЕсли;
	
	Старт = Параметры.Старт;
	Рез = РезПар.ВыбраннаяСтрока + 1;
	
	Если ТипЗнч(Старт) = Тип("Число") Тогда 
		//ничего не сохраняем
	Иначе 
		гоСЗН("Вариант", Старт, Рез);
	КонецЕсли; 
	
	ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Рез);
КонецПроцедуры

Процедура клВариантСпискаЗавершение(Результат, ОписаниеОповещенияОЗавершении) Экспорт
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, ?(Результат = Неопределено, Неопределено, Результат.ВыбранноеЗначение));
КонецПроцедуры

Процедура клИскатьКонтрагентаПослеВводаСтроки(Стр, Параметры) Экспорт
	Если Стр = Неопределено Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли; 
	
	гоСЗН("Общие", "ПоискКонтрагента", Стр);
	Стр = СокрЛП(Стр);
	Если Стр = "" Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли; 
	
	Спи = омСервер.ИскатьКонтрагента(Стр);
	Если Спи.Количество() = 0 Тогда 
		клОшибка(НСтр("ru = 'Ничего найти не удалось!'; en = 'Couldn't find anything!'")); 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли;
	Если Спи.Количество() = 1 Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Спи[0].Значение); 
		Возврат;
	КонецЕсли; 
	
	Эле = Спи.НайтиПоЗначению(Параметры.СтатьНа);
	Спи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("клИскатьЭлементПослеВыбора", ОбработчикиКомандКлиент, Параметры.ОписаниеОповещенияОЗавершении), 
		НСтр("ru = 'Выберите из найденного:'; en = 'Select from what was found:'"), Эле);
КонецПроцедуры

Процедура клИскатьНоменклатуруПослеВводаСтроки(Стр, Параметры) Экспорт
	Если Стр = Неопределено Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли; 
	
	гоСЗН("Общие", "ПоискНоменклатуры", Стр);
	Стр = СокрЛП(Стр);
	Если Стр = "" Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли; 
	
	Спи = омСервер.ИскатьНоменклатуру(Стр);
	Если Спи.Количество() = 0 Тогда 
		клОшибка(НСтр("ru = 'Ничего найти не удалось!'; en = 'Couldn't find anything!'")); 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Неопределено); 
		Возврат;
	КонецЕсли;
	Если Спи.Количество() = 1 Тогда 
		ВыполнитьОбработкуОповещения(Параметры.ОписаниеОповещенияОЗавершении, Спи[0].Значение); 
		Возврат;
	КонецЕсли; 
	
	Эле = Спи.НайтиПоЗначению(Параметры.СтатьНа);
	Спи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("клИскатьЭлементПослеВыбора", ОбработчикиКомандКлиент, Параметры.ОписаниеОповещенияОЗавершении), 
		НСтр("ru = 'Выберите из найденного:'; en = 'Select from what was found:'"), Эле);
КонецПроцедуры

Процедура клИскатьЭлементПослеВыбора(Эле, ОписаниеОповещенияОЗавершении) Экспорт
	ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, ?(Эле = Неопределено, Неопределено, Эле.Значение));
КонецПроцедуры

Процедура ОповещениеПослеВводаТекста(Текст, ДопПараметры) Экспорт
	Если Текст = Неопределено Тогда Возврат КонецЕсли;
	
	омСервер.ЗаписатьСообщениеВсемПользователям(Текст);
КонецПроцедуры

Процедура ПередНачаломРаботыСистемыПослеНастройки(РезультатЗакрытия, ДопПараметры) Экспорт
	клВнимание(НСтр("ru = 'Работа программы будет завершена, чтобы изменения вступили в силу!'; en = 'The program will be terminated for the changes to take effect!'"));
КонецПроцедуры

Процедура СсылкиПослеПодтверждения(Результат, Тек) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Т = Новый ТекстовыйДокумент;
	Сче = омСервер.ЧислоСсылок(Тек, Т);
	Если Сче = 0 Тогда клВнимание( НСтр("ru = 'Нет ссылок!'; en = 'No links!'")); Возврат; КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("СсылкиПослеПодтвержденияПоказа", ОбработчикиКомандКлиент, Т),
		СтрШаблон(НСтр("ru = 'Есть ссылки: %1! %2Показать?'; en = 'There are links: %1! %2Show?'"),Сче,гоРС()), , Истина);
КонецПроцедуры

Процедура СсылкиПослеПодтвержденияПоказа(Результат, Т) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Т.Показать(НСтр("ru = 'Ссылки'; en = 'Links'"));
КонецПроцедуры

Процедура ПослеВыбораЭлементаСтатусаИнвойсовПродажи(ВыбранныйЭлемент, СписокПараметров) Экспорт 
	
    Если ВыбранныйЭлемент = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	Ошибка = Ложь;   
	Загл = "Статус";    
	Сотрудник = гоРеквизит(гоПользователь(), "Сотрудник");
  	РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(СписокПараметров.Ссылка, ВыбранныйЭлемент.Значение, , Сотрудник, , , , Ошибка);      
	Если Ошибка Тогда
		клНамекнуть(Загл, стрШаблон("Не удалось установить статус: %1", СписокПараметров.Ссылка), БиблиотекаКартинок.ВниманиеКрасный); 
	Иначе
		клНамекнуть(Загл, стрШаблон("%1: установлен статус %2", СписокПараметров.Ссылка, ВыбранныйЭлемент.Значение), БиблиотекаКартинок.Информация);
    	// === ОБНОВЛЕНИЕ ДИНАМИЧЕСКОГО СПИСКА НА ФОРМЕ ===
		Форма = СписокПараметров.ФормаИсточник;
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
			Если Форма.Элементы.Найти("Список") <> Неопределено Тогда
				Форма.Элементы.Список.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
