&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

// © Primus1C  17.01.2024  НАЧАЛО ►

&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
	
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
	Запр.Текст = "ВЫБРАТЬ
	             |	Номенклатура.Ссылка
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	             |	И Номенклатура.Ссылка <> &Ссылка
	             |	И Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры";
	Выборка = Запр.Выполнить().Выбрать();
	Ном = 0;
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.ВидНоменклатуры = Объект.ВидНоменклатуры;
		Попытка
		    Об.Записать();
			Ном = Ном + 1;
		Исключение
		    Сообщить(СтрШаблон(НСтр("ru = 'Не удалось записать элемент %1: %2'; en = 'Failed to write item %1: %2'"), Выборка.Ссылка, ОписаниеОшибки()));
		КонецПопытки;
	КонецЦикла;
	Сообщить(НСтр("ru = 'Записано элементов: '; en = 'Items saved: '") + Ном);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		клВопрос(Новый ОписаниеОповещения("ВидНоменклатурыПриИзмененииЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Установить выбранный вид номенклатуры для ВСЕХ ПОДЧИНЕННЫХ товаров?'; en = 'Set the selected type of nomenclature for ALL SUBJECT goods?'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
