&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// © Primus1C  06.12.2025  НАЧАЛО ►
	ОткрытьФорму("ОбщаяФорма.ВводСтрокиНеогр", 
						Новый Структура("ЗакрыватьПриВыборе, Заголовок, Пояснение, РезультатВыполнения", 
										Истина, 
										НСтр("ru = 'Обороты серии'; en = 'Series turnover'"), 
										НСтр("ru = 'Введите серию, или несколько'; en = 'Enter a series or several'"),
										"Отчет.ОборотыОднойСерии.Форма"), 
						ПараметрыВыполненияКоманды.Источник);
	//Возврат;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	////2016.04.07

	//Серия = "";
	//гоВЗН("ОборотыСерии", "Серия", Серия, "Строка");
	//
	//Если НЕ ВвестиСтроку(Серия, НСтр("ru = 'Серия:'; en = 'Series:'"), ДлСтроки()) Тогда Возврат КонецЕсли; 
	//
	//Серия = СокрЛП(Серия);
	//Если Серия = "" Тогда Возврат КонецЕсли;
	//
	//гоСЗН("ОборотыСерии", "Серия", Серия);
	//
	//Отбор = Новый Структура("Серия, Фирма", Серия, гоФирма());
	//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	//ОткрытьФорму("Отчет.ОборотыОднойСерии.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры 

// © Primus1C  28.12.2023  НАЧАЛО ►
Функция ДлСтроки()

	Возврат Метаданные.ОпределяемыеТипы.ДлинаРучногоШК.Тип.КвалификаторыСтроки.Длина;
	
КонецФункции 
// © Primus1C  ОКОНЧАНИЕ ◄
