&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	СкладНадо = гоПараметрСеанса("Склад");
	гоУстановитьПараметрСеанса("Склад", 0);
	
	НоменклатураНадо = гоПараметрСеанса("Номенклатура");
	гоУстановитьПараметрСеанса("Номенклатура", 0);
	
	//2015.12.20
	ВалютаНадо = гоПараметрСеанса("ВалютаВыбора");
	гоУстановитьПараметрСеанса("ВалютаВыбора", 0);
	
	//2015.12.24
	ПоставщикНадо = гоПараметрСеанса("ПоставщикВыбора");
	гоУстановитьПараметрСеанса("ПоставщикВыбора", 0);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПараметры()
	гоСтандартныйОтбор(Список, 0, ТолькоОстатки);
	
	Список.Параметры.УстановитьЗначениеПараметра("Фирма", гоФирма());
	
	Если ФильтрСклады.Количество() = 0 Тогда
		Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФильтрСклады")).Использование = Ложь;
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ФильтрСклады", ФильтрСклады.ВыгрузитьЗначения());
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(СкладНадо) Тогда
		ФильтрСклады.Очистить();
		ФильтрСклады.Добавить(СкладНадо);
		Элементы.ФильтрСклады.ТолькоПросмотр = Истина;
		ТолькоОстатки = Истина;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(НоменклатураНадо) Тогда
		гоСтандартныйОтбор(Список, 1, Истина, НоменклатураНадо);
	КонецЕсли; 
	
	//2015.12.20
	Если ЗначениеЗаполнено(ВалютаНадо) Тогда
		гоСтандартныйОтбор(Список, 2, Истина, ВалютаНадо);
	КонецЕсли; 
	Элементы.ВалютаНадо.Видимость = ЗначениеЗаполнено(ВалютаНадо);
	
	//2015.12.24
	Если ЗначениеЗаполнено(ПоставщикНадо) Тогда
		гоСтандартныйОтбор(Список, 3, Истина, ПоставщикНадо);
	КонецЕсли; 
	Элементы.ПоставщикНадо.Видимость = ЗначениеЗаполнено(ПоставщикНадо);
	
	УстановитьВсеПараметры();
	
	Элементы.Список.ТекущийЭлемент = Элементы.Остаток;
	ЭтаФорма.ТекущийЭлемент = Элементы.Список;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСкладыПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОстаткиПриИзменении(Элемент)
	УстановитьВсеПараметры();
КонецПроцедуры
