&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	ПараметрыОтчета = Новый Структура;
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() = 1 Тогда 
		ПараметрыОтчета.Вставить("КлючВарианта", "КонечныеОстаткиСклад");
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);  
		П = Новый СтандартныйПериод;
		П.Вариант = ВариантСтандартногоПериода.Завтра;
		ПараметрыОтчета.Вставить("Период", П);
	КонецЕсли;	
		
	ОткрытьФорму("Отчет.ОборотыТовара.Форма", ПараметрыОтчета, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
