// © Primus1C  07.11.2023  НАЧАЛО ►

#Область ДействияФормы         

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента 	= "Инвойс";
	ИмяЖурнала		= "ПоставкиИнвойсов";
	
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	глПокраситьСтатусы(ЭтаФорма, "Список", Истина, Ложь, Ложь); 
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глУстановитьГраницуВидимости(Список);

	Если ЭтаФорма.Параметры.Свойство("ВыбранныеИнвойсы") Тогда
		
		ВыбранныеИнвойсы = ЭтаФорма.Параметры.ВыбранныеИнвойсы;
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ключ");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ВыбранныеИнвойсы;
		
		Отб.Представление = "Ключ";
		
		//Пол = ЭлементУО.Поля.Элементы.Добавить();
		//Пол.Использование = Истина;
		//Пол.Поле = Новый ПолеКомпоновкиДанных("Оформление");
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение); 
		
	КонецЕсли; 

	Если ЭтаФорма.Параметры.Свойство("ВидимостьКнопкиВыбора") Тогда    
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.Независимый;
    	Элементы.ФормаВыбрать.Видимость = ЭтаФорма.Параметры.ВидимостьКнопкиВыбора;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	гоЗаголовокИнтервал(ЭтаФорма, Истина); 
	
КонецПроцедуры
	
#КонецОбласти


#Область ДействияСписка
	
&НаСервере
Процедура ОбработкаВыбораНаСервере(Ключ)

	ВыбранныеИнвойсы.Добавить(Ключ);
	
	Для каждого ЭлементУО Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементУО.Представление = "Ключ" Тогда
			Список.УсловноеОформление.Элементы.Удалить(ЭлементУО);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
	
	Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отб.Использование = Истина;
	Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ключ");
	Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	Отб.ПравоеЗначение = ВыбранныеИнвойсы;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "Ссылка" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка); 
	Иначе
		Если Этаформа.Параметры.РежимВыбора Тогда 
			//+++
			Если Элемент.ТекущиеДанные <> Неопределено Тогда
				ПоследнийДокумент 	= Элемент.ТекущиеДанные.Ссылка;
				ПоследняяПоставка	= Элемент.ТекущиеДанные.Поставка;
				ПоследнееОтправлено = Элемент.ТекущиеДанные.Отправлено;
			КонецЕсли;			
			//---
			ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Ключ); 
			Элемент.Обновить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) 
	
	//Если Элемент.ТекущиеДанные <> Неопределено Тогда
	//	ПоследнийДокумент 	= Элемент.ТекущиеДанные.Ссылка;
	//	//ПоследняяПоставка 	= ?(Элемент.ТекущиеДанные.ПоставкаСтрокой="", 0, Число(Лев(Элемент.ТекущиеДанные.ПоставкаСтрокой,1)));
	//	ПоследняяПоставка	= Элемент.ТекущиеДанные.Поставка;
	//	ПоследнееОтправлено = Элемент.ТекущиеДанные.Отправлено;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда) 
	
	ОткрытьЗначение(Элементы.Список.ТекущиеДанные.Ссылка);

КонецПроцедуры                     

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄
