&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрКоманды = Неопределено Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда Возврат КонецЕсли; 
	Если гоРеквизит(ПараметрКоманды, "ЭтоГруппа") Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Товар", ПараметрКоманды); 
	// © Primus1C  31.08.2024  НАЧАЛО ►
	Если ОбщегоНазначенияПовтИсп.ДоступныЦеныЗакупки() Тогда
		Вариант = "ОстаткиОднойНоменклатуры";
	Иначе
		Вариант = "ОстаткиОднойНоменклатурыБезЦен";
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, Вариант);
	ОткрытьФорму("Отчет.ОстаткиТовара.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
