// © Primus1C  02.10.2023  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента 	= "_Инвойс";
	ИмяЖурнала		= "Инвойсы";
	
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");

	глПокраситьВалюты(ЭтаФорма, "Валюта"); 
    глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глУстановитьГраницуВидимости(Список);
	
	Если ЭтаФорма.Параметры.Свойство("ВыбранныеИнвойсы") Тогда
		
		ВыбранныеИнвойсы = ЭтаФорма.Параметры.ВыбранныеИнвойсы;
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();   
		
		Отб = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номер");
		Отб.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		Отб.ПравоеЗначение = ВыбранныеИнвойсы;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый); 
		
	КонецЕсли; 
	
	Если ЭтаФорма.Параметры.Свойство("ВидимостьКнопкиВыбора") Тогда
    	Элементы.ФормаВыбрать.Видимость = ЭтаФорма.Параметры.ВидимостьКнопкиВыбора;
	КонецЕсли;	
	
	Если ЭтаФорма.Параметры.Свойство("ИспользоватьСписокОтправок") Тогда
		//Элементы.Список.Видимость 			= НЕ ЭтаФорма.Параметры.ИспользоватьСписокОтправок; 
		//Элементы.ГруппаОтправок.Видимость 	= ЭтаФорма.Параметры.ИспользоватьСписокОтправок; 
		ВидСписка = ЭтаФорма.Параметры.ИспользоватьСписокОтправок;
	КонецЕсли;

    Элементы.Примечание.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьПримечаниеТекущегоДокументаВнизуСписка");
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ВыбранныеИнвойсы.Добавить(ВыбранноеЗначение)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Номер);
КонецПроцедуры

&НаКлиенте
Процедура СписокОтправокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработкаВыбораНаСервере(Элемент.ТекущиеДанные.Номер);
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПриИзменении(Элемент)
	УстановитьВидимостьСписков(ВидСписка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСписков(Вариант)

	Элементы.Список.Видимость 			= НЕ Вариант; 
	Элементы.ГруппаОтправок.Видимость 	= Вариант;
		
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьИнвойс(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область ПримечаниеТекущегоДокументаАсихрон

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Элементы.Примечание.Заголовок = "";
	Иначе                                
		//	Элементы.Примечание.Заголовок = Примечание(Элементы.Список.ТекущаяСтрока);  // это синхрон
		ДопПараметры = Элементы.Список.ТекущаяСтрока;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеДанныхДокументаЗавершение", ЭтотОбъект, ДопПараметры);
		НачатьПолучениеДанныхДокумента(ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхДокумента(ОписаниеОповещения) Экспорт

	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхДокументаЗавершение(ФормаВызова, ДопПараметры) Экспорт
	
	Элементы.Примечание.Заголовок = Примечание(ДопПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Примечание(ДокСсылка)
	
	Возврат ДокСсылка.Примечание;

КонецФункции 

#КонецОбласти

// © Primus1C  ОКОНЧАНИЕ ◄
