
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Фирма) Тогда
		Предупреждение(НСтр("Не указана фирма"));
		Возврат;
	КонецЕсли;
	
	Если Объект.ТаблицаКорректировки.Количество() > 0 Тогда
		Результат = Вопрос("При заполнении табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Да Тогда
			Объект.ТаблицаКорректировки.Очистить();
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Элементы.Заполнить.Заголовок = "Заполнить по " + Строка(Объект.Контрагент);
	Иначе
		Элементы.Заполнить.Заголовок = "Заполнить по всем";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДолгиОстатки.Контрагент КАК Контрагент,
	               |	ДолгиОстатки.Док КАК Док,
	               |	ДолгиОстатки.Валюта,
	               |	ДолгиОстатки.ПредоплатаПокупателяОстаток КАК ПредоплатаПокупателя,
	               |	ДолгиОстатки.ПокупательОстаток КАК ПокупательОстаток
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(
	               |			&Дата,
	               |			ВЫБОР
	               |				КОГДА НЕ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |					ТОГДА Контрагент = &Контрагент
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ) КАК ДолгиОстатки
	               |ГДЕ
	               |	ДолгиОстатки.ПредоплатаПокупателяОстаток МЕЖДУ 0.01 И 0.99
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент,
	               |	Док
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Контрагент",	 Объект.Контрагент);
	Запрос.УстановитьПараметр("Дата",		 Объект.Дата);
	
	Объект.ТаблицаКорректировки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьНаСервере()

