&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)                   

	Элементы.ГруппаЗП.Видимость = ОбщегоНазначенияПовтИсп.ДоступБухгалтерии(); 
	Элементы.ЛичнаяИнфо.Видимость = ОбщегоНазначенияПовтИсп.ДоступБухгалтерии(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьНаименование()

	Объект.Наименование = СокрЛП(СтрШаблон("%1 %2", СокрЛП(Объект.Имя), СокрЛП(Объект.Фамилия)));	

КонецПроцедуры



	