&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
	НачДата = НачалоДня(ТекущаяДата());
	КонДата = КонецДня(НачДата);
	
	//Элементы.ТаблСобытие.Видимость = гоАдминистратор();   
	
	// © Primus1C  10.01.2024  НАЧАЛО ►
	
	ТипЗначения = ТипЗнч(Объект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		НачДата = Объект.Дата;   
		ОтбиратьВсе = Истина;
	Иначе	
		НачДата = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//
	//ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблСобытие.Имя);

	//ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблСобытие.Значение");
	//ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	//ОтборУО.ПравоеЗначение = "Инвойс.Запись статуса";    
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	// © Primus1C  ОКОНЧАНИЕ ◄ 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция фСобытие(Стр)
	Если Стр = "_$Data$_.Delete" Тогда Возврат "Данные.Удаление"
	ИначеЕсли Стр = "_$Data$_.New" Тогда Возврат "Данные.Добавление"
	ИначеЕсли Стр = "_$Data$_.Post" Тогда Возврат "Данные.Проведение"
	ИначеЕсли Стр = "_$Data$_.TotalsPeriodUpdate" Тогда Возврат "Данные.Изменение периода рассчитанных итогов"
	ИначеЕсли Стр = "_$Data$_.Unpost" Тогда Возврат "Данные.Отмена проведения"
	ИначеЕсли Стр = "_$Data$_.Update" Тогда Возврат "Данные.Изменение"
	Иначе
		Возврат Стр;
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура СформироватьСервер()
	Табл.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда Возврат КонецЕсли; 
	
	// © Primus1C  21.05.2025  НАЧАЛО ►  
	// закомментировано
	////2015.09.09
	//Попытка
	//	Дат = Объект.Дата;
	//	Если НЕ ЗначениеЗаполнено(НачДата) Тогда НачДата = НачалоДня(Дат) КонецЕсли; 
	//	Если НЕ ЗначениеЗаполнено(КонДата) Тогда КонДата = КонецДня(Дат) КонецЕсли; 
	//Исключение
	//    //ничего страшного, значит справочник
	//КонецПопытки; 
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Если НЕ ЗначениеЗаполнено(НачДата) Тогда НачДата = НачалоДня(ТекущаяДата()) КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(КонДата) Тогда КонДата = КонецДня(ТекущаяДата()) КонецЕсли; 
	
	//Фильтр = Новый Структура("ДатаНачала, ДатаОкончания", НачДата, КонДата);
	Фильтр = Новый Структура("ДатаНачала, ДатаОкончания, Данные", НачДата, КонДата, Объект);
	Вабл = Новый ТаблицаЗначений;
	
	СохВремя = ТекущаяДата();	
	СохВремяВсе = ТекущаяДата();	
	
	//ВыгрузитьЖурналРегистрации(Вабл, Фильтр, "Дата,ИмяПользователя,Событие,Комментарий,ПредставлениеДанных,Данные", , 100000);
	
	гоЗаписьЖурналаРегистрации("За период с " + НачДата + " по " + КонДата, "Журнал по объекту", "Формирование начато", Объект, 2);
	
	Если ОтбиратьВсе Тогда 
		ВыгрузитьЖурналРегистрации(Вабл, Фильтр, "Дата,ИмяПользователя,Событие,ПредставлениеСобытия,Комментарий,ПредставлениеДанных,Данные", , );
	Иначе 
		ВыгрузитьЖурналРегистрации(Вабл, Фильтр, "Дата,ИмяПользователя,Событие,ПредставлениеСобытия,Комментарий,ПредставлениеДанных,Данные", , 400000);
	КонецЕсли; 
	
	//Если гоАдминистратор() Тогда гоВремя(СохВремя, НСтр("ru = 'Получили все события = '; en = 'Received all events = '") + Вабл.Количество(), , Истина) КонецЕсли; 
	
	Нашли = Вабл.НайтиСтроки(Новый Структура("Данные", Объект));
	
	//Если гоАдминистратор() Тогда гоВремя(СохВремя, НСтр("ru = 'Отфильтровали события = '; en = 'Events filtered = '") + Нашли.Количество(), , Истина) КонецЕсли; 
	
	Адм = гоАдминистратор();
	
	Для Каждого Стр Из Нашли Цикл
		Если БезСтандартных Тогда
			Если Лев(Стр.Событие, 2) = "_$" Тогда Продолжить КонецЕсли; КонецЕсли;
		Если БезСобытийЖурнала Тогда
			Если Лев(Стр.Событие, 18) = "Журнал по объекту." Тогда Продолжить КонецЕсли; КонецЕсли;
			
		Если НЕ Адм Тогда  
			Если Лев(Стр.Событие, 17) = "Журнал по объекту" Тогда Продолжить КонецЕсли; 
		КонецЕсли;
			
		Нов = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Нов, Стр);
		
		//это уже не надо переводить
		//Нов.Событие = фСобытие(Нов.Событие);
	КонецЦикла; 
	
	//Если гоАдминистратор() Тогда гоВремя(СохВремя, НСтр("ru = 'Добавили в таблицу на форме = '; en = 'Added to the table on the form = '") + Табл.Количество()) КонецЕсли; 
	
	гоЗаписьЖурналаРегистрации(гоВремя(СохВремяВсе, , , , Истина) + "За период с " + НачДата + " по " + КонДата, "Журнал по объекту", "Формирование закончено", Объект, 2);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	СформироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	////2013.12.11
	////пусть фильтрует, за день допустимо
	//ОтбиратьВсе = Истина;
	//
	//Если гоАдминистратор() Тогда
	//	Элементы.ОтбиратьВсе.ТолькоПросмотр = Ложь;
	//	//2015.09.09
	//	//теперь доступно всем
	//	//Элементы.НачДата.ТолькоПросмотр = Ложь;
	//	Элементы.КонДата.ТолькоПросмотр = Ложь;
	//КонецЕсли; 
	
	//здесь уже есть все параметры
	СформироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура МинусДень(Команда)
	НачДата = гоДобавитьДень(НачДата, -1);
	КонДата = гоДобавитьДень(КонДата, -1);
	СформироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПлюсДень(Команда)
	НачДата = гоДобавитьДень(НачДата, 1);
	КонДата = гоДобавитьДень(КонДата, 1);
	СформироватьСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЧтоМожно(Команда)
	клПоказатьЧтоМожно(Объект);
КонецПроцедуры

&НаКлиенте
Процедура НачДатаПриИзменении(Элемент)
	//2015.09.09
	//КонДата = КонецДня(НачДата);
КонецПроцедуры

