// © Primus1C  14.04.2026  НАЧАЛО ►

Процедура УстановитьПараметрВФормеОтчета(ФормаОтчета, ИмяПараметра, Значение) Экспорт
	
	ПараметрКД = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	
	// Ищем параметр в базовых настройках СКД отчета
	ЭлементНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКД);
	
	Если ЭлементНастройки <> Неопределено Тогда
		ЭлементНастройки.Значение = Значение;
		ЭлементНастройки.Использование = Истина;
		
		// Обязательно проталкиваем в пользовательские настройки, чтобы параметры появились в шапке
		Идентификатор = ЭлементНастройки.ИдентификаторПользовательскойНастройки;
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			ПользНастройка = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
			Если ПользНастройка <> Неопределено Тогда
				ПользНастройка.Значение = Значение;
				ПользНастройка.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄