// © Primus1C  05.02.2024  НАЧАЛО ►

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	//Если РольДоступна("Администратор") Тогда
	//	
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//	ДанныеВыбора = Новый СписокЗначений;     
	//	Для каждого П Из Метаданные.Перечисления.ВидДвиженияДенег.ЗначенияПеречисления Цикл 
	//		Если П.Имя <> "Инвестиции" Тогда
	//			ЗначениеПеречисления = Перечисления.ВидДвиженияДенег[П.Имя]; 
	//			ДанныеВыбора.Добавить(ЗначениеПеречисления); 
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	//	
	////Если РольДоступна("Администратор") ИЛИ РольДоступна("Зарплата") Тогда
	////	
	////Иначе
	////	
	////	СтандартнаяОбработка = Ложь;
	////	
	////	ДанныеВыбора = Новый СписокЗначений;     
	////	
	////	Для каждого П Из Метаданные.Перечисления.ВидДвиженияДенег.ЗначенияПеречисления Цикл 
	////		Если П.Имя <> "Зарплата" Тогда
	////			ЗначениеПеречисления = Перечисления.ВидДвиженияДенег[П.Имя]; 
	////			//Если лЦвет = Новый Цвет(255, 255, 255) Тогда
	////			ДанныеВыбора.Добавить(ЗначениеПеречисления); 
	////			//Иначе
	////			//	ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, лЦвет,)); 
	////			//КонецЕсли;
	////		КонецЕсли;
	////	КонецЦикла; 
	////	
	////КонецЕсли;
	
КонецПроцедуры 

// © Primus1C  ОКОНЧАНИЕ ◄
