
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Документ.ИнвойсЗакупки.Форма.ФормаДокумента" Тогда
		ПараметрыВыполненияКоманды.Источник.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid");	
		ПараметрыВыполненияКоманды.Источник.СтатусОплатыПриИзменении(Неопределено);
		ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина;
	Иначе
		Инв = РеквизитыИнвойса(ПараметрКоманды); 
		Отказ = Ложь;
		ЗаписатьИнвойсНаСервере(ПараметрКоманды, Отказ);
		Если Отказ Тогда
			клНамекнуть(НСтр("ru = 'Не удалось записать инвойс'; en = 'Failed to write invoice'"), 
						Инв.Номер + " (" + Инв.Дата + ")",   
						БиблиотекаКартинок.ДиалогСтоп);
		Иначе
			РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(ПараметрКоманды, , , ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid"), , , , , "команда пользователя");
			ОповеститьОбИзменении(Тип("ДокументСсылка.ИнвойсЗакупки"));  
			Оповестить("ИзмененСтатусОплаты", ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid"), ПараметрыВыполненияКоманды); 
			клНамекнуть(НСтр("ru = 'Установлен статус инвойса'; en = 'Set status of invoice'"), 
						Инв.Номер + " (" + Инв.Дата + ")" + Символы.ПС + Символы.ПС + 
						НСтр("ru = 'НЕ ОПЛАЧЕН'; en = 'NOT PAID'"),   
						БиблиотекаКартинок.ОформлениеФлагКрасный);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РеквизитыИнвойса(СсылкаИнвойс)

	Возврат Новый Структура("Номер, Дата", СсылкаИнвойс.НомерИнвойсаПоставщика, Формат(СсылкаИнвойс.ДатаИнвойсаПоставщика,"ДФ=dd.MM.yyyy"));	

КонецФункции 

&НаСервере
Процедура ЗаписатьИнвойсНаСервере(СсылкаИнвойс, Отказ)

	ДокОбъект = СсылкаИнвойс.ПолучитьОбъект(); 
	ДокОбъект.ДатаОплаты = Дата(1, 1, 1);
	Попытка
		ДокОбъект.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;	
	
КонецПроцедуры
