
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Доход = 0;
	ПроцентКомиссии = 1 - Контрагент.ПроцентКомиссионногоВознаграждения / 100;
	
	Движения.ОстаткиТовара.Записывать 		= Истина;
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;
	Движения.РасходыДоходы.Записывать 		= Истина;
	Движения.Долги.Записывать 				= Истина;

	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход; 
		Движение.Период 			= Дата;
 		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
        Движение.Количество			= ТекСтрокаТовары.Количество;  
		К = ТекСтрокаТовары.Количество / ТекСтрокаТовары.КоличествоНаКомиссии; 
		СуммаЗакупкиСЗатратами  = ТекСтрокаТовары.СуммаНаКомиссии * К; //(долл)  
		СуммаПередачиНаКомиссию = ТекСтрокаТовары.СуммаКомиссионера * К; // (долл)
		Движение.Сумма				= СуммаЗакупкиСЗатратами; 		
		Движение.СуммаКомиссионера 	= СуммаПередачиНаКомиссию;    
		
		// РН Продажи 
		Движение = Движения.Продажи.Добавить(); 
		Движение.Период				= Дата;
		Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия				= ТекСтрокаТовары.Партия;
		Движение.ДокументПрихода	= ТекСтрокаТовары.ДокументПрихода;
		Движение.Покупатель			= Контрагент;
		Движение.Поставщик			= ТекСтрокаТовары.Поставщик;
		Движение.Валюта				= Валюта;
		Движение.Автор				= КемСоздан;
		Движение.Склад				= СкладКомиссии;
		Движение.Фирма				= Фирма;
		Движение.Количество			= ТекСтрокаТовары.Количество;     
		// суммой продажи считаем полную сумму, которую прислал комиссионер (несмотря на то, что от нее отнимается процент вознаграждения)
		Движение.Сумма				= ТекСтрокаТовары.Сумма;
		Движение.СуммаВБазВалюте	= ТекСтрокаТовары.Сумма / Курс; 
		Движение.Наценка            = ТекСтрокаТовары.Сумма - ТекСтрокаТовары.СуммаКомиссионера * Курс;
		Движение.НаценкаВБазВалюте	= ТекСтрокаТовары.Сумма / Курс - ТекСтрокаТовары.СуммаКомиссионера; 
		// доход  
		Доход = Доход + 
				ТекСтрокаТовары.СуммаКомиссионера - ТекСтрокаТовары.СуммаНаКомиссии + 					// превышение цены, по к-рой передан товар над ценой закупки
				(ТекСтрокаТовары.Сумма / Курс - ТекСтрокаТовары.СуммаКомиссионера) * ПроцентКомиссии;   // разница от цены реализации и ценой, по к-рой товар передан комиссионеру
	КонецЦикла;

	// РН РасходыДоходы
	Движение = Движения.РасходыДоходы.Добавить();
	Движение.Период 	= Дата;
	Движение.Фирма 		= Фирма;
	Движение.Вид 		= Перечисления.ДоходРасход.Доход;
	Движение.Статья 	= Статья;
	Движение.Валюта 	= Валюта;
	Движение.Сумма 		= Доход;
	
	// РН Долги
	Движение = Движения.Долги.ДобавитьПриход();
	Движение.Период 				= Дата;
	Движение.Фирма 					= Фирма;
	Движение.Док 					= Ссылка;
	Движение.Валюта 				= Валюта;
	Движение.Контрагент 			= Контрагент;
	Движение.ДолгПокупателя 		= Доход + ТаблицаТовары.Итог("СуммаНаКомиссии");
	Движение.ПредоплатаПокупателя 	= 0;
	Движение.ДолгПоставщику 		= 0;
	Движение.ПредоплатаПоставщику 	= 0;

КонецПроцедуры


Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), СкладКомиссии, Ошибки, Фирма);
	ПроведениеДокументов.ПроверитьДубли(ТаблицаТовары, Ошибки);
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	//СтруктураПолей = Новый Структура;
	//СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	//СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	//СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	//СтруктураПолей.Вставить("Серия",				"Серия");
	//СтруктураПолей.Вставить("Партия",				"Партия");
	//СтруктураПолей.Вставить("ДокументПрихода",		"Партия.Док");
	//СтруктураПолей.Вставить("Поставщик",			"Партия.Контрагент");
	//СтруктураПолей.Вставить("Количество",			"Количество");
	//СтруктураПолей.Вставить("Цена",					"Цена");
	//СтруктураПолей.Вставить("Сумма",				"Сумма");   
	//
	//ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	//ТаблицаТовары = ЗапросТовары.Выгрузить();
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", 	Ссылка);
	Запр.УстановитьПараметр("Дата", 	МоментВремени());
	Запр.УстановитьПараметр("Склад", 	СкладКомиссии);
	Запр.УстановитьПараметр("Контрагент", Контрагент);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТоварыТЧ.НомерСтроки КАК НомерСтроки,
	             |	ТоварыТЧ.Номенклатура КАК Номенклатура,
	             |	ТоварыТЧ.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	             |	ТоварыТЧ.Серия КАК Серия,
	             |	ТоварыТЧ.Партия КАК Партия,
	             |	ТоварыТЧ.Цена КАК Цена,
	             |	ТоварыТЧ.Количество КАК Количество,
	             |	ТоварыТЧ.Сумма КАК Сумма,
	             |	ТоварыТЧ.Партия.Контрагент КАК Поставщик,
	             |	ТоварыТЧ.Партия.Док КАК ДокументПрихода,
	             |	ТоварыНаКомиссии.КоличествоОстаток КАК КоличествоНаКомиссии,
	             |	ТоварыНаКомиссии.СуммаОстаток КАК СуммаНаКомиссии,
	             |	ТоварыНаКомиссии.СуммаКомиссионераОстаток КАК СуммаКомиссионера
	             |ИЗ
	             |	Документ.ОтчетКомиссионера.Товары КАК ТоварыТЧ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаКомиссии.Остатки(
	             |				&Дата,
	             |				Контрагент = &Контрагент
	             |					И Склад = &Склад) КАК ТоварыНаКомиссии
	             |		ПО ТоварыТЧ.Партия = ТоварыНаКомиссии.Партия
	             |ГДЕ
	             |	ТоварыТЧ.Ссылка = &Ссылка";

	ТаблицаТовары = Запр.Выполнить().Выгрузить(); 
	
    Возврат ТаблицаТовары;
	
КонецФункции 

