
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
		
	ДанныеВыбора = Новый СписокЗначений;     
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.AirIndia, Перечисления.Перевозчики.AirIndia, , БиблиотекаКартинок.AirIndia_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.DHL, Перечисления.Перевозчики.DHL, , БиблиотекаКартинок.DHL);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.EtihadAirlines, Перечисления.Перевозчики.EtihadAirlines, , БиблиотекаКартинок.EtihadAirways_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.EmiratesSkyCargo, Перечисления.Перевозчики.EmiratesSkyCargo, , БиблиотекаКартинок.Emirates);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.Fedex, Перечисления.Перевозчики.Fedex, , БиблиотекаКартинок.Fedex);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.KoreanAirlines, Перечисления.Перевозчики.KoreanAirlines, , БиблиотекаКартинок.korean_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.QantasAirlines, Перечисления.Перевозчики.QantasAirlines, , БиблиотекаКартинок.quantas_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.SingaporeAirlines, Перечисления.Перевозчики.SingaporeAirlines, , БиблиотекаКартинок.singapore_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.TurkishAirlines, Перечисления.Перевозчики.TurkishAirlines, , БиблиотекаКартинок.turk_logo);
	ДанныеВыбора.Добавить(Перечисления.Перевозчики.UPS, Перечисления.Перевозчики.UPS, , БиблиотекаКартинок.upc_logo);
	
КонецПроцедуры
