&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Валюта = Параметры.Валюта;
	Количество = Параметры.Количество;
	Цена = Параметры.Цена;
	Фирма = Параметры.Фирма;
	Номенклатура = Параметры.Номенклатура;
	Поставщик = Параметры.Поставщик;
	
	ЭтаФорма.Заголовок = гоИмя(Номенклатура, Ложь);
	
	стрОстаток = "";
	стрПЦена = "";
	
	Если гоНПЗ(Номенклатура) Тогда
		стрОстаток = НСтр("ru = 'Ост. номенклатуры = '; en = 'Good balance = '") + омСервер.ОстатокНоменклатуры(Фирма, , Номенклатура);
		
		ВернутьЦену = 0;
		ВернутьВалюту = Справочники.Валюты.ПустаяСсылка();
		ВернутьДату = гоПустаяДата();
		омСервер.ПоследняяЦенаЗакупки(Номенклатура, Фирма, Поставщик, ВернутьЦену, ВернутьВалюту, ВернутьДату, Валюта);
		
		Если ВернутьЦену <> 0 Тогда  
			стрПЦена = НСтр("ru = 'Посл. цена закупки = '; en = 'Last purchase price = '") + гоСуммаЗн(ВернутьЦену, Фирма.ЧислоЗнаковЦенаЗакупки) + " " + Валюта;
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.Количество.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковКоличество;
	Элементы.Цена.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковЦенаЗакупки;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	Если Количество = 0 Тогда клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity not entered!'")); Возврат; КонецЕсли; 
	
	Пар = Новый Структура;
	Пар.Вставить("Количество", Количество);
	Пар.Вставить("Цена", Цена);
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
