&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоТовару = Справочники.Номенклатура.ПустаяСсылка();
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("Товар") Тогда
			ПоТовару = Параметры.Отбор.Товар;
			//Элементы.ПоТовару.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//2015.12.25
	//хочу как-то добраться к формату вывода цена закупки
	
КонецПроцедуры

&НаКлиенте
Процедура Резервы(Команда)
	Если гоПЗ(ПоТовару) Тогда Возврат КонецЕсли; 
	
	Отбор = Новый Структура("Номенклатура", ПоТовару);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	ОткрытьФорму("Отчет.РезервыОднойНоменклатуры.Форма", ПараметрыФормы, ЭтаФорма, Истина, );
КонецПроцедуры

&НаКлиенте
Процедура МояСформировать(Команда)
	
	//Отчет.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы[2].Элементы[18].Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти = 0;
	//Отчет.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы[2].Элементы[18].ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти = 0;
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ЭтаФорма.Заголовок  = СтрШаблон("%1 (%2)", РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, ЭтотОбъект.ПредставлениеТекущегоВарианта);

КонецПроцедуры

