// © Primus1C  26.06.2023  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ РольДоступна("ИнвойсЗакупкиМинимальный") Тогда
	//	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,
	//								"3 КАК Инвойс",
	//								"ВЫБОР
	//								|КОГДА СостоянияИнвойсов.Инвойс = ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	//								|	ТОГДА 3
	//								|КОГДА СостоянияИнвойсов.Инвойс.Проведен
	//								|	ТОГДА 0
	//								|КОГДА СостоянияИнвойсов.Инвойс.ПометкаУдаления
	//								|	ТОГДА 2
	//								|ИНАЧЕ 1
	//								|КОНЕЦ КАК Инвойс");
	//КонецЕсли;
	
	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	
	лРаскраскаСтатусов =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеСписка");
	глПокраситьСтатусы(ЭтаФорма, "Список", лРаскраскаСтатусов, лРаскраскаСтатусов, лРаскраскаСтатусов);  
    //глПокраситьПомеченныеНаУдаление(ЭтаФорма);

	Элементы.КоличествоСообщений.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСообщения");
	
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.Видимость = Ложь;
	Попытка
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокумент_ИнвойсСоздатьНаОсновании.Видимость = Ложь;
	Исключение
	КонецПопытки;

	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбновить.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "Вложения" Тогда
		СтандартнаяОбработка = Ложь;
		//ОткрытьФорму("РегистрСведений.ХранилищеФайлов.Форма.УпрФормаСписка", 
		//			Новый Структура("ОбъектУИД,Владелец", ВыбраннаяСтрока.УникальныйИдентификатор(), ВыбраннаяСтрока), 
		//			ЭтаФорма);    
		ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									ВыбраннаяСтрока, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									"Файл_П0",
									Неопределено);
		ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

	ИначеЕсли Поле.Имя = "Инвойс" Тогда		
	    СтандартнаяОбработка = Ложь; 
		Спис = ПодчиненныеИнвойсы(ВыбраннаяСтрока);
		Если Спис.Количество() = 1 Тогда
        	ОткрытьЗначение(Спис.Получить(0).Значение);   
		Иначе
			Инв = ВыбратьИзМеню(Спис, Элемент);   
			Если Инв <> Неопределено Тогда
				ОткрытьЗначение(Инв);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодчиненныеИнвойсы(ИнвойсЗакупкиСсылка)

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДокументОснование", ИнвойсЗакупкиСсылка);
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	_Инвойс.Ссылка,
	             |	_Инвойс.ПометкаУдаления,
	             |	_Инвойс.Проведен,
	             |	_Инвойс.ВКД_НомерИнвойсаПоставщика,
	             |	_Инвойс.ВКД_ДатаИнвойсаПоставщика,
	             |	_Инвойс.ВидОперации
	             |ИЗ
	             |	Документ._Инвойс КАК _Инвойс
	             |ГДЕ
	             |	_Инвойс.ДокументОснование = &ДокументОснование
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	_Инвойс.Дата";
    Выборка = Запр.Выполнить().Выбрать();  
	Спис = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
    	Спис.Добавить(	Выборка.Ссылка, 
						СтрШаблон("%1 (%2)", Выборка.ВКД_НомерИнвойсаПоставщика, Выборка.ВидОперации), , 
						?(Выборка.Проведен, БиблиотекаКартинок.ДокументПроведен, ?(Выборка.ПометкаУдаления, БиблиотекаКартинок.ДокументУдален, БиблиотекаКартинок.ДокументНеПроведен))	);
	КонецЦикла;
	Возврат Спис;
	
КонецФункции 

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.Свойство("СтатусОплаты") Тогда
			Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОплатить") <> Неопределено Тогда
				Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОплатить.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Paid");
			КонецЕсли;
			Если Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументИнвойсЗакупкиОтменитьОплату") <> Неопределено Тогда
				Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументИнвойсЗакупкиОтменитьОплату.Доступность = Элемент.ТекущиеДанные.СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid");
			КонецЕсли;  
		КонецЕсли;	             
		Если Элемент.ТекущийЭлемент <> Неопределено Тогда
			//Если Элемент.ТекущийЭлемент.Имя = "Вложения" Тогда
				ДобавитьКомандыСохраненияВложений(Элемент.ТекущаяСтрока);
			//КонецЕсли; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандыСохраненияВложений(ИнвойсСылка)
	
	возврат;
	масФайлов = РегистрыСведений.ХранилищеФайлов.ПолучитьМассивФайлов(ИнвойсСылка, Перечисления.НазначениеФайлов.Прочее);
	
	Для Инд = 0 По масФайлов.ВГраница() Цикл
	
		ИмяКоманды = "СохранитьВложение_" + Формат(Инд,"ЧЦ=2; ЧВН=");
		Команда = Команды.Добавить(ИмяКоманды);
		Команда.Заголовок = "Сохранить: " + 1;
		Команда.Действие  = "СохранениеВложенияИзКонтекстногоМеню";

		КнопкаКоманды = Элементы.Добавить("КнопкаКоманды" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.Список.КонтекстноеМеню);
		КнопкаКоманды.ИмяКоманды = ИмяКоманды;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСтатусОплаты" Тогда
		СписокПриАктивизацииСтроки(Элементы.Список);	
	КонецЕсли;                                      
	
КонецПроцедуры                                      

// © Primus1C  ОКОНЧАНИЕ ◄
