// © Primus1C  07.11.2023  НАЧАЛО ►

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, МножественныйВыбор, ВыбранныеИнвойсы, ВидимостьКнопкиВыбора, ИспользоватьСписокОтправок",
						Ложь, Ложь, Ложь, Новый СписокЗначений, Ложь, Ложь); 
	ОткрытьФорму("Документ._Инвойс.Форма.ФормаВыбораДоставки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
