// © Primus1C  20.01.2024  НАЧАЛО ►

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеДокумента") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;     
		
		Для каждого П Из Метаданные.Перечисления.СтатусыИнвойса.ЗначенияПеречисления Цикл  
			ЗначениеПеречисления = Перечисления.СтатусыИнвойса[П.Имя]; 
			лЦвет = ОбщегоНазначенияПовтИсп.ЦветЭлементаСписка(П.Имя);
			Если лЦвет = Новый Цвет(255, 255, 255) Тогда
				ДанныеВыбора.Добавить(ЗначениеПеречисления); 
			Иначе
				ДанныеВыбора.Добавить(ЗначениеПеречисления, Новый ФорматированнаяСтрока(П.Синоним,,, лЦвет,)); 
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры 

// © Primus1C  ОКОНЧАНИЕ ◄
