#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереСписок(ЭтаФорма) Тогда Отказ = Истина; Возврат; КонецЕсли;
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Стр Из Строки Цикл  
		
		лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(стр.ключ.ИдентификаторПользователяИБ);
		Если лПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		лРоли = "";
		Для каждого Р Из лПользовательИБ.Роли Цикл
			лРоли = лРоли + Р.Имя + ", ";
		КонецЦикла;
		
		Стр.Значение.Данные.Роли = Лев(лРоли, СтрДлина(лРоли)-2);
		
	КонецЦикла;                                
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#Область Команды
	
&НаКлиенте
Процедура РазрешитьДоступ(Команда)
	клВопрос(Новый ОписаниеОповещения("РазрешитьДоступЗавершение", ЭтотОбъект), "Разрешить всем пользователям доступ к товарным остаткам?");
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьДоступЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Ном = 0;
	УстановитьДоступ(Истина, Ном);
	клНамекнуть("Товарные остатки", "Установлен доступ пользователей: " + Ном, БиблиотекаКартинок.ДиалогИнформация);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьДоступ(Команда)
	клВопрос(Новый ОписаниеОповещения("ЗапретитьДоступЗавершение", ЭтотОбъект), "Запретить всем пользователям (кроме администраторов) доступ к товарным остаткам?");
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьДоступЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Ном = 0;
	УстановитьДоступ(Ложь, Ном);
	клНамекнуть("Товарные остатки", "Запрещен доступ пользователей: " + Ном, БиблиотекаКартинок.ДиалогИнформация);
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступ(Доступ, Ном)

	УстановитьПривилегированныйРежим(Истина);

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Пользователи.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	НЕ Пользователи.ПометкаУдаления";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.Ссылка.ИдентификаторПользователяИБ);
		Если лПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭтоАдмин = Ложь;
		Для каждого Р Из лПользовательИБ.Роли Цикл
			Если Р.Имя = "Администратор" Тогда
				ЭтоАдмин = Истина;
			КонецЕсли;	
			
		КонецЦикла;
		Если НЕ ЭтоАдмин Тогда
			спр = Выборка.Ссылка.ПолучитьОбъект();
			спр.ДоступКОстаткамТоваров = Доступ; 
			спр.Записать();
			Ном = Ном + 1;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры   

#КонецОбласти

 
