
&НаСервере
Процедура УстановитьСтатусыПоУмолчаниюНаСервере()
	//Запись.Статус 			= Перечисления.СтатусыИнвойса.НеОтправлен;
	Запись.Статус 			= Перечисления.СтатусыИнвойса.ПустаяСсылка();
	Запись.СтатусИнспекции 	= Перечисления.СтатусыИнспекции.NotInspected;
	Запись.СтатусОплаты 	= Перечисления.СтатусыОплаты.NotPaid; 
	Запись.СтатусОплатыАвто = Перечисления.Долги.Неоплачено; 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусыПоУмолчанию(Команда)
	УстановитьСтатусыПоУмолчаниюНаСервере();
КонецПроцедуры
