&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Количество = Параметры.Количество;
	Фирма = Параметры.Фирма;
	Номенклатура = Параметры.Номенклатура;
	Партия = Параметры.Партия;
	
	ЭтаФорма.Заголовок = гоИмя(Партия, Ложь);
	
	Склад = ?(Параметры.Свойство("Склад"), Параметры.Склад, 0);
	
	стрОстаток = "";
	Если гоНПЗ(Партия) И гоНПЗ(Склад) Тогда
		стрОстаток = гоИмя(Склад) + ": ост. партии = " + омСервер.ОстатокПартии(Фирма, Склад, Партия);
	КонецЕсли; 
	
	Элементы.Количество.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковКоличество;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	Пар = Новый Структура;
	Пар.Вставить("Количество", Количество);
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры
