&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
//2017.03.20
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	ЭтаФорма.Заголовок  = СтрШаблон("%1 (%2)", РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, ЭтотОбъект.ПредставлениеТекущегоВарианта);

	//МасКас = омСервер.МассивКасс();
	//Если МасКас.Количество() = 0 Тогда 
	//	гоУстановитьПараметр(ЭтаФорма.Отчет, "Кассы", , Истина);
	//Иначе 
	//	гоУстановитьПараметр(ЭтаФорма.Отчет, "Кассы", МасКас);
	//КонецЕсли; 
	//
	//ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры

// © Primus1C  23.03.2025  НАЧАЛО ►

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда        
		
		СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию; 
		
		Если Параметры.Отбор.Свойство("Кассы") Тогда 
			Параметр = Настройки.ПараметрыДанных.Элементы.Найти("Кассы");   
			Если Параметр <> Неопределено Тогда
				Параметр.Значение =  Параметры.Отбор.Кассы;
				Параметр.Использование = Истина;  
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли; 
	
	//Если Параметры.Свойство("Вариант") Тогда       
	//	
	//	НастройкиОтчета = СхемаКомпоновкиДанных.ВариантыНастроек[Параметры.Вариант].Настройки;

	//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	//	
	//КонецЕсли;	
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
