&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фирма = Параметры.Фирма;
	Валюта = Параметры.Валюта;
	Контрагент = Параметры.Контрагент;
	Накладных = Параметры.Накладных;
	Сумма = Параметры.Сумма;
	Оплата = Сумма;
	Сдача = 0;
	
	ЭтоВозврат = ?(Параметры.Свойство("ЭтоВозврат"), Параметры.ЭтоВозврат, Ложь);
	ЭтоПриход = ?(Параметры.Свойство("ЭтоПриход"), Параметры.ЭтоПриход, Ложь);
	ЭтоОплатаПоставщику = ?(Параметры.Свойство("ЭтоОплатаПоставщику"), Параметры.ЭтоОплатаПоставщику, Ложь);
	
	Если ЭтоВозврат ИЛИ ЭтоПриход Тогда
		ЭтаФорма.Заголовок = "Введите сумму выдачи";
		Элементы.Оплата.Заголовок = "ВЫДАЧА";
		//можно еще запретить вводить сумму оплаты и убрать понятие сдачи вообще
		Элементы.Оплата.ТолькоПросмотр = НЕ ЭтоОплатаПоставщику;
		Элементы.ГруппаСдача.Видимость = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	Если гоПЗ(ДСчет) Тогда клОшибка("Не выбрана текущая касса!"); Возврат; КонецЕсли;
	
	Пар = Новый Структура;
	Пар.Вставить("Оплата", Оплата);
	Пар.Вставить("ДСчет", ДСчет);
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриИзменении(Элемент)
	Сдача = Оплата - Сумма;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтрокаОстатков(Касса)
	Если гоПЗ(Касса) Тогда Возврат "?" КонецЕсли;
	
	Фильтр = Новый Структура("Касса", Касса);
	
	Табл = РегистрыНакопления.Деньги.Остатки(, Фильтр, "Валюта", "Остаток");
	Если Табл.Количество() = 0 Тогда Возврат "" КонецЕсли; 
	
	Рез = "";
	Для Каждого стрТабл Из Табл Цикл
		гоРезСоо(Рез, гоСуммаЗнВал(стрТабл.Остаток, стрТабл.Валюта, 2), ",   ");
	КонецЦикла; 
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	ОстаткиПоСчету = СтрокаОстатков(ДСчет);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если гоНПЗ(ДСчет) Тогда
		Если гоРеквизит(ДСчет, "Владелец") <> Фирма Тогда ДСчет = 0 КонецЕсли; КонецЕсли; 
		
	нетСчета = Ложь;
	клОплатаДСчетПриОткрытии(ЭтаФорма, нетСчета);
	Если нетСчета Тогда Отказ = Истина; ЭтаФорма.Закрыть(); Возврат; КонецЕсли;
		
	ОстаткиПоСчету = СтрокаОстатков(ДСчет);
КонецПроцедуры

&НаКлиенте
Процедура ДСчетПриИзменении(Элемент)
	ОбновитьОстатки(0);
КонецПроцедуры
